-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Jan 26, 2026 at 02:33 PM
-- Server version: 11.4.9-MariaDB-cll-lve
-- PHP Version: 8.3.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `aaryyjly_beglas`
--

-- --------------------------------------------------------

--
-- Table structure for table `balances`
--

CREATE TABLE `balances` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `customer_id` bigint(20) UNSIGNED NOT NULL,
  `amount` decimal(14,2) NOT NULL,
  `currency` enum('IQD','USD') NOT NULL,
  `note` varchar(255) DEFAULT NULL,
  `before_balance` decimal(14,2) NOT NULL DEFAULT 0.00,
  `after_balance` decimal(14,2) NOT NULL DEFAULT 0.00,
  `type` enum('add','subtract') NOT NULL DEFAULT 'add',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `balances`
--

INSERT INTO `balances` (`id`, `customer_id`, `amount`, `currency`, `note`, `before_balance`, `after_balance`, `type`, `created_at`, `updated_at`) VALUES
(2, 32, 4500.00, 'USD', NULL, 0.00, 4500.00, 'add', '2026-01-22 15:24:10', '2026-01-22 15:24:10'),
(3, 236, 9430000.00, 'IQD', NULL, 0.00, 9430000.00, 'add', '2026-01-22 15:31:56', '2026-01-22 15:31:56'),
(6, 34, 250.00, 'IQD', 'پارەدان بۆ قەرز', 4087250.00, 4087000.00, 'subtract', '2026-01-24 12:43:46', '2026-01-24 12:43:46'),
(7, 34, 2546000.00, 'IQD', 'پارەدان بۆ قەرز', 4087000.00, 1541000.00, 'subtract', '2026-01-24 12:58:22', '2026-01-24 12:58:22'),
(8, 284, 254.00, 'USD', 'پارەدان بۆ قەرز', 254.24, 0.24, 'subtract', '2026-01-24 12:59:24', '2026-01-24 12:59:24'),
(9, 182, 5015000.00, 'IQD', NULL, 0.00, 5015000.00, 'add', '2026-01-24 13:00:31', '2026-01-24 13:00:31'),
(10, 10, 729000.00, 'IQD', 'پارەدان بۆ قەرز', 729375.00, 375.00, 'subtract', '2026-01-24 13:15:41', '2026-01-24 13:15:41'),
(11, 182, 4757350.00, 'IQD', 'پارەدان بۆ قەرز', 4757350.00, 0.00, 'subtract', '2026-01-24 13:29:41', '2026-01-24 13:29:41'),
(12, 34, 2546000.00, 'IQD', 'پارەدان بۆ قەرز', 4067100.00, 1521100.00, 'subtract', '2026-01-24 15:02:34', '2026-01-24 15:02:34'),
(13, 34, 2546000.00, 'IQD', 'پارەدان بۆ قەرز', 4048250.00, 1502250.00, 'subtract', '2026-01-24 15:17:24', '2026-01-24 15:17:24'),
(14, 279, 51000.00, 'IQD', 'پارەدان بۆ قەرز', 316100.00, 265100.00, 'subtract', '2026-01-24 15:50:34', '2026-01-24 15:50:34'),
(15, 82, 125000.00, 'IQD', 'پارەدان بۆ قەرز', 125000.00, 0.00, 'subtract', '2026-01-24 16:05:38', '2026-01-24 16:05:38'),
(16, 42, 632000.00, 'IQD', 'پارەدان بۆ قەرز', 632000.00, 0.00, 'subtract', '2026-01-24 17:36:50', '2026-01-24 17:36:50'),
(17, 274, 430000.00, 'IQD', 'پارەدان بۆ قەرز', 431250.00, 1250.00, 'subtract', '2026-01-24 17:37:48', '2026-01-24 17:37:48'),
(18, 167, 1000000.00, 'IQD', 'پارەدان بۆ قەرز', 2839500.00, 1839500.00, 'subtract', '2026-01-24 17:41:09', '2026-01-24 17:41:09'),
(19, 263, 81000.00, 'IQD', 'پارەدان بۆ قەرز', 81000.00, 0.00, 'subtract', '2026-01-24 17:50:04', '2026-01-24 17:50:04'),
(20, 238, 239999.97, 'IQD', 'پارەدان بۆ قەرز', 440750.00, 200750.03, 'subtract', '2026-01-24 18:17:13', '2026-01-24 18:17:13'),
(21, 49, 1160.05, 'USD', 'پارەدان بۆ قەرز', 1160.05, 0.00, 'subtract', '2026-01-24 18:30:16', '2026-01-24 18:30:16'),
(22, 177, 945500.00, 'IQD', 'پارەدان بۆ قەرز', 945500.00, 0.00, 'subtract', '2026-01-24 18:33:14', '2026-01-24 18:33:14'),
(23, 34, 1502250.00, 'IQD', 'پارەدان بۆ قەرز', 1502250.00, 0.00, 'subtract', '2026-01-24 18:36:30', '2026-01-24 18:36:30'),
(24, 274, 1250.00, 'IQD', 'پارەدان بۆ قەرز', 1250.00, 0.00, 'subtract', '2026-01-24 18:37:02', '2026-01-24 18:37:02'),
(25, 248, 230000.00, 'IQD', 'پارەدان بۆ قەرز', 2909250.00, 2679250.00, 'subtract', '2026-01-24 18:48:32', '2026-01-24 18:48:32'),
(26, 267, 1378250.00, 'IQD', 'پارەدان بۆ قەرز', 1387250.00, 9000.00, 'subtract', '2026-01-24 19:04:55', '2026-01-24 19:04:55'),
(27, 267, 774.00, 'USD', 'پارەدان بۆ قەرز', 774.42, 0.42, 'subtract', '2026-01-24 19:05:42', '2026-01-24 19:05:42'),
(28, 246, 471500.00, 'IQD', 'پارەدان بۆ قەرز', 471500.00, 0.00, 'subtract', '2026-01-24 19:07:17', '2026-01-24 19:07:17'),
(29, 218, 903500.00, 'IQD', 'پارەدان بۆ قەرز', 903500.00, 0.00, 'subtract', '2026-01-24 20:16:57', '2026-01-24 20:16:57'),
(30, 218, 1081.00, 'USD', 'پارەدان بۆ قەرز', 1081.00, 0.00, 'subtract', '2026-01-24 20:17:31', '2026-01-24 20:17:31'),
(31, 269, 1195000.00, 'IQD', 'پارەدان بۆ قەرز', 1195000.00, 0.00, 'subtract', '2026-01-25 11:56:38', '2026-01-25 11:56:38'),
(32, 211, 335000.00, 'IQD', 'پارەدان بۆ قەرز', 335000.00, 0.00, 'subtract', '2026-01-25 13:11:38', '2026-01-25 13:11:38');

-- --------------------------------------------------------

--
-- Table structure for table `cache`
--

CREATE TABLE `cache` (
  `key` varchar(255) NOT NULL,
  `value` mediumtext NOT NULL,
  `expiration` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `cache_locks`
--

CREATE TABLE `cache_locks` (
  `key` varchar(255) NOT NULL,
  `owner` varchar(255) NOT NULL,
  `expiration` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `name`, `description`, `image`, `created_at`, `updated_at`) VALUES
(1, 'چەمەنتۆ', NULL, 'categories/CmNtsY4PWqSXgzvhGHJe2EmZdZ8hVY7KvgV2ZBLE.png', '2025-12-25 06:33:28', '2025-12-25 16:27:10'),
(2, 'شیش', NULL, 'categories/97b4LGFYTzcQVKInlEtV3qS4zlIxLgBRK7zqBVPM.png', '2025-12-25 06:35:10', '2025-12-25 16:28:12'),
(3, 'B.R.C', NULL, 'categories/6FBmMQGc7ktkL8GPZbDB7WS0g0dBEDo5wdTEtIiG.jpg', '2025-12-25 06:36:24', '2025-12-25 16:31:15'),
(4, 'بلوکی سوور', NULL, 'categories/HGFaZlmcyLfIGi9vPrOIatfKeedpu2quf3emyDku.png', '2025-12-25 06:37:52', '2025-12-25 16:31:28'),
(5, 'بلوکی ڕەش', NULL, 'categories/kgXdtjSCtNlEA6CEIZ3yyTXx7ulDlfpTBgGTPeve.jpg', '2025-12-25 16:33:16', '2025-12-25 16:33:16'),
(6, 'زاویە', NULL, 'categories/kVJQbPz7tXV45e7HwAazPl66ufTtkopJTZazGccH.png', '2025-12-25 16:36:56', '2025-12-25 16:36:56'),
(7, 'کونج', NULL, 'categories/fnXaH95S5G6WSuKxr56APoYzdGlVhTu9em8ITOYA.jpg', '2025-12-25 16:48:37', '2025-12-25 16:48:37'),
(8, 'کەرپووج', NULL, 'categories/FiGYUlPGbWEFZydLbvuhNPPDtv9baDaZPpn65Acc.jpg', '2025-12-25 16:51:05', '2025-12-25 16:51:05'),
(9, 'لم', NULL, 'categories/orUYwcQErLg27RvLWUMtjn99OlaQUkzZgxVIGw2I.jpg', '2025-12-25 16:52:06', '2025-12-25 16:52:06'),
(10, 'بەردی ئاگری', NULL, 'categories/IHNyXwTN0QJhbWPl3V6RaQhleYZng6vesFZcfLBk.jpg', '2025-12-25 16:53:30', '2025-12-25 16:53:30'),
(14, 'چەو', NULL, 'categories/4bJa9qag86bD1FnyVl75m62QF8H3IkqZsHTNungv.png', '2025-12-25 19:54:10', '2025-12-25 19:54:10'),
(15, 'کرێی', NULL, 'categories/qq80ISpc7VdlUuvDiPmmWunasCoObwKo2erOjMCv.jpg', '2025-12-25 20:05:50', '2025-12-25 20:05:50'),
(16, 'تێل', NULL, 'categories/LLTxrc7QHOuLfFpsZLcskuWSKiW6UAzq162YHdce.jpg', '2025-12-25 20:36:01', '2025-12-25 20:36:01'),
(17, 'کورسی', NULL, 'categories/NzwUynAWa7J9rMN6oa9yMWMZG1biRdbkVf16ZwxB.jpg', '2025-12-25 20:44:09', '2025-12-25 20:44:09'),
(18, 'گشتی', NULL, NULL, '2025-12-27 03:00:33', '2025-12-27 03:00:33');

-- --------------------------------------------------------

--
-- Table structure for table `company`
--

CREATE TABLE `company` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `logo` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `address` text DEFAULT NULL,
  `tax_number` varchar(255) DEFAULT NULL,
  `invoice_footer` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `company`
--

INSERT INTO `company` (`id`, `name`, `logo`, `phone`, `email`, `address`, `tax_number`, `invoice_footer`, `created_at`, `updated_at`) VALUES
(1, 'نوسینگەی ئاریان', NULL, NULL, NULL, NULL, NULL, NULL, '2025-12-25 06:32:17', '2025-12-25 06:32:17');

-- --------------------------------------------------------

--
-- Table structure for table `customers`
--

CREATE TABLE `customers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `address` text DEFAULT NULL,
  `balance_iqd` float NOT NULL DEFAULT 0,
  `balance_usd` float NOT NULL DEFAULT 0,
  `negative_balance_iqd` decimal(15,2) NOT NULL DEFAULT 0.00,
  `negative_balance_usd` decimal(15,2) NOT NULL DEFAULT 0.00,
  `notes` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `customers`
--

INSERT INTO `customers` (`id`, `name`, `phone`, `email`, `address`, `balance_iqd`, `balance_usd`, `negative_balance_iqd`, `negative_balance_usd`, `notes`, `created_at`, `updated_at`) VALUES
(3, 'بيستون عيزةت', '07740886989', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-25 17:16:55', '2026-01-24 12:39:45'),
(4, 'موهةنديس رةندي زانكو', '0750487', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-26 11:47:33', '2026-01-19 17:07:55'),
(5, 'وةستا كةريمسبيكار', '07501268371', NULL, NULL, 135250, 0, 0.00, 0.00, NULL, '2025-12-26 12:56:59', '2026-01-24 23:39:09'),
(6, 'كاك كامةران سعات جي', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-26 13:22:19', '2026-01-05 16:57:36'),
(7, 'كاك عزيز مةكينة', NULL, NULL, NULL, 9000, 0, 0.00, 0.00, NULL, '2025-12-26 13:36:46', '2026-01-24 18:32:33'),
(8, 'كةيلان ئاسايش', '07725476955', NULL, NULL, 827000, 0, 0.00, 0.00, NULL, '2025-12-26 13:41:57', '2026-01-20 15:54:59'),
(9, 'كومبانيايي دةلوو', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-26 13:47:15', '2025-12-26 13:47:15'),
(10, 'عبدولا دولار', NULL, NULL, NULL, 375, 0, 0.00, 0.00, NULL, '2025-12-26 13:51:38', '2026-01-24 13:15:41'),
(11, 'كاك محمد قوزلو ئاموزاي ريباز', '07701204196', NULL, NULL, 743500, 505, 0.00, 0.00, NULL, '2025-12-26 15:22:24', '2026-01-06 10:24:19'),
(12, 'مةريوان ئةتيكو', NULL, NULL, NULL, 147925, 0, 0.00, 0.00, NULL, '2025-12-26 15:32:50', '2026-01-21 16:01:14'),
(13, 'لوقمان ئةتيكو', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-26 15:33:08', '2025-12-26 15:33:08'),
(14, 'محسين ئةتيكو', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-26 15:33:24', '2025-12-26 15:33:24'),
(15, 'جةبار ئةتيكو', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-26 15:33:37', '2025-12-26 15:33:37'),
(16, 'شةمال ئةتيكو', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-26 15:33:49', '2025-12-26 15:33:49'),
(17, 'كاك نةوزاد ديكورات', '07501455379', NULL, NULL, 0, 0.603984, 0.00, 0.00, NULL, '2025-12-26 16:16:20', '2026-01-01 13:11:32'),
(18, 'كاك كاروخ كانةبي بانةكولان', NULL, NULL, NULL, 0, 591.438, 0.00, 0.00, NULL, '2025-12-26 16:24:41', '2026-01-15 13:30:40'),
(19, 'ماموستا محمد شةوكير', '07501567240', NULL, NULL, 274000, 1031.25, 0.00, 0.00, NULL, '2025-12-27 12:57:36', '2025-12-27 17:53:10'),
(20, 'كاك ئيسمايل وةستا ئيدريس', '07501141848', NULL, NULL, 0, 0.0000976563, 0.00, 0.00, NULL, '2025-12-27 13:11:12', '2026-01-20 17:46:40'),
(21, 'كاك ئاسو', NULL, NULL, NULL, 425, -0.00194336, 0.00, 0.00, NULL, '2025-12-27 13:21:51', '2026-01-25 15:33:26'),
(22, 'كاك كاروان جاوشين', '0777 445 46 25', NULL, NULL, 0, -0.00394043, 0.00, 0.00, NULL, '2025-12-27 14:51:38', '2026-01-22 13:45:32'),
(23, 'وةستا هاوكار', '0750 120 62 43', NULL, NULL, 0.01, 0.000012207, 0.00, 0.00, NULL, '2025-12-27 14:59:20', '2026-01-26 14:13:56'),
(24, 'كاك موهةنديس دةروون بو خوي', '07501277318', NULL, NULL, 379250, 1363.93, 0.00, 0.00, NULL, '2025-12-27 15:03:38', '2026-01-12 15:12:55'),
(25, 'كاك بوتان بورزام لاي م هاوبةش', NULL, NULL, NULL, 0, -0.000012207, 0.00, 0.00, NULL, '2025-12-27 15:12:27', '2026-01-22 14:01:54'),
(26, 'كاك شوان', '0750 371 77 71', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-27 15:22:30', '2025-12-27 15:22:30'),
(27, 'كاك سةربةست سمايل قوزلز', '0751 213 19 81', NULL, NULL, 0, -0.00399902, 0.00, 0.00, NULL, '2025-12-27 15:53:50', '2026-01-03 14:05:38'),
(28, 'كاك شيروان شةريكي كاك ئاوارة', '07515158285', NULL, NULL, 792000, 0, 0.00, 0.00, NULL, '2025-12-27 16:13:31', '2025-12-27 16:15:20'),
(29, 'كاك ئاري موهةنديس هاوتا', '07501162381', NULL, NULL, 298500, 0, 0.00, 0.00, NULL, '2025-12-27 16:21:29', '2025-12-27 16:22:26'),
(30, 'كاك هيمن', '0750 184 5050', NULL, NULL, 1521000, 0.0240479, 0.00, 0.00, NULL, '2025-12-27 16:23:27', '2026-01-01 20:29:48'),
(31, 'كاك سامان', '0750 412 53 58', NULL, NULL, 50000, 1518.6, 0.00, 0.00, NULL, '2025-12-27 16:27:05', '2025-12-27 16:34:02'),
(32, 'كاك سامي بشت كةراج', '07511401770', NULL, NULL, 4543000, 0.00000976562, 0.00, 2714.24, NULL, '2025-12-27 16:35:56', '2026-01-26 14:19:18'),
(33, 'كاك بةلين دوكاندار', NULL, NULL, NULL, 2058750, 0.000117187, 0.00, 0.00, NULL, '2025-12-27 16:46:08', '2026-01-20 12:05:53'),
(34, 'كاك سةركةوت حاجي قةلا', NULL, NULL, NULL, 0, 0.0000170898, 0.00, 0.00, NULL, '2025-12-27 16:51:20', '2026-01-24 18:36:30'),
(35, 'كاك بةختيار كومةشين', '0773 696 30 98', NULL, NULL, 0, 1530.05, 0.00, 0.00, NULL, '2025-12-27 16:55:27', '2026-01-04 14:56:42'),
(36, 'كاك سةيد بةشدار كن مالي ىكاك عمر', NULL, NULL, NULL, 9993500, 2081.8, 0.00, 0.00, NULL, '2025-12-27 17:25:04', '2026-01-07 18:29:02'),
(37, 'كاك هةلو كاك بوتان', '07501148289', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-27 17:46:34', '2026-01-06 11:10:20'),
(38, 'سةيد بةشدار 123', '07501197518', NULL, NULL, 4004850, 1925.35, 0.00, 0.00, NULL, '2025-12-27 17:59:10', '2026-01-24 13:43:07'),
(39, 'كاك يةكيتي واحيد', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-27 18:07:04', '2026-01-12 11:30:41'),
(40, 'دلير اسوةد', '0770 196 0145', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-27 18:12:29', '2026-01-25 19:35:08'),
(41, 'هةزار قورقورة', '0750114380', NULL, NULL, 801375, 0, 0.00, 0.00, NULL, '2025-12-27 18:17:56', '2025-12-27 18:20:22'),
(42, 'كاك ريباز خاليد', NULL, NULL, NULL, 0, 0.719971, 0.00, 0.00, NULL, '2025-12-28 10:19:27', '2026-01-24 17:36:50'),
(43, 'كاك ئيسمايل', '07514244770', NULL, NULL, 1384000, 1258, 0.00, 0.00, NULL, '2025-12-28 10:25:20', '2025-12-28 10:29:58'),
(44, 'كاك سةروةر كةماليات هةيبةسولتان', NULL, NULL, NULL, 3872750, 1942, 0.00, 0.00, NULL, '2025-12-28 10:35:09', '2025-12-31 16:01:07'),
(45, 'كاك بوتان خانووي زةويةرةقة', NULL, NULL, NULL, 2845500, 0.900024, 0.00, 0.00, NULL, '2025-12-28 10:41:42', '2026-01-07 13:24:03'),
(46, 'كاك بةيرةو', NULL, NULL, NULL, 0, 400, 0.00, 0.00, NULL, '2025-12-28 10:44:55', '2025-12-28 10:47:14'),
(47, 'كاك محمد نةزيف', NULL, NULL, NULL, 0, 904, 0.00, 0.00, NULL, '2025-12-28 10:48:47', '2026-01-01 18:09:10'),
(48, 'مزكةوتي رؤز', NULL, NULL, NULL, 3127000, 0.200012, 0.00, 0.00, NULL, '2025-12-28 10:51:19', '2026-01-17 15:13:01'),
(49, 'وةستا شاخةوان وايةر مةن', '07501593018', NULL, NULL, 1995000, -0.00300293, 0.00, 0.00, NULL, '2025-12-28 10:54:55', '2026-01-24 18:31:40'),
(50, 'كاك دةوةن حةداد بو كومةشين', NULL, NULL, NULL, 518500, 997.6, 0.00, 0.00, NULL, '2025-12-28 11:02:04', '2026-01-20 18:16:38'),
(51, 'كاك ئيدريس كاك سةركةوت', NULL, NULL, NULL, 2023000, 2492, 0.00, 0.00, NULL, '2025-12-28 11:18:32', '2026-01-20 18:22:15'),
(52, 'سامان تةكةور', NULL, NULL, NULL, 0, -0.005, 0.00, 0.00, NULL, '2025-12-28 11:43:23', '2026-01-20 11:42:39'),
(53, 'سةنكةر مام قولينج', NULL, NULL, NULL, 262500, 0, 0.00, 0.00, NULL, '2025-12-28 11:45:47', '2025-12-28 11:46:25'),
(54, 'وةستا هةزوان', '07503790939', NULL, NULL, 673000, 0, 0.00, 0.00, NULL, '2025-12-28 11:47:19', '2025-12-28 11:47:52'),
(55, 'قةلاي هةرموتة', '07728472544', NULL, NULL, 3389500, 0, 0.00, 0.00, NULL, '2025-12-28 11:48:57', '2026-01-20 18:28:48'),
(56, 'ماموستا سةركةوت', '07701399743', NULL, NULL, 3335500, 0, 0.00, 0.00, NULL, '2025-12-28 11:50:55', '2026-01-06 19:56:47'),
(57, 'سامان برا وةستا شوان', '07501138236', NULL, NULL, 3905250, -0.0000878906, 0.00, 0.00, NULL, '2025-12-28 12:02:41', '2026-01-19 16:50:48'),
(58, 'كاك عبدي', NULL, NULL, NULL, 1026000, 0, 0.00, 0.00, NULL, '2025-12-28 12:09:49', '2025-12-28 12:10:32'),
(59, 'ئةزين حةكيم', NULL, NULL, NULL, 183000, 0, 0.00, 0.00, NULL, '2025-12-28 12:12:28', '2025-12-28 12:13:07'),
(60, 'كاك محمد ديموكرات', '07501313271', NULL, NULL, 313000, 0, 0.00, 0.00, NULL, '2025-12-28 12:13:56', '2025-12-28 12:14:43'),
(61, 'وةستا لادي جامجي', NULL, NULL, NULL, 1114000, 0, 0.00, 0.00, NULL, '2025-12-28 12:15:14', '2025-12-28 12:16:27'),
(62, 'ئةرسةلان ديكةلة', NULL, NULL, NULL, 1089000, 0, 0.00, 0.00, NULL, '2025-12-28 12:30:28', '2025-12-28 12:31:30'),
(63, 'بكر رةزا', NULL, NULL, NULL, 226000, 0, 0.00, 0.00, NULL, '2025-12-28 12:32:25', '2025-12-28 12:33:35'),
(64, 'وةستا هاوكار سبيكار', '07501206243', NULL, NULL, 640000, 635.5, 0.00, 0.00, NULL, '2025-12-28 12:36:18', '2026-01-26 14:07:30'),
(65, 'كاك ريشوان', '07511750026', NULL, NULL, 180500, 0, 0.00, 0.00, NULL, '2025-12-28 12:37:30', '2026-01-21 17:59:43'),
(66, 'زينو هةرموتة', NULL, NULL, NULL, 1174500, 0, 0.00, 0.00, NULL, '2025-12-28 12:38:58', '2025-12-28 12:39:37'),
(67, 'كاك شالاو', '077044+66428', NULL, NULL, 1423000, 0, 0.00, 0.00, NULL, '2025-12-28 12:40:17', '2025-12-28 16:21:07'),
(68, 'وةستا تةنيا', NULL, NULL, NULL, 108750, 0, 0.00, 0.00, NULL, '2025-12-28 12:41:38', '2025-12-28 12:42:10'),
(69, 'كاروخ كانةبي', '07501250707', NULL, NULL, 178175, 0, 0.00, 0.00, NULL, '2025-12-28 12:45:39', '2026-01-08 12:21:03'),
(70, 'بةناز خان كردي عةرةبيان', '07501567964', NULL, NULL, 212500, 0, 0.00, 0.00, NULL, '2025-12-28 12:47:34', '2026-01-04 17:33:54'),
(71, 'كاك زانا', '07501571038', NULL, NULL, 318750, 0, 0.00, 0.00, NULL, '2025-12-28 12:48:52', '2025-12-28 12:49:28'),
(72, 'سامان هةرموتة', NULL, NULL, NULL, 137000, 0, 0.00, 0.00, NULL, '2025-12-28 12:50:22', '2025-12-28 12:51:12'),
(73, 'كاك جةماوةر', NULL, NULL, NULL, 50000, 0, 0.00, 0.00, NULL, '2025-12-28 12:51:48', '2025-12-28 12:52:11'),
(74, 'نةبةز ئاوةدان كردنةوة', '07501140912', NULL, NULL, 234000, 0, 0.00, 0.00, NULL, '2025-12-28 12:52:59', '2025-12-28 12:54:01'),
(75, 'حاجي رةحمان', '07508598208', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-28 12:54:41', '2026-01-04 15:03:36'),
(76, 'دةشتي كاني دةربةند', '07507120004', NULL, NULL, 336500, 0, 0.00, 0.00, NULL, '2025-12-28 12:55:57', '2025-12-28 12:56:29'),
(77, 'وةستا هيرش قورقورة', '07725121515', NULL, NULL, 148750, 0, 0.00, 0.00, NULL, '2025-12-28 12:58:14', '2025-12-28 12:58:58'),
(78, 'شةريف حةداد', '07508364944', NULL, NULL, 94000, 0, 0.00, 0.00, NULL, '2025-12-28 13:01:58', '2025-12-28 13:02:31'),
(79, 'ئةسكةندةر مةلا يوسف', '07506141567', NULL, NULL, 230250, 0, 0.00, 0.00, NULL, '2025-12-28 13:03:10', '2025-12-28 13:03:50'),
(80, 'وةستا عمر حةداد', '07503717771', NULL, NULL, 625000, 0, 0.00, 0.00, NULL, '2025-12-28 13:04:39', '2025-12-28 13:05:19'),
(81, 'دلوفان', '07501220870', NULL, NULL, 101000, 0, 0.00, 0.00, NULL, '2025-12-28 13:06:34', '2025-12-28 13:07:14'),
(82, 'جمال ئيسمايل سوري', '07501868397', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-28 13:08:05', '2026-01-24 16:05:38'),
(83, 'ماموستا ئةردةلان جناروك كاك سديق دةيناسي', NULL, NULL, NULL, 56000, 0, 0.00, 0.00, NULL, '2025-12-28 13:09:22', '2025-12-28 13:09:45'),
(84, 'دانا شوفةر', '07501825198', NULL, NULL, 366750, 0, 0.00, 0.00, NULL, '2025-12-28 13:10:21', '2025-12-28 13:10:50'),
(85, 'ئازاد سماقولي', '07501132563', NULL, NULL, 650000, 0, 0.00, 0.00, NULL, '2025-12-28 13:11:40', '2025-12-28 13:12:48'),
(86, 'بةيار', '07518269572', NULL, NULL, 173500, 0, 0.00, 0.00, NULL, '2025-12-28 13:13:32', '2025-12-28 13:14:11'),
(87, 'كاك زانا موهةنديس رةندي', '07504930887', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-28 13:15:22', '2026-01-19 17:10:26'),
(88, 'كاك وشيار ديموكرات', '07501483584', NULL, NULL, 75000, 0, 0.00, 0.00, NULL, '2025-12-28 13:21:12', '2025-12-28 13:21:45'),
(89, 'كاك سامي كردي عةرةبيان', '07511407017', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-28 13:27:11', '2026-01-01 18:05:03'),
(90, 'وةستا كةريم سبيكار', '07501268371', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-28 13:28:47', '2025-12-28 13:28:47'),
(91, 'نةجار ريبين', '07507138069', NULL, NULL, 30250, 0, 0.00, 0.00, NULL, '2025-12-28 13:29:42', '2025-12-28 13:30:09'),
(92, 'كاك مكايل كفرةدولي', '07501092577', NULL, NULL, 157000, 0, 0.00, 0.00, NULL, '2025-12-28 13:30:55', '2025-12-28 13:31:23'),
(93, 'وةستا بكر كاولان', '07501552304', NULL, NULL, 410000, 0, 0.00, 0.00, NULL, '2025-12-28 13:31:55', '2025-12-28 13:32:26'),
(94, 'بةيمان خان ديموكرات', '0750148', NULL, NULL, 454000, 0, 0.00, 0.00, NULL, '2025-12-28 13:33:11', '2025-12-28 13:33:40'),
(95, 'كاك هوشةنك و وةستا شةريف', '07508364944', NULL, NULL, 369000, 0, 0.00, 0.00, NULL, '2025-12-28 13:34:34', '2025-12-28 13:35:14'),
(96, 'حاجي فاروق', '07501232918', NULL, NULL, 4, 0, 0.00, 0.00, NULL, '2025-12-28 13:36:26', '2025-12-31 16:03:11'),
(97, 'كاك سةركةوت جيراني بابم', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-28 13:38:43', '2026-01-20 18:22:50'),
(98, 'كاك جواس', '07501136064', NULL, NULL, 135500, 0, 0.00, 0.00, NULL, '2025-12-28 13:40:12', '2025-12-28 13:40:46'),
(99, 'كاك كارمةند حاجي باشا', '07501556127', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-28 13:41:55', '2026-01-19 17:10:05'),
(100, 'وةستا فةراموش', NULL, NULL, NULL, 456500, 0, 0.00, 0.00, NULL, '2025-12-28 13:42:55', '2025-12-28 13:43:39'),
(101, 'بةختيار مسةوةر', '07501143694', NULL, NULL, 3626500, 0, 0.00, 0.00, NULL, '2025-12-28 13:44:28', '2026-01-13 12:27:50'),
(102, 'ئارام قةلاب', NULL, NULL, NULL, 340000, 0, 0.00, 0.00, NULL, '2025-12-28 13:46:01', '2025-12-28 13:46:29'),
(103, 'هيدي خاليد', NULL, NULL, NULL, 328250, 0, 0.00, 0.00, NULL, '2025-12-28 13:47:23', '2025-12-28 13:48:01'),
(104, 'دكتور سةيدمحمد كول', '07501558890', NULL, NULL, 89500, 0, 0.00, 0.00, NULL, '2025-12-28 13:48:48', '2025-12-28 13:49:19'),
(105, 'كاك محمد نوسينكة', '07501128486', NULL, NULL, 561500, 0, 0.00, 0.00, NULL, '2025-12-28 13:49:58', '2025-12-28 13:50:38'),
(106, 'كاك يونس', '07501675252', NULL, NULL, 4629750, 0, 0.00, 0.00, NULL, '2025-12-28 13:51:12', '2025-12-28 13:51:49'),
(107, 'وةوستا سةردار بةرسجي', NULL, NULL, NULL, 339500, 0, 0.00, 0.00, NULL, '2025-12-28 13:52:19', '2025-12-28 13:53:03'),
(108, 'وةستا تةنيا كن بةنزينخانةي نيعمةت', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-28 16:22:06', '2026-01-20 11:33:07'),
(109, 'كاك سةروةر', '07501135161', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-28 16:23:02', '2025-12-31 16:00:18'),
(110, 'مزكةوتي سةيد وةلي', '07501385080', NULL, NULL, 356500, 0, 0.00, 0.00, NULL, '2025-12-28 16:24:09', '2026-01-22 12:06:51'),
(111, 'كاك شيخ كةريم ناحيةي ئاشتي', NULL, NULL, NULL, 55000, 0, 0.00, 0.00, NULL, '2025-12-28 16:25:07', '2025-12-28 16:25:38'),
(112, 'مزكةوتي ئازادي', NULL, NULL, NULL, 2804250, 0, 0.00, 0.00, NULL, '2025-12-28 16:58:10', '2026-01-08 16:42:06'),
(113, 'حاجي هيرش', '07517419271', NULL, NULL, 240000, 0, 0.00, 0.00, NULL, '2025-12-28 16:59:34', '2025-12-28 17:00:17'),
(114, 'كاك سامي مةسيحي', NULL, NULL, NULL, 140000, 0, 0.00, 0.00, NULL, '2025-12-28 17:00:53', '2025-12-28 17:01:24'),
(115, 'كاك سةروةر ئيلنجاخ', '07503150444', NULL, NULL, 202500, 0, 0.00, 0.00, NULL, '2025-12-28 17:02:14', '2025-12-28 17:07:40'),
(116, 'حسابي خويان', NULL, NULL, NULL, 5908000, 0, 0.00, 0.00, NULL, '2025-12-28 17:08:20', '2025-12-28 17:08:48'),
(117, 'كاك هيمن غةسلي داربةسةر', NULL, NULL, NULL, 234500, 0, 0.00, 0.00, NULL, '2025-12-28 17:09:16', '2025-12-28 17:09:48'),
(118, 'كاك محمد محامي', '07501517777', NULL, NULL, 23500, 0, 0.00, 0.00, NULL, '2025-12-28 17:10:27', '2025-12-28 17:10:59'),
(119, 'كاك هاوار عمر', '07501551534', NULL, NULL, 1115750, 0, 0.00, 0.00, NULL, '2025-12-28 17:11:36', '2025-12-28 17:12:09'),
(120, 'دلير ئةتيكو', '07501171912', NULL, NULL, 125500, 0, 0.00, 0.00, NULL, '2025-12-28 17:13:06', '2025-12-28 17:13:50'),
(121, 'كومبانياي دةلو', '07501581304', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-28 17:14:31', '2026-01-20 16:44:16'),
(122, 'كاك هةردي', '07503600962', NULL, NULL, 827000, 0, 0.00, 0.00, NULL, '2025-12-28 17:16:37', '2026-01-01 13:06:13'),
(123, 'كةيلان شاخةبيسكة', '07507435024', NULL, NULL, 605425, 0, 0.00, 0.00, NULL, '2025-12-28 17:19:04', '2026-01-07 14:37:19'),
(124, 'كاك اكرةم دةرون', NULL, NULL, NULL, 895000, 0, 0.00, 0.00, NULL, '2025-12-28 17:20:09', '2025-12-28 17:20:43'),
(125, 'سادق موهةنديس دةرون', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-28 17:21:19', '2026-01-20 13:13:11'),
(126, 'كاك سةرباز قةرةناو', '07501029734', NULL, NULL, 200000, 0, 0.00, 0.00, NULL, '2025-12-28 17:22:52', '2025-12-28 17:23:19'),
(127, 'مزكةوتي بوكد', NULL, NULL, NULL, 360000, 0, 0.00, 0.00, NULL, '2025-12-28 17:23:51', '2025-12-28 17:24:20'),
(128, 'كاك زانا كومةشين', NULL, NULL, NULL, 318750, 0, 0.00, 0.00, NULL, '2025-12-28 17:24:45', '2026-01-01 20:21:07'),
(129, 'يوسف كورة خالي مام سالح', '07501232891', NULL, NULL, 301250, 0, 0.00, 0.00, NULL, '2025-12-28 17:26:04', '2025-12-28 17:26:59'),
(130, 'شيروان', '07511865961', NULL, NULL, 40000, 0, 0.00, 0.00, NULL, '2025-12-28 17:27:55', '2025-12-28 17:28:21'),
(131, 'يوسف ئيدريس', NULL, NULL, NULL, 255000, 0, 0.00, 0.00, NULL, '2025-12-28 17:28:44', '2025-12-28 17:29:18'),
(132, 'كاك خةسرةو', '07508590305', NULL, NULL, 10000, 0, 0.00, 0.00, NULL, '2025-12-28 17:34:08', '2025-12-28 17:34:37'),
(133, 'رةوةند', '0750 154 49 97', NULL, NULL, 134000, 0, 0.00, 0.00, NULL, '2025-12-28 17:36:31', '2025-12-28 17:37:04'),
(134, 'وةستا سةنكةر', NULL, NULL, NULL, 35000, 0, 0.00, 0.00, NULL, '2025-12-28 17:37:36', '2025-12-28 17:38:14'),
(135, 'كوسرةت ئيلنجاغ', '07701139685', NULL, NULL, 2235250, 0, 0.00, 0.00, NULL, '2025-12-28 17:40:10', '2025-12-28 17:40:33'),
(136, 'كاك حاجي وةهاب بيبازوك', NULL, NULL, NULL, 390500, 0, 0.00, 0.00, NULL, '2025-12-28 17:41:19', '2025-12-28 17:41:43'),
(137, 'ئيلنجاخ', '07704014300', NULL, NULL, 267500, 0, 0.00, 0.00, NULL, '2025-12-28 17:42:35', '2025-12-28 17:43:00'),
(138, 'بةختيار كوران', '07501127619', NULL, NULL, 750, 0, 0.00, 0.00, NULL, '2025-12-28 17:43:41', '2026-01-03 10:52:09'),
(139, 'هيرش علي', '07501182585', NULL, NULL, 192000, 0, 0.00, 0.00, NULL, '2025-12-28 17:51:00', '2025-12-28 17:51:36'),
(140, 'هةنكاوي وةستا معروف', '07501134685', NULL, NULL, 1325250, 0, 0.00, 0.00, NULL, '2025-12-28 17:52:21', '2026-01-20 11:44:16'),
(141, 'ماموستا محمد', '07503018666', NULL, NULL, 1679250, 0, 0.00, 0.00, NULL, '2025-12-28 18:00:33', '2026-01-12 11:31:47'),
(142, 'مسعود جيران', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-28 18:13:23', '2025-12-28 18:13:23'),
(143, 'موهةنديس هاوتا', NULL, NULL, NULL, 4135750, 0, 0.00, 0.00, NULL, '2025-12-29 12:06:26', '2025-12-29 12:08:23'),
(144, 'كاك ئاري', NULL, NULL, NULL, 40000, 0, 0.00, 0.00, NULL, '2025-12-29 12:08:49', '2025-12-29 12:09:09'),
(145, 'هاومةند قةلاب', NULL, NULL, NULL, 689500, 0, 0.00, 0.00, NULL, '2025-12-29 12:09:43', '2025-12-29 12:10:05'),
(146, 'ماموستا حةمةدةمين', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 12:10:45', '2026-01-07 17:33:03'),
(147, 'ئارام خوارزاي تالةباني', '07515095965', NULL, NULL, 3173250, 0, 0.00, 0.00, NULL, '2025-12-29 12:14:26', '2025-12-29 12:14:48'),
(148, 'دةربةند ديكةلة', '07503403232', NULL, NULL, 168500, 0, 0.00, 0.00, NULL, '2025-12-29 12:15:23', '2025-12-29 15:51:17'),
(149, 'واحيد', '07507168812', NULL, NULL, 186500, 0, 0.00, 0.00, NULL, '2025-12-29 12:16:12', '2025-12-29 12:16:38'),
(150, 'وةستا كاوة', '07504444115', NULL, NULL, 503500, 0, 0.00, 0.00, NULL, '2025-12-29 12:17:14', '2025-12-29 12:17:36'),
(151, 'زابر خرابة', '07502264465', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 12:18:01', '2026-01-21 15:54:42'),
(152, 'بةريوبةرايةتي جاكردني ريكاو باني كوية', NULL, NULL, NULL, 991000, 0, 0.00, 0.00, NULL, '2025-12-29 12:19:00', '2026-01-25 15:02:13'),
(153, 'وةستا دارو', '07508166159', NULL, NULL, 701750, 0, 0.00, 0.00, NULL, '2025-12-29 12:19:48', '2025-12-29 12:20:22'),
(154, 'كاك عمر كاني رةش', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 12:20:57', '2026-01-02 12:35:19'),
(155, 'سةربةست مرور', '07736945717', NULL, NULL, 190000, 0, 0.00, 0.00, NULL, '2025-12-29 12:22:04', '2025-12-29 12:22:53'),
(156, 'دكتور هيوا براي ئازاد', '0750', NULL, NULL, 352000, 0, 0.00, 0.00, NULL, '2025-12-29 12:23:34', '2025-12-29 12:23:52'),
(157, 'كاك فةهمي', NULL, NULL, NULL, 115000, 0, 0.00, 0.00, NULL, '2025-12-29 12:24:15', '2026-01-26 13:45:19'),
(158, 'وةستا مةجيد', '07501127671', NULL, NULL, 10000, 0, 0.00, 0.00, NULL, '2025-12-29 12:25:09', '2025-12-29 12:25:24'),
(159, 'كاك سةركةوت توبزاوة', '07508152824', NULL, NULL, 1075500, 0, 0.00, 0.00, NULL, '2025-12-29 12:26:01', '2025-12-29 12:27:43'),
(160, 'بالا ليوا', '07505485977', NULL, NULL, 199750, 0, 0.00, 0.00, NULL, '2025-12-29 12:29:07', '2025-12-29 12:29:29'),
(161, 'شازاد شيلة', '07501143810', NULL, NULL, 340000, 0, 0.00, 0.00, NULL, '2025-12-29 12:30:10', '2025-12-29 12:31:56'),
(162, 'ماموستا مزةفةر', '07501129401', NULL, NULL, 418750, 0, 0.00, 0.00, NULL, '2025-12-29 12:32:40', '2025-12-29 12:33:08'),
(163, 'وةستا محمد حةلاق', NULL, NULL, NULL, 598500, 0, 0.00, 0.00, NULL, '2025-12-29 12:33:38', '2025-12-29 12:34:03'),
(164, 'ئوميد كةلابة', NULL, NULL, NULL, 1350000, 0, 0.00, 0.00, NULL, '2025-12-29 12:34:20', '2025-12-29 12:34:42'),
(165, 'بازكةي قةلا', '07701572451', NULL, NULL, 1035000, 0, 0.00, 0.00, NULL, '2025-12-29 12:35:29', '2025-12-29 12:35:59'),
(166, 'فرمان شيواشوك', NULL, NULL, NULL, 355000, 0, 0.00, 0.00, NULL, '2025-12-29 12:36:59', '2026-01-01 18:10:01'),
(167, 'ريبازقولو', '07509355712', NULL, NULL, 1839500, 1546.16, 0.00, 0.00, NULL, '2025-12-29 12:38:13', '2026-01-24 17:41:09'),
(168, 'كاك دلشاد', NULL, NULL, NULL, 149100, 0, 0.00, 0.00, NULL, '2025-12-29 12:39:18', '2025-12-29 12:39:36'),
(169, 'كاك جةتو ئيلنجاخ بةنزينجانة', '07501590688', NULL, NULL, 103000, 0, 0.00, 0.00, NULL, '2025-12-29 12:40:16', '2025-12-29 12:40:34'),
(170, 'كاك سةردار حةمةد', '07501116251', NULL, NULL, 66750, 0, 0.00, 0.00, NULL, '2025-12-29 12:41:02', '2025-12-29 12:41:52'),
(171, 'عبدولا ئيلنجاغ', NULL, NULL, NULL, 66750, 0, 0.00, 0.00, NULL, '2025-12-29 12:44:22', '2025-12-29 12:44:40'),
(172, 'كاك حاجي محمد', '07501128208', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 12:45:55', '2026-01-12 11:48:23'),
(173, 'كاك بةرهةم', '07501091342', NULL, NULL, 187500, 0, 0.00, 0.00, NULL, '2025-12-29 12:46:56', '2025-12-29 12:47:19'),
(174, 'كاك مةسعود', '07501128024', NULL, NULL, 110000, 0, 0.00, 0.00, NULL, '2025-12-29 12:47:44', '2025-12-29 12:48:01'),
(175, 'سامي تالةبان', NULL, NULL, NULL, 123000, 0, 0.00, 0.00, NULL, '2025-12-29 12:48:15', '2025-12-29 12:48:40'),
(176, 'كاك مراز', '07501194225', NULL, NULL, 35000, 0, 0.00, 0.00, NULL, '2025-12-29 12:49:13', '2025-12-29 12:49:27'),
(177, 'بكر كونكورك', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 12:49:49', '2026-01-24 18:33:14'),
(178, 'هونةر مةسيفي', '07508448986', NULL, NULL, 251500, 0, 0.00, 0.00, NULL, '2025-12-29 12:51:00', '2025-12-29 12:51:37'),
(179, 'كاك ئازاد جاوشين', '07510015763', NULL, NULL, 1636000, 0, 0.00, 0.00, NULL, '2025-12-29 12:52:33', '2026-01-20 17:55:05'),
(180, 'ماموستا عبدوللة', '07501274454', NULL, NULL, 78750, 0, 0.00, 0.00, NULL, '2025-12-29 12:53:58', '2025-12-29 12:54:17'),
(181, 'كاك هةفال', '07518860855', NULL, NULL, 168750, 0, 0.00, 0.00, NULL, '2025-12-29 12:54:54', '2025-12-29 12:55:13'),
(182, 'هاوبةش بةرامبةر معمل بلوك', '07511158218', NULL, NULL, 188350, 1206.99, 0.00, 0.00, NULL, '2025-12-29 13:00:30', '2026-01-26 14:16:44'),
(183, 'كاك مةجيد كوبتةبة', '07504914027', NULL, NULL, 68500, 0, 0.00, 0.00, NULL, '2025-12-29 13:01:29', '2025-12-29 13:01:52'),
(184, 'فةرهاد كونةكورك', NULL, NULL, NULL, 460000, 0, 0.00, 0.00, NULL, '2025-12-29 13:02:18', '2025-12-29 13:02:43'),
(185, 'وةعد هةرمونة', NULL, NULL, NULL, 206000, 0, 0.00, 0.00, NULL, '2025-12-29 13:03:19', '2025-12-29 13:03:40'),
(186, 'كاك بةشدار برازاي مام سالح', '075', NULL, NULL, 572500, 0, 0.00, 0.00, NULL, '2025-12-29 13:04:20', '2026-01-21 18:26:35'),
(187, 'جةنكي براي ملازم هيمن', '07736963359', NULL, NULL, 848750, 0, 0.00, 0.00, NULL, '2025-12-29 13:06:27', '2026-01-07 19:18:51'),
(188, 'كاك اكرةم', '07501277318', NULL, NULL, 791500, 0, 0.00, 0.00, NULL, '2025-12-29 13:07:16', '2025-12-29 13:07:33'),
(189, 'هةندرين سوران', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 13:07:51', '2026-01-07 12:16:44'),
(190, 'محمد سايةق غةباتة', '07504958594', NULL, NULL, 165000, 0, 0.00, 0.00, NULL, '2025-12-29 13:08:40', '2025-12-29 13:08:58'),
(191, 'وةستا نزار', NULL, NULL, NULL, 448000, 0, 0.00, 0.00, NULL, '2025-12-29 13:09:16', '2025-12-29 13:09:39'),
(192, 'هةريم مام ياسين', NULL, NULL, NULL, 46500, 0, 0.00, 0.00, NULL, '2025-12-29 13:10:53', '2025-12-29 13:11:19'),
(193, 'شوان مام بكر شيواشوك', '07507714175', NULL, NULL, 756250, 0, 0.00, 0.00, NULL, '2025-12-29 13:12:51', '2026-01-20 17:58:04'),
(194, 'ماموستا بتروز', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 13:13:44', '2026-01-20 18:01:48'),
(195, 'ريباز شةفيق', '077046784545', NULL, NULL, 683500, 0, 0.00, 0.00, NULL, '2025-12-29 13:14:31', '2026-01-03 13:49:26'),
(196, 'ئةيوب ناسراغة', NULL, NULL, NULL, 361500, 0, 0.00, 0.00, NULL, '2025-12-29 13:16:03', '2025-12-29 13:16:26'),
(197, 'ئيدريس ئيلنجاغ', '07503090257', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 13:17:07', '2026-01-01 10:33:07'),
(198, 'كةمال خةيات', '07501188985', NULL, NULL, 455500, 0, 0.00, 0.00, NULL, '2025-12-29 13:18:06', '2026-01-07 16:28:18'),
(199, 'موهةنديس كاروان خاليدين', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 13:19:14', '2026-01-04 15:03:09'),
(200, 'كاك مةريوان كوبتةبة', '07501155497', NULL, NULL, 0, 677.3, 0.00, 0.00, NULL, '2025-12-29 13:20:20', '2026-01-06 14:10:22'),
(201, 'كوران مةرزان', '07503033917', NULL, NULL, 416250, 0, 0.00, 0.00, NULL, '2025-12-29 13:21:12', '2025-12-29 13:21:34'),
(202, 'دةرباز توبزاوة', NULL, NULL, NULL, 616000, 0, 0.00, 0.00, NULL, '2025-12-29 13:21:49', '2025-12-29 13:22:09'),
(203, 'شاكر ئيلنجاغ', '07508473730', NULL, NULL, 750, 0, 0.00, 0.00, NULL, '2025-12-29 13:22:40', '2026-01-01 12:43:08'),
(204, 'بريار محامي', NULL, NULL, NULL, 68000, 0, 0.00, 0.00, NULL, '2025-12-29 13:23:39', '2025-12-29 13:23:55'),
(205, 'هةلكةوت نانةوا', NULL, NULL, NULL, 342000, 0, 0.00, 0.00, NULL, '2025-12-29 13:24:43', '2025-12-29 13:25:00'),
(206, 'مام كةريم', NULL, NULL, NULL, 63000, 0, 0.00, 0.00, NULL, '2025-12-29 13:25:56', '2025-12-29 13:26:16'),
(207, 'كازمي وةستا عمر', NULL, NULL, NULL, 550750, 0, 0.00, 0.00, NULL, '2025-12-29 13:26:43', '2025-12-29 13:27:10'),
(208, 'بريار قوزلو', '07501010112', NULL, NULL, 146000, 0, 0.00, 0.00, NULL, '2025-12-29 13:27:53', '2025-12-29 13:28:52'),
(209, 'جابوك', '07501197810', NULL, NULL, 116250, 0, 0.00, 0.00, NULL, '2025-12-29 13:29:33', '2025-12-29 13:29:56'),
(210, 'محمد موهةنديس دةروون', '07501277318', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 13:30:34', '2026-01-20 16:02:40'),
(211, 'كاك سامان 2', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 13:31:48', '2026-01-25 13:11:38'),
(212, 'هيمن حةويز', '07501845050', NULL, NULL, 1931750, 0, 0.00, 0.00, NULL, '2025-12-29 13:34:18', '2026-01-26 14:21:12'),
(213, 'كاك سةركةوت هةيبةسولتان', '07704605051', NULL, NULL, 465250, 0, 0.00, 0.00, NULL, '2025-12-29 13:35:44', '2025-12-29 13:36:12'),
(214, 'وةستا فرياد', '07507966874', NULL, NULL, 150000, 0, 0.00, 0.00, NULL, '2025-12-29 13:36:45', '2025-12-29 13:37:00'),
(215, 'مارةباب', NULL, NULL, NULL, 417000, 0, 0.00, 0.00, NULL, '2025-12-29 13:37:20', '2025-12-29 13:37:47'),
(216, 'كاك روستةم', '07501188868', NULL, NULL, 350000, 0, 0.00, 0.00, NULL, '2025-12-29 13:38:26', '2026-01-03 15:53:20'),
(217, 'مزكةوتي جةلالاوة', '07518673707', NULL, NULL, 495750, 0, 0.00, 0.00, NULL, '2025-12-29 13:39:36', '2026-01-19 11:38:57'),
(218, 'كاك كوسرةت و كاروان', '07507128366', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 13:40:21', '2026-01-24 20:17:31'),
(219, 'بةلين مةجيد', '07511815732', NULL, NULL, 565000, 0, 0.00, 0.00, NULL, '2025-12-29 13:41:18', '2025-12-29 13:41:33'),
(220, 'ديكةل', '07504935851', NULL, NULL, 75500, 0, 0.00, 0.00, NULL, '2025-12-29 13:42:08', '2025-12-29 13:42:22'),
(221, 'كاك عةميد لةشكر', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 13:42:43', '2026-01-25 16:21:32'),
(222, 'سةركةوت موهةنديس دةروون', '07501277318', NULL, NULL, 60500, 0, 0.00, 0.00, NULL, '2025-12-29 13:43:38', '2025-12-29 13:44:08'),
(223, 'سةيد جيا', NULL, NULL, NULL, 567500, 0, 0.00, 0.00, NULL, '2025-12-29 13:44:22', '2025-12-29 13:44:37'),
(224, 'كاك ئاكام نياز تالةبان', '07500346903', NULL, NULL, 1000000, 0, 0.00, 0.00, NULL, '2025-12-29 13:46:07', '2025-12-29 13:46:38'),
(225, 'هةزار', '07501140404', NULL, NULL, 704500, 0, 0.00, 0.00, NULL, '2025-12-29 13:47:11', '2025-12-29 13:47:52'),
(226, 'فةراموش ئيلنجاغ', '07504999953', NULL, NULL, 500500, 0, 0.00, 0.00, NULL, '2025-12-29 13:48:38', '2026-01-20 11:45:45'),
(227, 'محمدي مام ياسين', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 13:51:16', '2026-01-20 11:27:50'),
(228, 'دياري مةشتةل', '07501929996', NULL, NULL, 481000, 0, 0.00, 0.00, NULL, '2025-12-29 13:52:22', '2025-12-29 13:52:44'),
(229, 'مزكةوتي هةرموتة', NULL, NULL, NULL, 250000, 0, 0.00, 0.00, NULL, '2025-12-29 13:53:06', '2025-12-29 13:53:24'),
(230, 'هةستيار', '07500141515', NULL, NULL, 180000, 0, 0.00, 0.00, NULL, '2025-12-29 13:54:00', '2025-12-29 13:54:21'),
(231, 'وةستا مةولان', '07509372962', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 13:54:58', '2026-01-22 17:03:21'),
(232, 'كاك هوشمةند', '07501729461', NULL, NULL, 346750, 0, 0.00, 0.00, NULL, '2025-12-29 13:58:14', '2026-01-20 19:02:04'),
(233, 'كاك عةزيز', '07501593463', NULL, NULL, 728000, 0, 0.00, 0.00, NULL, '2025-12-29 13:59:14', '2026-01-18 10:29:36'),
(234, 'ليواي 11', '07504608338', NULL, NULL, 986750, 0, 0.00, 0.00, NULL, '2025-12-29 14:01:15', '2026-01-26 13:46:56'),
(235, 'ليواي 40', NULL, NULL, NULL, 400000, 0, 0.00, 0.00, NULL, '2025-12-29 14:02:31', '2026-01-08 12:28:37'),
(236, 'كاك ئاسو بةنزين خانة', '07501128012', NULL, NULL, 0, 0, 9494150.00, 0.00, NULL, '2025-12-29 15:18:42', '2026-01-26 14:17:41'),
(237, 'وةستا دةروةن حةداد', '07512282629', NULL, NULL, 390000, 0, 0.00, 0.00, NULL, '2025-12-29 15:23:26', '2025-12-29 15:25:43'),
(238, 'هةردي مام قولينج', NULL, NULL, NULL, 200750, 0, 0.00, 0.00, NULL, '2025-12-29 15:26:11', '2026-01-24 18:17:13'),
(239, 'كاك هاوكار شيواشوك', '07511234482', NULL, NULL, 197500, 0, 0.00, 0.00, NULL, '2025-12-29 15:27:35', '2026-01-01 18:02:03'),
(240, 'كامةران شورتة', NULL, NULL, NULL, 160000, 0, 0.00, 0.00, NULL, '2025-12-29 15:30:47', '2025-12-29 15:31:02'),
(241, 'رةفيق دموكرات', NULL, NULL, NULL, 63000, 0, 0.00, 0.00, NULL, '2025-12-29 15:31:24', '2025-12-29 15:31:42'),
(242, 'ماموستا هيمن بوكد', NULL, NULL, NULL, 2171500, 0, 0.00, 0.00, NULL, '2025-12-29 15:32:03', '2025-12-29 15:32:24'),
(243, 'كاك هيداد', '07505519095', NULL, NULL, 500, 0, 0.00, 0.00, NULL, '2025-12-29 15:36:35', '2026-01-13 14:24:07'),
(244, 'كاك محمد قوزلو', '07701204196', NULL, NULL, 318750, 0, 0.00, 0.00, NULL, '2025-12-29 15:37:19', '2025-12-29 15:37:36'),
(245, 'كاك عبدولا دولار', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 15:38:00', '2025-12-29 15:38:00'),
(246, 'عاديل', '07502185081', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 15:39:12', '2026-01-24 19:07:17'),
(247, 'بةختيار ئاسايش', '07502114783', NULL, NULL, 98503, 0, 0.00, 0.00, NULL, '2025-12-29 15:44:44', '2025-12-29 15:45:53'),
(248, 'بةختيار شيخ سةلام', '07507234823', NULL, NULL, 2731750, 0, 0.00, 0.00, NULL, '2025-12-29 15:46:34', '2026-01-26 13:46:08'),
(249, 'هيمداد جريانمي وةستا عمر', NULL, NULL, NULL, 936500, 0, 0.00, 0.00, NULL, '2025-12-29 15:47:21', '2025-12-29 15:47:51'),
(250, 'دةرباز ديكةلة', '07503281078', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 15:48:16', '2026-01-05 16:58:29'),
(251, 'موهةنديس ئةمين', NULL, NULL, NULL, 1214250, 0, 0.00, 0.00, NULL, '2025-12-29 15:49:03', '2026-01-08 18:14:10'),
(252, 'حاجي قةبان', '07518849140', NULL, NULL, 815000, 0, 0.00, 0.00, NULL, '2025-12-29 15:52:27', '2025-12-29 15:53:22'),
(253, 'سيروان مام قولينج', '07501169081', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 15:53:49', '2026-01-22 12:23:03'),
(254, 'كاك كاروان', NULL, NULL, NULL, 187000, 0, 0.00, 0.00, NULL, '2025-12-29 15:54:49', '2025-12-29 15:55:08'),
(255, 'رياز ديكةلة', NULL, NULL, NULL, 212500, 0, 0.00, 0.00, NULL, '2025-12-29 15:55:27', '2025-12-29 15:55:44'),
(256, 'بيستون ئيلنجاغ', NULL, NULL, NULL, 2109000, 0, 0.00, 0.00, NULL, '2025-12-29 15:56:00', '2025-12-29 15:56:17'),
(257, 'كاك دةرباز', '07704304190', NULL, NULL, 487250, 0, 0.00, 0.00, NULL, '2025-12-29 15:56:37', '2026-01-12 11:35:09'),
(258, 'وةستا جومعة .', NULL, NULL, NULL, 686500, 0, 0.00, 0.00, NULL, '2025-12-29 15:57:15', '2025-12-29 15:57:34'),
(259, 'ماموستا سةنكةر', '07501217440', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 15:57:52', '2026-01-07 12:34:29'),
(260, 'ماموستا كامةران', NULL, NULL, NULL, 99500, 0, 0.00, 0.00, NULL, '2025-12-29 15:58:29', '2025-12-29 15:58:44'),
(261, 'كاك زانا', '07501731734', NULL, NULL, 736850, 0, 0.00, 0.00, NULL, '2025-12-29 15:59:11', '2026-01-20 16:50:00'),
(262, 'كاك سةيد بةشدار 9=11$', NULL, NULL, NULL, 0, 0.00000732422, 0.00, 0.00, NULL, '2025-12-29 16:10:36', '2026-01-03 10:40:44'),
(263, 'وةستا ريباز', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2025-12-29 16:59:56', '2026-01-26 18:59:17'),
(264, 'كاك رةشاد', '07501148425', NULL, NULL, 130000, 0, 0.00, 0.00, NULL, '2026-01-01 18:19:07', '2026-01-01 18:19:35'),
(265, 'قوتابخانةي عةرةبيان', '07501119122', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2026-01-02 11:50:48', '2026-01-03 10:32:02'),
(266, 'كاك نةهرو جةلابي', '07501135823', NULL, NULL, 16500, 0, 0.00, 0.00, NULL, '2026-01-03 17:47:39', '2026-01-03 17:48:27'),
(267, 'كاك هاوري باكةت فروش', '07501593688', NULL, NULL, 9000, 0.419983, 0.00, 0.00, NULL, '2026-01-03 17:49:05', '2026-01-24 19:05:42'),
(268, 'كاك ئارام برازاي سةفةر', '07502455450', NULL, NULL, 483750, 0, 0.00, 0.00, NULL, '2026-01-04 16:11:48', '2026-01-06 11:22:04'),
(269, 'كاك هةكاري', '07501064545', NULL, NULL, 198000, 0, 0.00, 0.00, NULL, '2026-01-06 09:54:52', '2026-01-26 13:41:19'),
(270, 'كاك سامان تةق تةق', '0751 505 74 40', NULL, NULL, 425, 13120, 0.00, 0.00, NULL, '2026-01-06 10:44:17', '2026-01-26 15:35:42'),
(271, 'كاك سوران كةلناغاز', '07508557667', NULL, NULL, 1440000, 0, 0.00, 0.00, NULL, '2026-01-06 11:07:41', '2026-01-08 18:49:50'),
(272, 'كاك نزار قةلاب', '0750 156916', NULL, NULL, 59500, 0, 0.00, 0.00, NULL, '2026-01-06 11:13:56', '2026-01-06 11:14:14'),
(273, 'كاك سامي هةيبةسولتان', '07511401770', NULL, NULL, 280500, 0, 0.00, 0.00, NULL, '2026-01-06 11:26:07', '2026-01-18 10:30:38'),
(274, 'كاك سوارة', '07501960199', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2026-01-06 12:01:59', '2026-01-24 18:37:02'),
(275, 'هيمن ئةتيكو', '07501434414', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2026-01-06 13:56:39', '2026-01-12 15:21:47'),
(276, 'کاک بەلێن کن خوانی ئالا', '07510024748', NULL, NULL, 185000, 0, 0.00, 0.00, NULL, '2026-01-06 18:36:34', '2026-01-08 16:54:43'),
(277, 'كاك بيستون فقي فةتاح', '07736996080', NULL, NULL, 490750, 0, 0.00, 0.00, NULL, '2026-01-07 10:32:52', '2026-01-08 09:58:41'),
(278, 'فرهاد شاخةبيسكة', '07511197730', NULL, NULL, 762750, 0, 0.00, 0.00, NULL, '2026-01-07 11:11:25', '2026-01-07 11:24:38'),
(279, 'كاك كوزين جيراني باوكم', '07518344650', NULL, NULL, 265100, 0, 0.00, 0.00, NULL, '2026-01-08 10:00:06', '2026-01-24 15:50:34'),
(280, 'دكتور جةمال هةيبةسولتان', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2026-01-08 17:01:27', '2026-01-21 18:03:48'),
(281, 'كاك ئاسو بيبازوك', '0750 862 30 45', NULL, NULL, 428750, 0, 0.00, 0.00, NULL, '2026-01-08 17:52:20', '2026-01-08 17:53:29'),
(282, 'بكر مةسيفي', NULL, NULL, NULL, 478750, 264.52, 0.00, 0.00, NULL, '2026-01-12 11:58:30', '2026-01-26 13:21:12'),
(283, 'قارةمان ئةتيكو', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2026-01-12 12:04:03', '2026-01-15 12:20:20'),
(284, 'وةستا دلدار نةجار', '07515463568', NULL, NULL, 0, 0.23999, 0.00, 0.00, NULL, '2026-01-12 16:25:36', '2026-01-24 12:59:24'),
(285, 'مزكةوتي كردي عةرةبيان', NULL, NULL, NULL, 674500, 0, 0.00, 0.00, NULL, '2026-01-14 14:39:07', '2026-01-26 13:19:12'),
(286, 'حيزبي ديموكراتي كوردستان', NULL, NULL, NULL, 212862, 0, 0.00, 0.00, NULL, '2026-01-15 16:06:48', '2026-01-20 12:18:04'),
(287, 'كةنيسةي هةرموتة نةوزاد', NULL, NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2026-01-17 15:19:30', '2026-01-20 11:32:12'),
(288, 'كاك ئاكام', '07501254960', NULL, NULL, 110000, 0, 0.00, 0.00, NULL, '2026-01-18 10:41:12', '2026-01-18 10:41:34'),
(289, 'كاك سةفةر شةوكير', '07725467349', NULL, NULL, 367500, 0, 0.00, 0.00, NULL, '2026-01-18 10:49:26', '2026-01-20 15:44:27'),
(290, 'هيمن فةتاح', '07508156967', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2026-01-18 12:25:50', '2026-01-19 11:03:52'),
(291, 'كاك وةلي مام قولينج براي مةريوان', '07501392090', NULL, NULL, 568750, 0, 0.00, 0.00, NULL, '2026-01-21 16:16:09', '2026-01-21 16:19:41'),
(292, 'كاك نةعمان توبزاوة', '07508982937', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2026-01-24 12:37:27', '2026-01-26 11:37:54'),
(293, 'كاك جاسم', '07501531761', NULL, NULL, 109550, 0, 0.00, 0.00, NULL, '2026-01-25 12:28:28', '2026-01-25 12:29:39'),
(294, 'كاك هةردي', '07501116420', NULL, 'كن مزكةوتي سةفية خان', 762000, 0, 0.00, 0.00, NULL, '2026-01-25 12:37:28', '2026-01-26 13:42:40'),
(295, 'كاك هاوكار', '07501206243', NULL, NULL, 0, 0, 0.00, 0.00, NULL, '2026-01-26 13:23:46', '2026-01-26 14:10:00'),
(296, 'ماموستا ئاكو', '0750 1526533', NULL, NULL, 474950, 2342.21, 0.00, 0.00, NULL, '2026-01-26 13:51:46', '2026-01-26 14:00:31');

-- --------------------------------------------------------

--
-- Table structure for table `expenses`
--

CREATE TABLE `expenses` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `currency` enum('IQD','USD') NOT NULL DEFAULT 'IQD',
  `amount` float NOT NULL,
  `expense_date` date NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) NOT NULL,
  `connection` text NOT NULL,
  `queue` text NOT NULL,
  `payload` longtext NOT NULL,
  `exception` longtext NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `jobs`
--

CREATE TABLE `jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `queue` varchar(255) NOT NULL,
  `payload` longtext NOT NULL,
  `attempts` tinyint(3) UNSIGNED NOT NULL,
  `reserved_at` int(10) UNSIGNED DEFAULT NULL,
  `available_at` int(10) UNSIGNED NOT NULL,
  `created_at` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `job_batches`
--

CREATE TABLE `job_batches` (
  `id` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `total_jobs` int(11) NOT NULL,
  `pending_jobs` int(11) NOT NULL,
  `failed_jobs` int(11) NOT NULL,
  `failed_job_ids` longtext NOT NULL,
  `options` mediumtext DEFAULT NULL,
  `cancelled_at` int(11) DEFAULT NULL,
  `created_at` int(11) NOT NULL,
  `finished_at` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(14, '0001_01_01_000000_create_users_table', 1),
(15, '0001_01_01_000001_create_cache_table', 1),
(16, '0001_01_01_000002_create_jobs_table', 1),
(17, '2024_01_01_000002_create_categories_table', 1),
(18, '2024_01_01_000003_create_products_table', 1),
(19, '2024_01_01_000004_create_customers_table', 1),
(20, '2024_01_01_000005_create_suppliers_table', 1),
(21, '2024_01_01_000006_create_purchases_table', 1),
(22, '2024_01_01_000007_create_sales_table', 1),
(23, '2024_01_01_000008_create_payments_table', 1),
(24, '2024_01_01_000009_create_expenses_table', 1),
(25, '2024_01_01_000010_create_company_table', 1),
(26, '2024_01_01_000011_create_units_table', 1),
(27, '2025_12_27_102512_add_note_to_sale_items_table', 2),
(28, '2026_01_21_134457_create_balances_table', 3),
(29, '2026_01_25_164823_add_negative_balance_to_customers_table', 4),
(30, '2026_01_25_171606_add_excess_amount_to_payments_table', 4);

-- --------------------------------------------------------

--
-- Table structure for table `password_reset_tokens`
--

CREATE TABLE `password_reset_tokens` (
  `email` varchar(255) NOT NULL,
  `token` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `payments`
--

CREATE TABLE `payments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `customer_id` bigint(20) UNSIGNED DEFAULT NULL,
  `supplier_id` bigint(20) UNSIGNED DEFAULT NULL,
  `sale_id` bigint(20) UNSIGNED DEFAULT NULL,
  `purchase_id` bigint(20) UNSIGNED DEFAULT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `currency` enum('IQD','USD') NOT NULL,
  `payment_method` enum('cash','pos','transfer','cheque','other') NOT NULL DEFAULT 'cash',
  `type` enum('customer','supplier') NOT NULL DEFAULT 'customer',
  `amount` float NOT NULL,
  `excess_amount` decimal(15,2) NOT NULL DEFAULT 0.00,
  `debt_reduction` decimal(15,2) NOT NULL DEFAULT 0.00,
  `notes` text DEFAULT NULL,
  `payment_date` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `reference_number` varchar(255) DEFAULT NULL,
  `invoice_number` varchar(255) DEFAULT NULL,
  `bank_name` varchar(255) DEFAULT NULL,
  `account_number` varchar(255) DEFAULT NULL,
  `transaction_id` varchar(255) DEFAULT NULL,
  `status` enum('completed','pending','cancelled','refunded') NOT NULL DEFAULT 'completed',
  `attachment` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `payments`
--

INSERT INTO `payments` (`id`, `customer_id`, `supplier_id`, `sale_id`, `purchase_id`, `user_id`, `currency`, `payment_method`, `type`, `amount`, `excess_amount`, `debt_reduction`, `notes`, `payment_date`, `reference_number`, `invoice_number`, `bank_name`, `account_number`, `transaction_id`, `status`, `attachment`, `created_at`, `updated_at`, `deleted_at`) VALUES
(5, 19, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 400, 0.00, 0.00, NULL, '2025-12-27 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-27 13:24:06', '2025-12-27 13:24:06', NULL),
(6, 19, NULL, 36, NULL, 2, 'USD', 'transfer', 'customer', 400, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2025-12-27 13:24:06', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-27 13:24:06', '2025-12-27 13:24:06', NULL),
(7, 32, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 450, 0.00, 0.00, NULL, '2025-12-31 19:09:22', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-27 16:39:53', '2026-01-01 00:09:22', '2026-01-01 00:09:22'),
(8, 32, NULL, 50, NULL, 2, 'USD', 'transfer', 'customer', 450, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2025-12-31 19:08:52', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-27 16:39:53', '2026-01-01 00:08:52', '2026-01-01 00:08:52'),
(9, 57, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 108, 0.00, 0.00, 'ئي كةرانةوةي شيش', '2025-12-28 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-28 12:08:32', '2025-12-28 12:08:32', NULL),
(10, 57, NULL, 85, NULL, 2, 'USD', 'transfer', 'customer', 108, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2025-12-28 12:08:32', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-28 12:08:32', '2025-12-28 12:08:32', NULL),
(11, 23, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 548750, 0.00, 0.00, NULL, '2025-12-28 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-28 13:25:19', '2025-12-28 13:25:19', NULL),
(12, 23, NULL, 92, NULL, 2, 'IQD', 'transfer', 'customer', 548750, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2025-12-28 13:25:19', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-28 13:25:19', '2025-12-28 13:25:19', NULL),
(13, 67, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 1000000, 0.00, 0.00, NULL, '2025-12-28 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-28 16:21:07', '2025-12-28 16:21:07', NULL),
(14, 67, NULL, 95, NULL, 2, 'IQD', 'transfer', 'customer', 1000000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2025-12-28 16:21:07', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-28 16:21:07', '2025-12-28 16:21:07', NULL),
(15, 48, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 594, 0.00, 0.00, NULL, '2025-12-29 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-29 12:13:38', '2025-12-29 12:13:38', NULL),
(16, 48, NULL, 73, NULL, 2, 'USD', 'transfer', 'customer', 594, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2025-12-29 12:13:38', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-29 12:13:38', '2025-12-29 12:13:38', NULL),
(17, 208, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 1000000, 0.00, 0.00, NULL, '2025-12-29 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-29 13:28:52', '2025-12-29 13:28:52', NULL),
(18, 208, NULL, 240, NULL, 2, 'IQD', 'transfer', 'customer', 1000000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2025-12-29 13:28:52', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-29 13:28:52', '2025-12-29 13:28:52', NULL),
(19, 247, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 886500, 0.00, 0.00, NULL, '2025-12-29 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-29 15:45:53', '2025-12-29 15:45:53', NULL),
(20, 247, NULL, 281, NULL, 2, 'IQD', 'transfer', 'customer', 886500, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2025-12-29 15:45:53', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-29 15:45:53', '2025-12-29 15:45:53', NULL),
(21, 148, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 600000, 0.00, 0.00, NULL, '2025-12-29 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-29 15:51:17', '2025-12-29 15:51:17', NULL),
(22, 148, NULL, 177, NULL, 2, 'IQD', 'transfer', 'customer', 600000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2025-12-29 15:51:17', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-29 15:51:17', '2025-12-29 15:51:17', NULL),
(23, 56, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 690000, 0.00, 0.00, NULL, '2025-12-31 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-31 13:12:22', '2025-12-31 13:12:22', NULL),
(24, 56, NULL, 82, NULL, 2, 'IQD', 'transfer', 'customer', 690000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2025-12-31 13:12:22', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-31 13:12:22', '2025-12-31 13:12:22', NULL),
(25, 3, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 701000, 0.00, 0.00, NULL, '2025-12-31 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-31 13:54:44', '2025-12-31 13:54:44', NULL),
(26, 3, NULL, 2, NULL, 2, 'IQD', 'transfer', 'customer', 476000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2025-12-31 13:54:44', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-31 13:54:44', '2025-12-31 13:54:44', NULL),
(27, 3, NULL, 3, NULL, 2, 'IQD', 'transfer', 'customer', 180000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2025-12-31 13:54:44', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-31 13:54:44', '2025-12-31 13:54:44', NULL),
(28, 3, NULL, 4, NULL, 2, 'IQD', 'transfer', 'customer', 45000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2025-12-31 13:54:44', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-31 13:54:44', '2025-12-31 13:54:44', NULL),
(29, 138, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 3054000, 0.00, 0.00, NULL, '2025-12-31 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-31 15:56:50', '2025-12-31 15:56:50', NULL),
(30, 138, NULL, 168, NULL, 2, 'IQD', 'transfer', 'customer', 3054000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-03 05:50:14', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-31 15:56:50', '2026-01-03 10:50:14', '2026-01-03 10:50:14'),
(31, 109, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 3872750, 0.00, 0.00, NULL, '2025-12-31 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-31 16:00:18', '2025-12-31 16:00:18', NULL),
(32, 109, NULL, 138, NULL, 2, 'IQD', 'transfer', 'customer', 3872750, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2025-12-31 16:00:18', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-31 16:00:18', '2025-12-31 16:00:18', NULL),
(33, 96, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 2281280, 0.00, 0.00, NULL, '2025-12-31 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-31 16:03:11', '2025-12-31 16:03:11', NULL),
(34, 96, NULL, 125, NULL, 2, 'IQD', 'transfer', 'customer', 2281250, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2025-12-31 16:03:11', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-31 16:03:11', '2025-12-31 16:03:11', NULL),
(35, 96, NULL, 308, NULL, 2, 'IQD', 'transfer', 'customer', 30, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2025-12-31 16:03:11', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-31 16:03:11', '2025-12-31 16:03:11', NULL),
(36, 221, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 140000, 0.00, 0.00, NULL, '2025-12-31 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-31 17:08:43', '2025-12-31 17:08:43', NULL),
(37, 221, NULL, 253, NULL, 2, 'IQD', 'transfer', 'customer', 140000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2025-12-31 17:08:43', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2025-12-31 17:08:43', '2025-12-31 17:08:43', NULL),
(38, 197, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 293750, 0.00, 0.00, NULL, '2026-01-01 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 10:33:07', '2026-01-01 10:33:07', NULL),
(39, 197, NULL, 229, NULL, 2, 'IQD', 'transfer', 'customer', 293750, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-01 10:33:07', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 10:33:07', '2026-01-01 10:33:07', NULL),
(40, 203, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 203000, 0.00, 0.00, NULL, '2026-01-01 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 12:43:08', '2026-01-01 12:43:08', NULL),
(41, 203, NULL, 235, NULL, 2, 'IQD', 'transfer', 'customer', 203000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-01 12:43:08', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 12:43:08', '2026-01-01 12:43:08', NULL),
(42, 122, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 727000, 0.00, 0.00, NULL, '2026-01-01 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 13:05:03', '2026-01-01 13:05:03', NULL),
(43, 122, NULL, 151, NULL, 2, 'IQD', 'transfer', 'customer', 727000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-01 08:05:41', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 13:05:03', '2026-01-01 13:05:41', '2026-01-01 13:05:41'),
(44, 122, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 605000, 0.00, 0.00, NULL, '2026-01-01 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 13:06:13', '2026-01-01 13:06:13', NULL),
(45, 122, NULL, 151, NULL, 2, 'IQD', 'transfer', 'customer', 605000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-01 13:06:13', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 13:06:13', '2026-01-01 13:06:13', NULL),
(46, 17, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 1033.98, 0.00, 0.00, NULL, '2026-01-01 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 13:11:08', '2026-01-01 13:11:08', NULL),
(47, 17, NULL, 17, NULL, 2, 'USD', 'transfer', 'customer', 1033.98, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-01 13:11:08', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 13:11:08', '2026-01-01 13:11:08', NULL),
(48, 17, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 511250, 0.00, 0.00, NULL, '2026-01-01 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 13:11:32', '2026-01-01 13:11:32', NULL),
(49, 17, NULL, 106, NULL, 2, 'IQD', 'transfer', 'customer', 511250, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-01 13:11:32', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 13:11:32', '2026-01-01 13:11:32', NULL),
(50, 42, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 1108000, 0.00, 0.00, NULL, '2026-01-01 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 18:02:45', '2026-01-01 18:02:45', NULL),
(51, 42, NULL, 107, NULL, 2, 'IQD', 'transfer', 'customer', 1108000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-01 18:02:45', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 18:02:45', '2026-01-01 18:02:45', NULL),
(52, 89, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 4543750, 0.00, 0.00, NULL, '2026-01-01 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 18:05:03', '2026-01-01 18:05:03', NULL),
(53, 89, NULL, 119, NULL, 2, 'IQD', 'transfer', 'customer', 4543750, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-01 18:05:03', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 18:05:03', '2026-01-01 18:05:03', NULL),
(54, 47, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 553, 0.00, 0.00, NULL, '2026-01-01 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 18:09:10', '2026-01-01 18:09:10', NULL),
(55, 47, NULL, 72, NULL, 2, 'USD', 'transfer', 'customer', 553, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-01 18:09:10', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 18:09:10', '2026-01-01 18:09:10', NULL),
(56, 166, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 440000, 0.00, 0.00, NULL, '2026-01-01 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 18:10:01', '2026-01-01 18:10:01', NULL),
(57, 166, NULL, 196, NULL, 2, 'IQD', 'transfer', 'customer', 440000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-01 18:10:01', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 18:10:01', '2026-01-01 18:10:01', NULL),
(58, 231, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 87500, 0.00, 0.00, NULL, '2026-01-01 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 18:10:27', '2026-01-01 18:10:27', NULL),
(59, 231, NULL, 263, NULL, 2, 'IQD', 'transfer', 'customer', 87500, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-01 18:10:27', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 18:10:27', '2026-01-01 18:10:27', NULL),
(60, 250, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 600000, 0.00, 0.00, NULL, '2026-01-01 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 18:14:15', '2026-01-01 18:14:15', NULL),
(61, 250, NULL, 284, NULL, 2, 'IQD', 'transfer', 'customer', 600000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-01 18:14:15', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 18:14:15', '2026-01-01 18:14:15', NULL),
(62, 6, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 2499.99, 0.00, 0.00, 'لةبري 1كوجي مخمور', '2026-01-01 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 18:16:49', '2026-01-01 18:16:49', NULL),
(63, 6, NULL, 10, NULL, 2, 'IQD', 'transfer', 'customer', 2499.99, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-01 18:16:49', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 18:16:49', '2026-01-01 18:16:49', NULL),
(64, 128, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 680000, 0.00, 0.00, NULL, '2026-01-01 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 20:21:07', '2026-01-01 20:21:07', NULL),
(65, 128, NULL, 157, NULL, 2, 'IQD', 'transfer', 'customer', 680000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-01 20:21:07', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 20:21:07', '2026-01-01 20:21:07', NULL),
(66, 30, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 1773500, 0.00, 0.00, NULL, '2026-01-01 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 20:28:58', '2026-01-01 20:28:58', NULL),
(67, 30, NULL, 277, NULL, 2, 'IQD', 'transfer', 'customer', 1773500, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-01 20:28:58', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 20:28:58', '2026-01-01 20:28:58', NULL),
(68, 30, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 1928, 0.00, 0.00, NULL, '2026-01-01 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 20:29:48', '2026-01-01 20:29:48', NULL),
(69, 30, NULL, 47, NULL, 2, 'USD', 'transfer', 'customer', 1928, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-01 20:29:48', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 20:29:48', '2026-01-01 20:29:48', NULL),
(70, 262, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 515, 0.00, 0.00, NULL, '2026-01-01 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 20:40:27', '2026-01-01 20:40:27', NULL),
(71, 262, NULL, 296, NULL, 2, 'USD', 'transfer', 'customer', 515, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-01 20:40:27', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-01 20:40:27', '2026-01-01 20:40:27', NULL),
(72, 154, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 1056000, 0.00, 0.00, NULL, '2026-01-02 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-02 12:35:19', '2026-01-02 12:35:19', NULL),
(73, 154, NULL, 183, NULL, 2, 'IQD', 'transfer', 'customer', 1056000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-02 12:35:19', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-02 12:35:19', '2026-01-02 12:35:19', NULL),
(74, 265, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 39000, 0.00, 0.00, NULL, '2026-01-03 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 10:32:02', '2026-01-03 10:32:02', NULL),
(75, 265, NULL, 315, NULL, 2, 'IQD', 'transfer', 'customer', 39000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-03 10:32:02', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 10:32:02', '2026-01-03 10:32:02', NULL),
(76, 262, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 0.82, 0.00, 0.00, NULL, '2026-01-03 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 10:40:44', '2026-01-03 10:40:44', NULL),
(77, 262, NULL, 296, NULL, 2, 'USD', 'transfer', 'customer', 0.82, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-03 10:40:44', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 10:40:44', '2026-01-03 10:40:44', NULL),
(78, 138, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 3054000, 0.00, 0.00, NULL, '2026-01-03 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 10:52:09', '2026-01-03 10:52:09', NULL),
(79, 138, NULL, 168, NULL, 2, 'IQD', 'transfer', 'customer', 3054000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-03 10:52:09', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 10:52:09', '2026-01-03 10:52:09', NULL),
(80, 212, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 286750, 0.00, 0.00, NULL, '2026-01-03 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 11:02:53', '2026-01-03 11:02:53', NULL),
(81, 212, NULL, 244, NULL, 2, 'IQD', 'transfer', 'customer', 286750, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-03 11:02:53', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 11:02:53', '2026-01-03 11:02:53', NULL),
(82, 217, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 539000, 0.00, 0.00, NULL, '2026-01-03 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 11:04:36', '2026-01-03 11:04:36', NULL),
(83, 217, NULL, 249, NULL, 2, 'IQD', 'transfer', 'customer', 539000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-03 11:04:36', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 11:04:36', '2026-01-03 11:04:36', NULL),
(84, 227, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 613000, 0.00, 0.00, NULL, '2026-01-03 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 11:08:08', '2026-01-03 11:08:08', NULL),
(85, 227, NULL, 259, NULL, 2, 'IQD', 'transfer', 'customer', 613000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-03 11:08:08', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 11:08:08', '2026-01-03 11:08:08', NULL),
(86, 195, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 686000, 0.00, 0.00, NULL, '2026-01-03 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 13:49:26', '2026-01-03 13:49:26', NULL),
(87, 195, NULL, 227, NULL, 2, 'IQD', 'transfer', 'customer', 686000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-03 13:49:26', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 13:49:26', '2026-01-03 13:49:26', NULL),
(88, 27, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 1276, 0.00, 0.00, NULL, '2026-01-03 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 14:04:50', '2026-01-03 14:04:50', NULL),
(89, 27, NULL, 44, NULL, 2, 'USD', 'transfer', 'customer', 1276, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-03 14:04:50', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 14:04:50', '2026-01-03 14:04:50', NULL),
(90, 27, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 0.78, 0.00, 0.00, NULL, '2026-01-03 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 14:05:38', '2026-01-03 14:05:38', NULL),
(91, 27, NULL, 44, NULL, 2, 'USD', 'transfer', 'customer', 0.78, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-03 14:05:38', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 14:05:38', '2026-01-03 14:05:38', NULL),
(92, 216, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 100000, 0.00, 0.00, NULL, '2026-01-03 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 15:53:20', '2026-01-03 15:53:20', NULL),
(93, 216, NULL, 248, NULL, 2, 'IQD', 'transfer', 'customer', 100000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-03 15:53:20', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 15:53:20', '2026-01-03 15:53:20', NULL),
(94, 121, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 220500, 0.00, 0.00, NULL, '2026-01-03 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 17:11:42', '2026-01-03 17:11:42', NULL),
(95, 121, NULL, 150, NULL, 2, 'IQD', 'transfer', 'customer', 220500, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-03 17:11:42', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-03 17:11:42', '2026-01-03 17:11:42', NULL),
(96, 35, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 3054000, 0.00, 0.00, NULL, '2026-01-04 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-04 14:55:34', '2026-01-04 14:55:34', NULL),
(97, 35, NULL, 305, NULL, 2, 'IQD', 'transfer', 'customer', 3054000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-04 14:55:34', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-04 14:55:34', '2026-01-04 14:55:34', NULL),
(98, 35, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 1342, 0.00, 0.00, NULL, '2026-01-04 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-04 14:56:42', '2026-01-04 14:56:42', NULL),
(99, 35, NULL, 53, NULL, 2, 'USD', 'transfer', 'customer', 1342, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-04 14:56:42', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-04 14:56:42', '2026-01-04 14:56:42', NULL),
(100, 199, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 334000, 0.00, 0.00, NULL, '2026-01-04 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-04 15:03:09', '2026-01-04 15:03:09', NULL),
(101, 199, NULL, 231, NULL, 2, 'IQD', 'transfer', 'customer', 334000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-04 15:03:09', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-04 15:03:09', '2026-01-04 15:03:09', NULL),
(102, 75, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 125000, 0.00, 0.00, NULL, '2026-01-04 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-04 15:03:36', '2026-01-04 15:03:36', NULL),
(103, 75, NULL, 103, NULL, 2, 'IQD', 'transfer', 'customer', 125000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-04 15:03:36', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-04 15:03:36', '2026-01-04 15:03:36', NULL),
(104, 263, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 180000, 0.00, 0.00, NULL, '2026-01-04 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-04 16:46:20', '2026-01-04 16:46:20', NULL),
(105, 263, NULL, 300, NULL, 2, 'IQD', 'transfer', 'customer', 120000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-04 16:46:20', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-04 16:46:20', '2026-01-04 16:46:20', NULL),
(106, 263, NULL, 302, NULL, 2, 'IQD', 'transfer', 'customer', 60000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-04 16:46:20', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-04 16:46:20', '2026-01-04 16:46:20', NULL),
(107, 70, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 150000, 0.00, 0.00, NULL, '2026-01-04 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-04 17:33:54', '2026-01-04 17:33:54', NULL),
(108, 70, NULL, 98, NULL, 2, 'IQD', 'transfer', 'customer', 150000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-04 17:33:54', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-04 17:33:54', '2026-01-04 17:33:54', NULL),
(109, 101, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 500000, 0.00, 0.00, NULL, '2026-01-04 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-04 18:30:12', '2026-01-04 18:30:12', NULL),
(110, 101, NULL, 130, NULL, 2, 'IQD', 'transfer', 'customer', 500000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-04 18:30:12', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-04 18:30:12', '2026-01-04 18:30:12', NULL),
(111, 234, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 1833500, 0.00, 0.00, NULL, '2026-01-04 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-04 19:07:38', '2026-01-04 19:07:38', NULL),
(112, 234, NULL, 266, NULL, 2, 'IQD', 'transfer', 'customer', 1420000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-04 19:07:38', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-04 19:07:38', '2026-01-04 19:07:38', NULL),
(113, 234, NULL, 268, NULL, 2, 'IQD', 'transfer', 'customer', 413500, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-04 19:07:38', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-04 19:07:38', '2026-01-04 19:07:38', NULL),
(114, 6, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 269350, 0.00, 0.00, NULL, '2026-01-05 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-05 16:57:36', '2026-01-05 16:57:36', NULL),
(115, 6, NULL, 298, NULL, 2, 'IQD', 'transfer', 'customer', 36000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-05 16:57:36', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-05 16:57:36', '2026-01-05 16:57:36', NULL),
(116, 6, NULL, 10, NULL, 2, 'IQD', 'transfer', 'customer', 233350, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-05 16:57:36', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-05 16:57:36', '2026-01-05 16:57:36', NULL),
(117, 250, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 1189750, 0.00, 0.00, NULL, '2026-01-05 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-05 16:58:29', '2026-01-05 16:58:29', NULL),
(118, 250, NULL, 284, NULL, 2, 'IQD', 'transfer', 'customer', 1189750, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-05 16:58:29', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-05 16:58:29', '2026-01-05 16:58:29', NULL),
(119, 37, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 1318, 0.00, 0.00, NULL, '2026-01-06 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-06 11:10:20', '2026-01-06 11:10:20', NULL),
(120, 37, NULL, 56, NULL, 2, 'USD', 'transfer', 'customer', 1318, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-06 11:10:20', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-06 11:10:20', '2026-01-06 11:10:20', NULL),
(121, 270, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 24, 0.00, 0.00, NULL, '2026-01-06 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-06 12:03:24', '2026-01-06 12:03:24', NULL),
(122, 270, NULL, 337, NULL, 2, 'USD', 'transfer', 'customer', 24, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-06 07:07:58', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-06 12:03:24', '2026-01-06 12:07:58', '2026-01-06 12:07:58'),
(123, 274, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 30000, 0.00, 0.00, NULL, '2026-01-06 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-06 12:05:34', '2026-01-06 12:05:34', NULL),
(124, 274, NULL, 349, NULL, 2, 'IQD', 'transfer', 'customer', 30000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-06 12:05:34', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-06 12:05:34', '2026-01-06 12:05:34', NULL),
(125, 123, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 605000, 0.00, 0.00, NULL, '2026-01-06 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-06 12:32:32', '2026-01-06 12:32:32', NULL),
(126, 123, NULL, 152, NULL, 2, 'IQD', 'transfer', 'customer', 605000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-06 12:32:32', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-06 12:32:32', '2026-01-06 12:32:32', NULL),
(127, 123, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 143000, 0.00, 0.00, NULL, '2026-01-06 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-06 13:04:25', '2026-01-06 13:04:25', NULL),
(128, 123, NULL, 342, NULL, 2, 'IQD', 'transfer', 'customer', 143000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-06 13:04:25', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-06 13:04:25', '2026-01-06 13:04:25', NULL),
(129, 57, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 24000, 0.00, 0.00, 'لبري كةرانةوةي 4كةج و2كيسة', '2026-01-06 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-06 13:16:11', '2026-01-06 13:16:11', NULL),
(130, 57, NULL, 84, NULL, 2, 'IQD', 'transfer', 'customer', 24000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-06 13:16:11', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-06 13:16:11', '2026-01-06 13:16:11', NULL),
(131, 200, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 1808750, 0.00, 0.00, NULL, '2026-01-06 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-06 13:31:04', '2026-01-06 13:31:04', NULL),
(132, 200, NULL, 232, NULL, 2, 'IQD', 'transfer', 'customer', 1808750, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-06 13:31:04', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-06 13:31:04', '2026-01-06 13:31:04', NULL),
(133, 200, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 2000, 0.00, 0.00, NULL, '2026-01-06 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-06 14:10:22', '2026-01-06 14:10:22', NULL),
(134, 200, NULL, 356, NULL, 2, 'USD', 'transfer', 'customer', 2000, 0.00, 0.00, 'ئۆتۆماتیک - دابەشکراو لە نێوان فرۆشتنەکان', '2026-01-06 14:10:22', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-06 14:10:22', '2026-01-06 14:10:22', NULL),
(135, 276, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 192500, 0.00, 0.00, NULL, '2026-01-07 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 09:52:14', '2026-01-07 09:52:14', NULL),
(136, 276, NULL, 362, NULL, 2, 'IQD', 'transfer', 'customer', 137500, 0.00, 0.00, NULL, '2026-01-07 09:52:14', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 09:52:14', '2026-01-07 09:52:14', NULL),
(137, 276, NULL, 364, NULL, 2, 'IQD', 'transfer', 'customer', 55000, 0.00, 0.00, NULL, '2026-01-07 09:52:14', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 09:52:14', '2026-01-07 09:52:14', NULL),
(138, 189, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 205000, 0.00, 0.00, NULL, '2026-01-07 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 12:16:44', '2026-01-07 12:16:44', NULL),
(139, 189, NULL, 220, NULL, 2, 'IQD', 'transfer', 'customer', 205000, 0.00, 0.00, NULL, '2026-01-07 12:16:44', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 12:16:44', '2026-01-07 12:16:44', NULL),
(140, 259, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 70500, 0.00, 0.00, NULL, '2026-01-07 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 12:34:29', '2026-01-07 12:34:29', NULL),
(141, 259, NULL, 293, NULL, 2, 'IQD', 'transfer', 'customer', 70500, 0.00, 0.00, NULL, '2026-01-07 12:34:29', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 12:34:29', '2026-01-07 12:34:29', NULL),
(142, 45, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 7750, 0.00, 0.00, 'لةبري 1تيل و 23 قةفيز كةرانةوة', '2026-01-07 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 13:23:13', '2026-01-07 13:23:13', NULL),
(143, 45, NULL, 273, NULL, 2, 'IQD', 'transfer', 'customer', 7750, 0.00, 0.00, 'لةبري 1تيل و 23 قةفيز كةرانةوة', '2026-01-07 13:23:13', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 13:23:13', '2026-01-07 13:23:13', NULL),
(144, 45, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 1451, 0.00, 0.00, NULL, '2026-01-07 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 13:24:03', '2026-01-07 13:24:03', NULL),
(145, 45, NULL, 70, NULL, 2, 'USD', 'transfer', 'customer', 1451, 0.00, 0.00, NULL, '2026-01-07 13:24:03', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 13:24:03', '2026-01-07 13:24:03', NULL),
(146, 210, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 610000, 0.00, 0.00, NULL, '2026-01-07 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 15:12:38', '2026-01-07 15:12:38', NULL),
(147, 210, NULL, 242, NULL, 2, 'IQD', 'transfer', 'customer', 610000, 0.00, 0.00, NULL, '2026-01-07 15:12:38', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 15:12:38', '2026-01-07 15:12:38', NULL),
(148, 243, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 67500, 0.00, 0.00, 'لبري ى54 بةردي ئاكري', '2026-01-07 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 16:25:48', '2026-01-07 16:25:48', NULL),
(149, 243, NULL, 330, NULL, 2, 'IQD', 'transfer', 'customer', 67500, 0.00, 0.00, 'لبري ى54 بةردي ئاكري', '2026-01-07 16:25:49', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 16:25:49', '2026-01-07 16:25:49', NULL),
(150, 146, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 617000, 0.00, 0.00, NULL, '2026-01-07 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 17:33:03', '2026-01-07 17:33:03', NULL),
(151, 146, NULL, 175, NULL, 2, 'IQD', 'transfer', 'customer', 617000, 0.00, 0.00, NULL, '2026-01-07 17:33:03', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 17:33:03', '2026-01-07 17:33:03', NULL),
(152, 187, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 1460000, 0.00, 0.00, NULL, '2026-01-07 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 19:18:51', '2026-01-07 19:18:51', NULL),
(153, 187, NULL, 218, NULL, 2, 'IQD', 'transfer', 'customer', 1460000, 0.00, 0.00, NULL, '2026-01-07 19:18:51', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-07 19:18:51', '2026-01-07 19:18:51', NULL),
(154, 275, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 127500, 0.00, 0.00, NULL, '2026-01-08 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-08 10:49:59', '2026-01-08 10:49:59', NULL),
(155, 275, NULL, 355, NULL, 2, 'IQD', 'transfer', 'customer', 425, 0.00, 0.00, NULL, '2026-01-08 10:49:59', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-08 10:49:59', '2026-01-08 10:49:59', NULL),
(156, 275, NULL, 374, NULL, 2, 'IQD', 'transfer', 'customer', 127075, 0.00, 0.00, NULL, '2026-01-08 10:49:59', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-08 10:49:59', '2026-01-08 10:49:59', NULL),
(157, 69, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 200000, 0.00, 0.00, NULL, '2026-01-08 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-08 12:21:03', '2026-01-08 12:21:03', NULL),
(158, 69, NULL, 97, NULL, 2, 'IQD', 'transfer', 'customer', 200000, 0.00, 0.00, NULL, '2026-01-08 12:21:03', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-08 12:21:03', '2026-01-08 12:21:03', NULL),
(159, 182, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 42000, 0.00, 0.00, 'لةبري كةرانةوةي زاوية', '2026-01-08 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-08 16:59:02', '2026-01-08 16:59:02', NULL),
(160, 182, NULL, 213, NULL, 2, 'IQD', 'transfer', 'customer', 42000, 0.00, 0.00, 'لةبري كةرانةوةي زاوية', '2026-01-08 16:59:02', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-08 16:59:02', '2026-01-08 16:59:02', NULL),
(161, 251, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 2900000, 0.00, 0.00, NULL, '2026-01-08 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-08 18:14:10', '2026-01-08 18:14:10', NULL),
(162, 251, NULL, 285, NULL, 2, 'IQD', 'transfer', 'customer', 2900000, 0.00, 0.00, NULL, '2026-01-08 18:14:10', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-08 18:14:10', '2026-01-08 18:14:10', NULL),
(163, 234, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 9000, 0.00, 0.00, 'لةب ري 3 كيسة كةج', '2026-01-10 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 10:28:55', '2026-01-10 10:28:55', NULL),
(164, 234, NULL, 301, NULL, 2, 'IQD', 'transfer', 'customer', 9000, 0.00, 0.00, 'لةب ري 3 كيسة كةج', '2026-01-10 10:28:55', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 10:28:55', '2026-01-10 10:28:55', NULL),
(165, 18, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 1990500, 0.00, 0.00, NULL, '2026-01-10 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 13:31:42', '2026-01-10 13:31:42', NULL),
(166, 18, NULL, 59, NULL, 2, 'IQD', 'transfer', 'customer', 170000, 0.00, 0.00, NULL, '2026-01-10 13:31:42', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 13:31:42', '2026-01-10 13:31:42', NULL),
(167, 18, NULL, 60, NULL, 2, 'IQD', 'transfer', 'customer', 56750, 0.00, 0.00, NULL, '2026-01-10 13:31:42', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 13:31:42', '2026-01-10 13:31:42', NULL),
(168, 18, NULL, 65, NULL, 2, 'IQD', 'transfer', 'customer', 85000, 0.00, 0.00, NULL, '2026-01-10 13:31:42', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 13:31:42', '2026-01-10 13:31:42', NULL),
(169, 18, NULL, 389, NULL, 2, 'IQD', 'transfer', 'customer', 190000, 0.00, 0.00, NULL, '2026-01-10 13:31:42', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 13:31:42', '2026-01-10 13:31:42', NULL),
(170, 18, NULL, 390, NULL, 2, 'IQD', 'transfer', 'customer', 285000, 0.00, 0.00, NULL, '2026-01-10 13:31:42', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 13:31:42', '2026-01-10 13:31:42', NULL),
(171, 18, NULL, 394, NULL, 2, 'IQD', 'transfer', 'customer', 158750, 0.00, 0.00, NULL, '2026-01-10 13:31:42', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 13:31:42', '2026-01-10 13:31:42', NULL),
(172, 18, NULL, 397, NULL, 2, 'IQD', 'transfer', 'customer', 363750, 0.00, 0.00, NULL, '2026-01-10 13:31:42', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 13:31:42', '2026-01-10 13:31:42', NULL),
(173, 18, NULL, 401, NULL, 2, 'IQD', 'transfer', 'customer', 158750, 0.00, 0.00, NULL, '2026-01-10 13:31:42', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 13:31:42', '2026-01-10 13:31:42', NULL),
(174, 18, NULL, 403, NULL, 2, 'IQD', 'transfer', 'customer', 363750, 0.00, 0.00, NULL, '2026-01-10 13:31:42', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 13:31:42', '2026-01-10 13:31:42', NULL),
(175, 18, NULL, 406, NULL, 2, 'IQD', 'transfer', 'customer', 158750, 0.00, 0.00, NULL, '2026-01-10 13:31:42', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 13:31:42', '2026-01-10 13:31:42', NULL),
(176, 18, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 760.83, 0.00, 0.00, NULL, '2026-01-10 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 13:32:24', '2026-01-10 13:32:24', NULL),
(177, 18, NULL, 18, NULL, 2, 'USD', 'transfer', 'customer', 760.83, 0.00, 0.00, NULL, '2026-01-10 13:32:24', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 13:32:24', '2026-01-10 13:32:24', NULL),
(178, 275, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 140675, 0.00, 0.00, NULL, '2026-01-10 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 13:40:26', '2026-01-10 13:40:26', NULL),
(179, 275, NULL, 387, NULL, 2, 'IQD', 'transfer', 'customer', 106250, 0.00, 0.00, NULL, '2026-01-10 13:40:26', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 13:40:26', '2026-01-10 13:40:26', NULL),
(180, 275, NULL, 392, NULL, 2, 'IQD', 'transfer', 'customer', 34000, 0.00, 0.00, NULL, '2026-01-10 13:40:26', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 13:40:26', '2026-01-10 13:40:26', NULL),
(181, 275, NULL, 374, NULL, 2, 'IQD', 'transfer', 'customer', 425, 0.00, 0.00, NULL, '2026-01-10 13:40:26', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-10 13:40:26', '2026-01-10 13:40:26', NULL),
(182, 49, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 1220000, 0.00, 0.00, NULL, '2026-01-12 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-12 11:29:43', '2026-01-12 11:29:43', NULL),
(183, 49, NULL, 195, NULL, 2, 'IQD', 'transfer', 'customer', 1220000, 0.00, 0.00, NULL, '2026-01-12 11:29:43', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-12 11:29:43', '2026-01-12 11:29:43', NULL),
(184, 39, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 170000, 0.00, 0.00, NULL, '2026-01-12 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-12 11:30:41', '2026-01-12 11:30:41', NULL),
(185, 39, NULL, 58, NULL, 2, 'IQD', 'transfer', 'customer', 170000, 0.00, 0.00, NULL, '2026-01-12 11:30:41', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-12 11:30:41', '2026-01-12 11:30:41', NULL),
(186, 141, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 500000, 0.00, 0.00, NULL, '2026-01-12 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-12 11:31:47', '2026-01-12 11:31:47', NULL),
(187, 141, NULL, 170, NULL, 2, 'IQD', 'transfer', 'customer', 500000, 0.00, 0.00, NULL, '2026-01-12 11:31:47', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-12 11:31:47', '2026-01-12 11:31:47', NULL),
(188, 257, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 400000, 0.00, 0.00, NULL, '2026-01-12 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-12 11:35:09', '2026-01-12 11:35:09', NULL),
(189, 257, NULL, 291, NULL, 2, 'IQD', 'transfer', 'customer', 400000, 0.00, 0.00, NULL, '2026-01-12 11:35:09', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-12 11:35:09', '2026-01-12 11:35:09', NULL),
(190, 172, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 50000, 0.00, 0.00, NULL, '2026-01-12 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-12 11:48:23', '2026-01-12 11:48:23', NULL),
(191, 172, NULL, 202, NULL, 2, 'IQD', 'transfer', 'customer', 50000, 0.00, 0.00, NULL, '2026-01-12 11:48:23', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-12 11:48:23', '2026-01-12 11:48:23', NULL),
(192, 275, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 68000, 0.00, 0.00, NULL, '2026-01-12 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-12 15:21:47', '2026-01-12 15:21:47', NULL),
(193, 275, NULL, 412, NULL, 2, 'IQD', 'transfer', 'customer', 68000, 0.00, 0.00, NULL, '2026-01-12 15:21:47', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-12 15:21:47', '2026-01-12 15:21:47', NULL),
(194, 243, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 30000, 0.00, 0.00, 'لةبري 6متر زاويةي 6مليم', '2026-01-13 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-13 12:24:45', '2026-01-13 12:24:45', NULL),
(195, 243, NULL, 330, NULL, 2, 'IQD', 'transfer', 'customer', 30000, 0.00, 0.00, 'لةبري 6متر زاويةي 6مليم', '2026-01-13 12:24:45', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-13 12:24:45', '2026-01-13 12:24:45', NULL),
(196, 243, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 3196000, 0.00, 0.00, NULL, '2026-01-13 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-13 14:24:07', '2026-01-13 14:24:07', NULL),
(197, 243, NULL, 330, NULL, 2, 'IQD', 'transfer', 'customer', 3196000, 0.00, 0.00, NULL, '2026-01-13 14:24:07', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-13 14:24:07', '2026-01-13 14:24:07', NULL),
(198, 283, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 100000, 0.00, 0.00, NULL, '2026-01-15 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-15 12:20:20', '2026-01-15 12:20:20', NULL),
(199, 283, NULL, 410, NULL, 2, 'IQD', 'transfer', 'customer', 100000, 0.00, 0.00, NULL, '2026-01-15 12:20:20', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-15 12:20:20', '2026-01-15 12:20:20', NULL),
(200, 263, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 214500, 0.00, 0.00, NULL, '2026-01-15 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-15 15:51:06', '2026-01-15 15:51:06', NULL),
(201, 263, NULL, 321, NULL, 2, 'IQD', 'transfer', 'customer', 67500, 0.00, 0.00, NULL, '2026-01-15 15:51:06', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-15 15:51:06', '2026-01-15 15:51:06', NULL),
(202, 263, NULL, 328, NULL, 2, 'IQD', 'transfer', 'customer', 54000, 0.00, 0.00, NULL, '2026-01-15 15:51:07', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-15 15:51:07', '2026-01-15 15:51:07', NULL),
(203, 263, NULL, 383, NULL, 2, 'IQD', 'transfer', 'customer', 18000, 0.00, 0.00, NULL, '2026-01-15 15:51:07', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-15 15:51:07', '2026-01-15 15:51:07', NULL),
(204, 263, NULL, 411, NULL, 2, 'IQD', 'transfer', 'customer', 75000, 0.00, 0.00, NULL, '2026-01-15 15:51:07', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-15 15:51:07', '2026-01-15 15:51:07', NULL),
(205, 290, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 1091250, 0.00, 0.00, NULL, '2026-01-19 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 11:03:52', '2026-01-19 11:03:52', NULL),
(206, 290, NULL, 448, NULL, 2, 'IQD', 'transfer', 'customer', 363750, 0.00, 0.00, NULL, '2026-01-19 11:03:52', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 11:03:52', '2026-01-19 11:03:52', NULL),
(207, 290, NULL, 450, NULL, 2, 'IQD', 'transfer', 'customer', 727500, 0.00, 0.00, NULL, '2026-01-19 11:03:52', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 11:03:52', '2026-01-19 11:03:52', NULL),
(208, 284, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 50, 0.00, 0.00, 'دولار لةبري كةرانةوةي 10دانة شيش', '2026-01-19 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 12:31:50', '2026-01-19 12:31:50', NULL),
(209, 284, NULL, 414, NULL, 2, 'USD', 'transfer', 'customer', 50, 0.00, 0.00, 'دولار لةبري كةرانةوةي 10دانة شيش', '2026-01-19 12:31:50', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 12:31:50', '2026-01-19 12:31:50', NULL),
(210, 57, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 2289, 0.00, 0.00, NULL, '2026-01-19 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 16:48:15', '2026-01-19 16:48:15', NULL),
(211, 57, NULL, 85, NULL, 2, 'USD', 'transfer', 'customer', 2289, 0.00, 0.00, NULL, '2026-01-19 16:48:15', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 16:48:15', '2026-01-19 16:48:15', NULL),
(212, 57, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 0.66, 0.00, 0.00, NULL, '2026-01-19 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 16:50:48', '2026-01-19 16:50:48', NULL),
(213, 57, NULL, 85, NULL, 2, 'USD', 'transfer', 'customer', 0.66, 0.00, 0.00, NULL, '2026-01-19 16:50:48', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 16:50:48', '2026-01-19 16:50:48', NULL),
(214, 4, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 1950250, 0.00, 0.00, NULL, '2026-01-19 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 17:07:55', '2026-01-19 17:07:55', NULL),
(215, 4, NULL, 5, NULL, 2, 'IQD', 'transfer', 'customer', 78000, 0.00, 0.00, NULL, '2026-01-19 17:07:55', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 17:07:55', '2026-01-19 17:07:55', NULL),
(216, 4, NULL, 6, NULL, 2, 'IQD', 'transfer', 'customer', 994500, 0.00, 0.00, NULL, '2026-01-19 17:07:55', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 17:07:55', '2026-01-19 17:07:55', NULL),
(217, 4, NULL, 7, NULL, 2, 'IQD', 'transfer', 'customer', 75000, 0.00, 0.00, NULL, '2026-01-19 17:07:55', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 17:07:55', '2026-01-19 17:07:55', NULL),
(218, 4, NULL, 8, NULL, 2, 'IQD', 'transfer', 'customer', 59500, 0.00, 0.00, NULL, '2026-01-19 17:07:55', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 17:07:55', '2026-01-19 17:07:55', NULL),
(219, 4, NULL, 62, NULL, 2, 'IQD', 'transfer', 'customer', 89500, 0.00, 0.00, NULL, '2026-01-19 17:07:55', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 17:07:55', '2026-01-19 17:07:55', NULL),
(220, 4, NULL, 63, NULL, 2, 'IQD', 'transfer', 'customer', 18000, 0.00, 0.00, NULL, '2026-01-19 17:07:55', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 17:07:55', '2026-01-19 17:07:55', NULL),
(221, 4, NULL, 297, NULL, 2, 'IQD', 'transfer', 'customer', 36250, 0.00, 0.00, NULL, '2026-01-19 17:07:55', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 17:07:55', '2026-01-19 17:07:55', NULL),
(222, 4, NULL, 336, NULL, 2, 'IQD', 'transfer', 'customer', 84000, 0.00, 0.00, NULL, '2026-01-19 17:07:55', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 17:07:55', '2026-01-19 17:07:55', NULL),
(223, 4, NULL, 343, NULL, 2, 'IQD', 'transfer', 'customer', 25500, 0.00, 0.00, NULL, '2026-01-19 17:07:55', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 17:07:55', '2026-01-19 17:07:55', NULL),
(224, 4, NULL, 357, NULL, 2, 'IQD', 'transfer', 'customer', 107500, 0.00, 0.00, NULL, '2026-01-19 17:07:55', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 17:07:55', '2026-01-19 17:07:55', NULL),
(225, 4, NULL, 407, NULL, 2, 'IQD', 'transfer', 'customer', 253000, 0.00, 0.00, NULL, '2026-01-19 17:07:55', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 17:07:55', '2026-01-19 17:07:55', NULL),
(226, 4, NULL, 415, NULL, 2, 'IQD', 'transfer', 'customer', 15000, 0.00, 0.00, NULL, '2026-01-19 17:07:55', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 17:07:55', '2026-01-19 17:07:55', NULL),
(227, 4, NULL, 430, NULL, 2, 'IQD', 'transfer', 'customer', 114500, 0.00, 0.00, NULL, '2026-01-19 17:07:55', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 17:07:55', '2026-01-19 17:07:55', NULL);
INSERT INTO `payments` (`id`, `customer_id`, `supplier_id`, `sale_id`, `purchase_id`, `user_id`, `currency`, `payment_method`, `type`, `amount`, `excess_amount`, `debt_reduction`, `notes`, `payment_date`, `reference_number`, `invoice_number`, `bank_name`, `account_number`, `transaction_id`, `status`, `attachment`, `created_at`, `updated_at`, `deleted_at`) VALUES
(228, 99, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 116000, 0.00, 0.00, NULL, '2026-01-19 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 17:10:05', '2026-01-19 17:10:05', NULL),
(229, 99, NULL, 128, NULL, 2, 'IQD', 'transfer', 'customer', 116000, 0.00, 0.00, NULL, '2026-01-19 17:10:05', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 17:10:05', '2026-01-19 17:10:05', NULL),
(230, 87, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 129250, 0.00, 0.00, NULL, '2026-01-19 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 17:10:26', '2026-01-19 17:10:26', NULL),
(231, 87, NULL, 117, NULL, 2, 'IQD', 'transfer', 'customer', 129250, 0.00, 0.00, NULL, '2026-01-19 17:10:26', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-19 17:10:26', '2026-01-19 17:10:26', NULL),
(232, 227, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 931000, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 11:27:50', '2026-01-20 11:27:50', NULL),
(233, 227, NULL, 259, NULL, 2, 'IQD', 'transfer', 'customer', 611000, 0.00, 0.00, NULL, '2026-01-20 11:27:50', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 11:27:50', '2026-01-20 11:27:50', NULL),
(234, 227, NULL, 444, NULL, 2, 'IQD', 'transfer', 'customer', 314000, 0.00, 0.00, NULL, '2026-01-20 11:27:50', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 11:27:50', '2026-01-20 11:27:50', NULL),
(235, 227, NULL, 452, NULL, 2, 'IQD', 'transfer', 'customer', 6000, 0.00, 0.00, NULL, '2026-01-20 11:27:50', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 11:27:50', '2026-01-20 11:27:50', NULL),
(236, 108, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 64500, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 11:29:10', '2026-01-20 11:29:10', NULL),
(237, 108, NULL, 137, NULL, 2, 'IQD', 'transfer', 'customer', 64500, 0.00, 0.00, NULL, '2026-01-20 11:29:10', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 11:29:10', '2026-01-20 11:29:10', NULL),
(238, 287, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 100000, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 11:32:12', '2026-01-20 11:32:12', NULL),
(239, 287, NULL, 433, NULL, 2, 'IQD', 'transfer', 'customer', 100000, 0.00, 0.00, NULL, '2026-01-20 11:32:12', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 11:32:12', '2026-01-20 11:32:12', NULL),
(240, 108, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 124000, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 11:33:07', '2026-01-20 11:33:07', NULL),
(241, 108, NULL, 373, NULL, 2, 'IQD', 'transfer', 'customer', 47500, 0.00, 0.00, NULL, '2026-01-20 11:33:07', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 11:33:07', '2026-01-20 11:33:07', NULL),
(242, 108, NULL, 380, NULL, 2, 'IQD', 'transfer', 'customer', 17000, 0.00, 0.00, NULL, '2026-01-20 11:33:07', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 11:33:07', '2026-01-20 11:33:07', NULL),
(243, 108, NULL, 137, NULL, 2, 'IQD', 'transfer', 'customer', 59500, 0.00, 0.00, NULL, '2026-01-20 11:33:07', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 11:33:07', '2026-01-20 11:33:07', NULL),
(244, 52, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 161.38, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 11:42:14', '2026-01-20 11:42:14', NULL),
(245, 52, NULL, 333, NULL, 2, 'USD', 'transfer', 'customer', 161.38, 0.00, 0.00, NULL, '2026-01-20 11:42:14', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 11:42:14', '2026-01-20 11:42:14', NULL),
(246, 52, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 159000, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 11:42:39', '2026-01-20 11:42:39', NULL),
(247, 52, NULL, 78, NULL, 2, 'IQD', 'transfer', 'customer', 159000, 0.00, 0.00, NULL, '2026-01-20 11:42:39', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 11:42:39', '2026-01-20 11:42:39', NULL),
(248, 33, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 3002.62, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 12:05:53', '2026-01-20 12:05:53', NULL),
(249, 33, NULL, 51, NULL, 2, 'USD', 'transfer', 'customer', 3002.62, 0.00, 0.00, NULL, '2026-01-20 12:05:53', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 12:05:53', '2026-01-20 12:05:53', NULL),
(250, 270, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 15000, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 12:13:46', '2026-01-20 12:13:46', NULL),
(251, 270, NULL, 337, NULL, 2, 'USD', 'transfer', 'customer', 8752, 0.00, 0.00, NULL, '2026-01-26 10:31:36', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 12:13:46', '2026-01-26 15:31:36', '2026-01-26 15:31:36'),
(252, 270, NULL, 363, NULL, 2, 'USD', 'transfer', 'customer', 2188, 0.00, 0.00, NULL, '2026-01-26 10:31:51', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 12:13:46', '2026-01-26 15:31:51', '2026-01-26 15:31:51'),
(253, 270, NULL, 348, NULL, 2, 'USD', 'transfer', 'customer', 0.04, 0.00, 0.00, NULL, '2026-01-20 12:13:46', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 12:13:46', '2026-01-20 12:13:46', NULL),
(254, 270, NULL, 459, NULL, 2, 'USD', 'transfer', 'customer', 4059.96, 0.00, 0.00, NULL, '2026-01-26 10:30:45', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 12:13:46', '2026-01-26 15:30:45', '2026-01-26 15:30:45'),
(255, 286, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 13, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 12:17:21', '2026-01-20 12:17:21', NULL),
(256, 286, NULL, 419, NULL, 2, 'IQD', 'transfer', 'customer', 13, 0.00, 0.00, NULL, '2026-01-20 12:17:21', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 12:17:21', '2026-01-20 12:17:21', NULL),
(257, 286, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 135000, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 12:18:04', '2026-01-20 12:18:04', NULL),
(258, 286, NULL, 420, NULL, 2, 'IQD', 'transfer', 'customer', 53125, 0.00, 0.00, NULL, '2026-01-20 12:18:04', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 12:18:04', '2026-01-20 12:18:04', NULL),
(259, 286, NULL, 421, NULL, 2, 'IQD', 'transfer', 'customer', 31875, 0.00, 0.00, NULL, '2026-01-20 12:18:04', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 12:18:04', '2026-01-20 12:18:04', NULL),
(260, 286, NULL, 422, NULL, 2, 'IQD', 'transfer', 'customer', 50000, 0.00, 0.00, NULL, '2026-01-20 12:18:04', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 12:18:04', '2026-01-20 12:18:04', NULL),
(261, 125, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 245000, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 13:13:11', '2026-01-20 13:13:11', NULL),
(262, 125, NULL, 154, NULL, 2, 'IQD', 'transfer', 'customer', 245000, 0.00, 0.00, NULL, '2026-01-20 13:13:11', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 13:13:11', '2026-01-20 13:13:11', NULL),
(263, 49, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 1995750, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 15:47:01', '2026-01-20 15:47:01', NULL),
(264, 49, NULL, 195, NULL, 2, 'IQD', 'transfer', 'customer', 1995750, 0.00, 0.00, NULL, '2026-01-20 15:47:01', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 15:47:01', '2026-01-20 15:47:01', NULL),
(265, 234, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 31000, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 15:47:47', '2026-01-20 15:47:47', NULL),
(266, 234, NULL, 268, NULL, 2, 'IQD', 'transfer', 'customer', 31000, 0.00, 0.00, NULL, '2026-01-20 15:47:47', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 15:47:47', '2026-01-20 15:47:47', NULL),
(267, 210, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 1030000, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 16:02:40', '2026-01-20 16:02:40', NULL),
(268, 210, NULL, 382, NULL, 2, 'IQD', 'transfer', 'customer', 727500, 0.00, 0.00, NULL, '2026-01-20 16:02:40', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 16:02:40', '2026-01-20 16:02:40', NULL),
(269, 210, NULL, 242, NULL, 2, 'IQD', 'transfer', 'customer', 180000, 0.00, 0.00, NULL, '2026-01-20 16:02:40', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 16:02:40', '2026-01-20 16:02:40', NULL),
(270, 210, NULL, 388, NULL, 2, 'IQD', 'transfer', 'customer', 70000, 0.00, 0.00, NULL, '2026-01-20 16:02:40', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 16:02:40', '2026-01-20 16:02:40', NULL),
(271, 210, NULL, 400, NULL, 2, 'IQD', 'transfer', 'customer', 52500, 0.00, 0.00, NULL, '2026-01-20 16:02:40', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 16:02:40', '2026-01-20 16:02:40', NULL),
(272, 121, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 2974500, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 16:44:16', '2026-01-20 16:44:16', NULL),
(273, 121, NULL, 313, NULL, 2, 'IQD', 'transfer', 'customer', 220500, 0.00, 0.00, NULL, '2026-01-20 16:44:16', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 16:44:16', '2026-01-20 16:44:16', NULL),
(274, 121, NULL, 150, NULL, 2, 'IQD', 'transfer', 'customer', 2754000, 0.00, 0.00, NULL, '2026-01-20 16:44:16', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 16:44:16', '2026-01-20 16:44:16', NULL),
(275, 42, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 1550, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 16:46:50', '2026-01-20 16:46:50', NULL),
(276, 42, NULL, 66, NULL, 2, 'USD', 'transfer', 'customer', 1550, 0.00, 0.00, NULL, '2026-01-20 16:46:50', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 16:46:50', '2026-01-20 16:46:50', NULL),
(277, 261, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 150000, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 16:50:00', '2026-01-20 16:50:00', NULL),
(278, 261, NULL, 295, NULL, 2, 'IQD', 'transfer', 'customer', 86850, 0.00, 0.00, NULL, '2026-01-20 16:50:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 16:50:00', '2026-01-20 16:50:00', NULL),
(279, 261, NULL, 303, NULL, 2, 'IQD', 'transfer', 'customer', 63150, 0.00, 0.00, NULL, '2026-01-20 16:50:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 16:50:00', '2026-01-20 16:50:00', NULL),
(280, 157, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 287750, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 16:54:28', '2026-01-20 16:54:28', NULL),
(281, 157, NULL, 186, NULL, 2, 'IQD', 'transfer', 'customer', 258000, 0.00, 0.00, NULL, '2026-01-20 16:54:28', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 16:54:28', '2026-01-20 16:54:28', NULL),
(282, 157, NULL, 353, NULL, 2, 'IQD', 'transfer', 'customer', 29750, 0.00, 0.00, NULL, '2026-01-20 16:54:28', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 16:54:28', '2026-01-20 16:54:28', NULL),
(283, 218, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 1000000, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 16:54:58', '2026-01-20 16:54:58', NULL),
(284, 218, NULL, 250, NULL, 2, 'IQD', 'transfer', 'customer', 1000000, 0.00, 0.00, NULL, '2026-01-20 16:54:58', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 16:54:58', '2026-01-20 16:54:58', NULL),
(285, 20, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 6373.85, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 17:46:40', '2026-01-20 17:46:40', NULL),
(286, 20, NULL, 37, NULL, 2, 'USD', 'transfer', 'customer', 6319.85, 0.00, 0.00, NULL, '2026-01-20 17:46:40', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 17:46:40', '2026-01-20 17:46:40', NULL),
(287, 20, NULL, 304, NULL, 2, 'USD', 'transfer', 'customer', 54, 0.00, 0.00, NULL, '2026-01-20 17:46:40', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 17:46:40', '2026-01-20 17:46:40', NULL),
(288, 194, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 323000, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 18:01:48', '2026-01-20 18:01:48', NULL),
(289, 194, NULL, 226, NULL, 2, 'IQD', 'transfer', 'customer', 323000, 0.00, 0.00, NULL, '2026-01-20 18:01:48', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 18:01:48', '2026-01-20 18:01:48', NULL),
(290, 97, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 2023250, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 18:22:50', '2026-01-20 18:22:50', NULL),
(291, 97, NULL, 126, NULL, 2, 'IQD', 'transfer', 'customer', 2023250, 0.00, 0.00, NULL, '2026-01-20 18:22:50', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 18:22:50', '2026-01-20 18:22:50', NULL),
(292, 232, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 2000000, 0.00, 0.00, NULL, '2026-01-20 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 19:02:04', '2026-01-20 19:02:04', NULL),
(293, 232, NULL, 264, NULL, 2, 'IQD', 'transfer', 'customer', 2000000, 0.00, 0.00, NULL, '2026-01-20 19:02:04', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-20 19:02:04', '2026-01-20 19:02:04', NULL),
(294, 151, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 318750, 0.00, 0.00, NULL, '2026-01-21 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-21 15:54:42', '2026-01-21 15:54:42', NULL),
(295, 151, NULL, 180, NULL, 2, 'IQD', 'transfer', 'customer', 318750, 0.00, 0.00, NULL, '2026-01-21 15:54:42', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-21 15:54:42', '2026-01-21 15:54:42', NULL),
(296, 65, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 317000, 0.00, 0.00, NULL, '2026-01-21 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-21 17:59:43', '2026-01-21 17:59:43', NULL),
(297, 65, NULL, 93, NULL, 2, 'IQD', 'transfer', 'customer', 317000, 0.00, 0.00, NULL, '2026-01-21 17:59:43', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-21 17:59:43', '2026-01-21 17:59:43', NULL),
(298, 280, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 154500, 0.00, 0.00, NULL, '2026-01-21 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-21 18:03:48', '2026-01-21 18:03:48', NULL),
(299, 280, NULL, 396, NULL, 2, 'IQD', 'transfer', 'customer', 154500, 0.00, 0.00, NULL, '2026-01-21 18:03:48', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-21 18:03:48', '2026-01-21 18:03:48', NULL),
(300, 186, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 250000, 0.00, 0.00, NULL, '2026-01-21 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-21 18:26:35', '2026-01-21 18:26:35', NULL),
(301, 186, NULL, 217, NULL, 2, 'IQD', 'transfer', 'customer', 250000, 0.00, 0.00, NULL, '2026-01-21 18:26:35', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-21 18:26:35', '2026-01-21 18:26:35', NULL),
(302, 253, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 66750, 0.00, 0.00, NULL, '2026-01-22 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-22 12:23:03', '2026-01-22 12:23:03', NULL),
(303, 253, NULL, 287, NULL, 2, 'IQD', 'transfer', 'customer', 66750, 0.00, 0.00, NULL, '2026-01-22 12:23:03', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-22 12:23:03', '2026-01-22 12:23:03', NULL),
(304, 25, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 2730250, 0.00, 0.00, NULL, '2026-01-22 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-22 13:30:30', '2026-01-22 13:30:30', NULL),
(305, 25, NULL, 162, NULL, 2, 'IQD', 'transfer', 'customer', 2730250, 0.00, 0.00, NULL, '2026-01-22 08:58:22', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-22 13:30:30', '2026-01-22 13:58:22', '2026-01-22 13:58:22'),
(306, 25, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 391.8, 0.00, 0.00, NULL, '2026-01-22 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-22 13:31:29', '2026-01-22 13:31:29', NULL),
(307, 25, NULL, 43, NULL, 2, 'USD', 'transfer', 'customer', 391.8, 0.00, 0.00, NULL, '2026-01-22 08:58:16', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-22 13:31:29', '2026-01-22 13:58:16', '2026-01-22 13:58:16'),
(308, 22, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 1081.84, 0.00, 0.00, NULL, '2026-01-22 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-22 13:45:32', '2026-01-22 13:45:32', NULL),
(309, 22, NULL, 40, NULL, 2, 'USD', 'transfer', 'customer', 1081.84, 0.00, 0.00, NULL, '2026-01-22 13:45:32', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-22 13:45:32', '2026-01-22 13:45:32', NULL),
(310, 25, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 2730250, 0.00, 0.00, NULL, '2026-01-22 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-22 14:01:19', '2026-01-22 14:01:19', NULL),
(311, 25, NULL, 162, NULL, 2, 'IQD', 'transfer', 'customer', 2730250, 0.00, 0.00, NULL, '2026-01-22 14:01:19', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-22 14:01:19', '2026-01-22 14:01:19', NULL),
(312, 25, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 391.8, 0.00, 0.00, NULL, '2026-01-22 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-22 14:01:54', '2026-01-22 14:01:54', NULL),
(313, 25, NULL, 43, NULL, 2, 'USD', 'transfer', 'customer', 391.8, 0.00, 0.00, NULL, '2026-01-22 14:01:54', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-22 14:01:54', '2026-01-22 14:01:54', NULL),
(314, 34, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 620.08, 0.00, 0.00, NULL, '2026-01-22 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-22 17:02:38', '2026-01-22 17:02:38', NULL),
(315, 34, NULL, 52, NULL, 2, 'USD', 'transfer', 'customer', 620.08, 0.00, 0.00, NULL, '2026-01-22 17:02:38', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-22 17:02:38', '2026-01-22 17:02:38', NULL),
(316, 231, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 285750, 0.00, 0.00, NULL, '2026-01-22 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-22 17:03:21', '2026-01-22 17:03:21', NULL),
(317, 231, NULL, 473, NULL, 2, 'IQD', 'transfer', 'customer', 285750, 0.00, 0.00, NULL, '2026-01-22 17:03:21', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-22 17:03:21', '2026-01-22 17:03:21', NULL),
(323, 34, NULL, NULL, NULL, 1, 'IQD', 'cash', 'customer', 250, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 12:43:46', '2026-01-24 12:43:46', NULL),
(324, 34, NULL, 483, NULL, 1, 'IQD', 'transfer', 'customer', 250, 0.00, 0.00, NULL, '2026-01-24 12:43:46', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 12:43:46', '2026-01-24 12:43:46', NULL),
(325, 34, NULL, NULL, NULL, 3, 'IQD', 'cash', 'customer', 2546000, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 12:58:22', '2026-01-24 12:58:22', NULL),
(326, 34, NULL, 484, NULL, 3, 'IQD', 'transfer', 'customer', 2266000, 0.00, 0.00, NULL, '2026-01-24 12:58:22', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 12:58:22', '2026-01-24 12:58:22', NULL),
(327, 34, NULL, 483, NULL, 3, 'IQD', 'transfer', 'customer', 280000, 0.00, 0.00, NULL, '2026-01-24 12:58:22', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 12:58:22', '2026-01-24 12:58:22', NULL),
(328, 284, NULL, NULL, NULL, 3, 'USD', 'cash', 'customer', 254, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 12:59:24', '2026-01-24 12:59:24', NULL),
(329, 284, NULL, 414, NULL, 3, 'USD', 'transfer', 'customer', 254, 0.00, 0.00, NULL, '2026-01-24 12:59:24', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 12:59:24', '2026-01-24 12:59:24', NULL),
(330, 10, NULL, NULL, NULL, 3, 'IQD', 'cash', 'customer', 729000, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 13:15:41', '2026-01-24 13:15:41', NULL),
(331, 10, NULL, 14, NULL, 3, 'IQD', 'transfer', 'customer', 290375, 0.00, 0.00, NULL, '2026-01-24 13:15:41', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 13:15:41', '2026-01-24 13:15:41', NULL),
(332, 10, NULL, 279, NULL, 3, 'IQD', 'transfer', 'customer', 329000, 0.00, 0.00, NULL, '2026-01-24 13:15:41', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 13:15:41', '2026-01-24 13:15:41', NULL),
(333, 10, NULL, 332, NULL, 3, 'IQD', 'transfer', 'customer', 80000, 0.00, 0.00, NULL, '2026-01-24 13:15:41', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 13:15:41', '2026-01-24 13:15:41', NULL),
(334, 10, NULL, 441, NULL, 3, 'IQD', 'transfer', 'customer', 29625, 0.00, 0.00, NULL, '2026-01-24 13:15:41', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 13:15:41', '2026-01-24 13:15:41', NULL),
(335, 182, NULL, NULL, NULL, 3, 'IQD', 'cash', 'customer', 4757350, 0.00, 0.00, NULL, '2026-01-25 05:46:34', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 13:29:41', '2026-01-25 10:46:34', '2026-01-25 10:46:34'),
(336, 182, NULL, 316, NULL, 3, 'IQD', 'transfer', 'customer', 25000, 0.00, 0.00, NULL, '2026-01-25 05:46:34', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 13:29:41', '2026-01-25 10:46:34', '2026-01-25 10:46:34'),
(337, 182, NULL, 317, NULL, 3, 'IQD', 'transfer', 'customer', 176000, 0.00, 0.00, NULL, '2026-01-25 05:46:34', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 13:29:41', '2026-01-25 10:46:34', '2026-01-25 10:46:34'),
(338, 182, NULL, 320, NULL, 3, 'IQD', 'transfer', 'customer', 1000, 0.00, 0.00, NULL, '2026-01-25 05:46:34', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 13:29:41', '2026-01-25 10:46:34', '2026-01-25 10:46:34'),
(339, 182, NULL, 324, NULL, 3, 'IQD', 'transfer', 'customer', 412850, 0.00, 0.00, NULL, '2026-01-25 05:46:34', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 13:29:41', '2026-01-25 10:46:34', '2026-01-25 10:46:34'),
(340, 182, NULL, 326, NULL, 3, 'IQD', 'transfer', 'customer', 1035000, 0.00, 0.00, NULL, '2026-01-25 05:46:34', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 13:29:41', '2026-01-25 10:46:34', '2026-01-25 10:46:34'),
(341, 182, NULL, 347, NULL, 3, 'IQD', 'transfer', 'customer', 196000, 0.00, 0.00, NULL, '2026-01-25 05:46:34', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 13:29:41', '2026-01-25 10:46:34', '2026-01-25 10:46:34'),
(342, 182, NULL, 213, NULL, 3, 'IQD', 'transfer', 'customer', 1897500, 0.00, 0.00, NULL, '2026-01-25 05:46:34', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 13:29:41', '2026-01-25 10:46:34', '2026-01-25 10:46:34'),
(343, 182, NULL, 431, NULL, 3, 'IQD', 'transfer', 'customer', 34000, 0.00, 0.00, NULL, '2026-01-25 05:46:34', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 13:29:41', '2026-01-25 10:46:34', '2026-01-25 10:46:34'),
(344, 182, NULL, 432, NULL, 3, 'IQD', 'transfer', 'customer', 980000, 0.00, 0.00, NULL, '2026-01-25 05:46:34', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 13:29:42', '2026-01-25 10:46:34', '2026-01-25 10:46:34'),
(345, 34, NULL, NULL, NULL, 3, 'IQD', 'cash', 'customer', 2546000, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 15:02:34', '2026-01-24 15:02:34', NULL),
(346, 34, NULL, 52, NULL, 3, 'IQD', 'transfer', 'customer', 425, 0.00, 0.00, NULL, '2026-01-24 15:02:34', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 15:02:34', '2026-01-24 15:02:34', NULL),
(347, 34, NULL, 483, NULL, 3, 'IQD', 'transfer', 'customer', 425, 0.00, 0.00, NULL, '2026-01-24 15:02:34', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 15:02:34', '2026-01-24 15:02:34', NULL),
(348, 34, NULL, 490, NULL, 3, 'IQD', 'transfer', 'customer', 2545150, 0.00, 0.00, NULL, '2026-01-24 15:02:34', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 15:02:34', '2026-01-24 15:02:34', NULL),
(349, 34, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 2546000, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 15:17:24', '2026-01-24 15:17:24', NULL),
(350, 34, NULL, 490, NULL, 2, 'IQD', 'transfer', 'customer', 2546000, 0.00, 0.00, NULL, '2026-01-24 15:17:24', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 15:17:24', '2026-01-24 15:17:24', NULL),
(351, 279, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 51000, 0.00, 0.00, 'لةبري34 رةش 25 سوري', '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 15:50:34', '2026-01-24 15:50:34', NULL),
(352, 279, NULL, 386, NULL, 2, 'IQD', 'transfer', 'customer', 51000, 0.00, 0.00, 'لةبري34 رةش 25 سوري', '2026-01-24 15:50:34', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 15:50:34', '2026-01-24 15:50:34', NULL),
(353, 82, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 125000, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 16:05:38', '2026-01-24 16:05:38', NULL),
(354, 82, NULL, 112, NULL, 2, 'IQD', 'transfer', 'customer', 125000, 0.00, 0.00, NULL, '2026-01-24 16:05:38', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 16:05:38', '2026-01-24 16:05:38', NULL),
(355, 42, NULL, NULL, NULL, 3, 'IQD', 'cash', 'customer', 632000, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 17:36:50', '2026-01-24 17:36:50', NULL),
(356, 42, NULL, 107, NULL, 3, 'IQD', 'transfer', 'customer', 632000, 0.00, 0.00, NULL, '2026-01-24 17:36:50', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 17:36:50', '2026-01-24 17:36:50', NULL),
(357, 274, NULL, NULL, NULL, 3, 'IQD', 'cash', 'customer', 430000, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 17:37:48', '2026-01-24 17:37:48', NULL),
(358, 274, NULL, 354, NULL, 3, 'IQD', 'transfer', 'customer', 178250, 0.00, 0.00, NULL, '2026-01-24 17:37:48', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 17:37:48', '2026-01-24 17:37:48', NULL),
(359, 274, NULL, 349, NULL, 3, 'IQD', 'transfer', 'customer', 95000, 0.00, 0.00, NULL, '2026-01-24 17:37:48', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 17:37:48', '2026-01-24 17:37:48', NULL),
(360, 274, NULL, 467, NULL, 3, 'IQD', 'transfer', 'customer', 156750, 0.00, 0.00, NULL, '2026-01-24 17:37:48', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 17:37:48', '2026-01-24 17:37:48', NULL),
(361, 167, NULL, NULL, NULL, 3, 'IQD', 'cash', 'customer', 1000000, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 17:41:09', '2026-01-24 17:41:09', NULL),
(362, 167, NULL, 197, NULL, 3, 'IQD', 'transfer', 'customer', 1000000, 0.00, 0.00, NULL, '2026-01-24 17:41:09', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 17:41:09', '2026-01-24 17:41:09', NULL),
(363, 263, NULL, NULL, NULL, 3, 'IQD', 'cash', 'customer', 81000, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 17:50:04', '2026-01-24 17:50:04', NULL),
(364, 263, NULL, 437, NULL, 3, 'IQD', 'transfer', 'customer', 81000, 0.00, 0.00, NULL, '2026-01-24 17:50:04', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 17:50:04', '2026-01-24 17:50:04', NULL),
(365, 238, NULL, NULL, NULL, 3, 'IQD', 'cash', 'customer', 240000, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 18:17:13', '2026-01-24 18:17:13', NULL),
(366, 238, NULL, 271, NULL, 3, 'IQD', 'transfer', 'customer', 240000, 0.00, 0.00, NULL, '2026-01-24 18:17:13', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 18:17:13', '2026-01-24 18:17:13', NULL),
(367, 49, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 1160.05, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 18:30:16', '2026-01-24 18:30:16', NULL),
(368, 49, NULL, 74, NULL, 2, 'USD', 'transfer', 'customer', 1160.05, 0.00, 0.00, NULL, '2026-01-24 18:30:17', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 18:30:17', '2026-01-24 18:30:17', NULL),
(369, 177, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 945500, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 18:33:14', '2026-01-24 18:33:14', NULL),
(370, 177, NULL, 207, NULL, 2, 'IQD', 'transfer', 'customer', 945500, 0.00, 0.00, NULL, '2026-01-24 18:33:14', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 18:33:14', '2026-01-24 18:33:14', NULL),
(371, 34, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 1502250, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 18:36:30', '2026-01-24 18:36:30', NULL),
(372, 34, NULL, 490, NULL, 2, 'IQD', 'transfer', 'customer', 1502250, 0.00, 0.00, NULL, '2026-01-24 18:36:30', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 18:36:30', '2026-01-24 18:36:30', NULL),
(373, 274, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 1250, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 18:37:02', '2026-01-24 18:37:02', NULL),
(374, 274, NULL, 467, NULL, 2, 'IQD', 'transfer', 'customer', 1250, 0.00, 0.00, NULL, '2026-01-24 18:37:02', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 18:37:02', '2026-01-24 18:37:02', NULL),
(375, 248, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 230000, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 18:48:32', '2026-01-24 18:48:32', NULL),
(376, 248, NULL, 282, NULL, 2, 'IQD', 'transfer', 'customer', 230000, 0.00, 0.00, NULL, '2026-01-24 18:48:32', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 18:48:32', '2026-01-24 18:48:32', NULL),
(377, 267, NULL, NULL, NULL, 3, 'IQD', 'cash', 'customer', 1378250, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 19:04:55', '2026-01-24 19:04:55', NULL),
(378, 267, NULL, 319, NULL, 3, 'IQD', 'transfer', 'customer', 1017500, 0.00, 0.00, NULL, '2026-01-24 19:04:55', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 19:04:55', '2026-01-24 19:04:55', NULL),
(379, 267, NULL, 338, NULL, 3, 'IQD', 'transfer', 'customer', 360750, 0.00, 0.00, NULL, '2026-01-24 19:04:55', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 19:04:55', '2026-01-24 19:04:55', NULL),
(380, 267, NULL, NULL, NULL, 3, 'USD', 'cash', 'customer', 774, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 19:05:42', '2026-01-24 19:05:42', NULL),
(381, 267, NULL, 372, NULL, 3, 'USD', 'transfer', 'customer', 774, 0.00, 0.00, NULL, '2026-01-24 19:05:42', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 19:05:42', '2026-01-24 19:05:42', NULL),
(382, 246, NULL, NULL, NULL, 3, 'IQD', 'cash', 'customer', 471500, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 19:07:17', '2026-01-24 19:07:17', NULL),
(383, 246, NULL, 280, NULL, 3, 'IQD', 'transfer', 'customer', 404500, 0.00, 0.00, NULL, '2026-01-24 19:07:17', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 19:07:17', '2026-01-24 19:07:17', NULL),
(384, 246, NULL, 366, NULL, 3, 'IQD', 'transfer', 'customer', 67000, 0.00, 0.00, NULL, '2026-01-24 19:07:17', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 19:07:17', '2026-01-24 19:07:17', NULL),
(385, 218, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 903500, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 20:16:57', '2026-01-24 20:16:57', NULL),
(386, 218, NULL, 322, NULL, 2, 'IQD', 'transfer', 'customer', 221000, 0.00, 0.00, NULL, '2026-01-24 20:16:57', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 20:16:57', '2026-01-24 20:16:57', NULL),
(387, 218, NULL, 325, NULL, 2, 'IQD', 'transfer', 'customer', 158750, 0.00, 0.00, NULL, '2026-01-24 20:16:57', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 20:16:57', '2026-01-24 20:16:57', NULL),
(388, 218, NULL, 329, NULL, 2, 'IQD', 'transfer', 'customer', 158750, 0.00, 0.00, NULL, '2026-01-24 20:16:57', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 20:16:57', '2026-01-24 20:16:57', NULL),
(389, 218, NULL, 339, NULL, 2, 'IQD', 'transfer', 'customer', 253750, 0.00, 0.00, NULL, '2026-01-24 20:16:57', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 20:16:57', '2026-01-24 20:16:57', NULL),
(390, 218, NULL, 250, NULL, 2, 'IQD', 'transfer', 'customer', 111250, 0.00, 0.00, NULL, '2026-01-24 20:16:57', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 20:16:57', '2026-01-24 20:16:57', NULL),
(391, 218, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 1081, 0.00, 0.00, NULL, '2026-01-24 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 20:17:31', '2026-01-24 20:17:31', NULL),
(392, 218, NULL, 475, NULL, 2, 'USD', 'transfer', 'customer', 1081, 0.00, 0.00, NULL, '2026-01-24 20:17:31', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-24 20:17:31', '2026-01-24 20:17:31', NULL),
(393, 269, NULL, NULL, NULL, 3, 'IQD', 'cash', 'customer', 1195000, 0.00, 0.00, NULL, '2026-01-25 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-25 11:56:38', '2026-01-25 11:56:38', NULL),
(394, 269, NULL, 465, NULL, 3, 'IQD', 'transfer', 'customer', 65000, 0.00, 0.00, NULL, '2026-01-25 11:56:38', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-25 11:56:38', '2026-01-25 11:56:38', NULL),
(395, 269, NULL, 471, NULL, 3, 'IQD', 'transfer', 'customer', 5000, 0.00, 0.00, NULL, '2026-01-25 11:56:38', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-25 11:56:38', '2026-01-25 11:56:38', NULL),
(396, 269, NULL, 498, NULL, 3, 'IQD', 'transfer', 'customer', 900000, 0.00, 0.00, NULL, '2026-01-25 11:56:38', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-25 11:56:38', '2026-01-25 11:56:38', NULL),
(397, 269, NULL, 331, NULL, 3, 'IQD', 'transfer', 'customer', 115000, 0.00, 0.00, NULL, '2026-01-25 11:56:38', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-25 11:56:38', '2026-01-25 11:56:38', NULL),
(398, 269, NULL, 438, NULL, 3, 'IQD', 'transfer', 'customer', 110000, 0.00, 0.00, NULL, '2026-01-25 11:56:38', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-25 11:56:38', '2026-01-25 11:56:38', NULL),
(399, 211, NULL, NULL, NULL, 3, 'IQD', 'cash', 'customer', 335000, 0.00, 0.00, NULL, '2026-01-25 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-25 13:11:38', '2026-01-25 13:11:38', NULL),
(400, 211, NULL, 243, NULL, 3, 'IQD', 'transfer', 'customer', 335000, 0.00, 0.00, NULL, '2026-01-25 13:11:38', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-25 13:11:38', '2026-01-25 13:11:38', NULL),
(401, 21, NULL, NULL, NULL, 3, 'USD', 'cash', 'customer', 2125.76, 0.00, 0.00, NULL, '2026-01-25 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-25 15:33:26', '2026-01-25 15:33:26', NULL),
(402, 21, NULL, 38, NULL, 3, 'USD', 'transfer', 'customer', 2125.76, 0.00, 0.00, NULL, '2026-01-25 15:33:26', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-25 15:33:26', '2026-01-25 15:33:26', NULL),
(403, 221, NULL, NULL, NULL, 3, 'IQD', 'cash', 'customer', 274125, 0.00, 0.00, NULL, '2026-01-25 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-25 16:21:32', '2026-01-25 16:21:32', NULL),
(404, 221, NULL, 253, NULL, 3, 'IQD', 'transfer', 'customer', 263500, 0.00, 0.00, NULL, '2026-01-25 16:21:32', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-25 16:21:32', '2026-01-25 16:21:32', NULL),
(405, 221, NULL, 495, NULL, 3, 'IQD', 'transfer', 'customer', 10625, 0.00, 0.00, NULL, '2026-01-25 16:21:32', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-25 16:21:32', '2026-01-25 16:21:32', NULL),
(406, 40, NULL, NULL, NULL, 3, 'IQD', 'cash', 'customer', 816250, 0.00, 0.00, NULL, '2026-01-25 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-25 19:35:08', '2026-01-25 19:35:08', NULL),
(407, 40, NULL, 61, NULL, 3, 'IQD', 'transfer', 'customer', 806250, 0.00, 0.00, NULL, '2026-01-25 19:35:08', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-25 19:35:08', '2026-01-25 19:35:08', NULL),
(408, 40, NULL, 509, NULL, 3, 'IQD', 'transfer', 'customer', 10000, 0.00, 0.00, NULL, '2026-01-25 19:35:08', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-25 19:35:08', '2026-01-25 19:35:08', NULL),
(409, 292, NULL, 487, NULL, 3, 'IQD', 'transfer', 'customer', 35625, 0.00, 35625.00, '', '2026-01-26 11:37:54', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 11:37:54', '2026-01-26 11:37:54', NULL),
(410, 292, NULL, 491, NULL, 3, 'IQD', 'transfer', 'customer', 25000, 0.00, 25000.00, '', '2026-01-26 11:37:54', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 11:37:54', '2026-01-26 11:37:54', NULL),
(411, 292, NULL, NULL, NULL, 3, 'IQD', 'cash', 'customer', 60625, 0.00, 60625.00, '', '2026-01-26 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 11:37:54', '2026-01-26 11:37:54', NULL),
(412, 285, NULL, 417, NULL, 2, 'IQD', 'transfer', 'customer', 12000, 0.00, 12000.00, 'لبري 5قةلاقيم و1جةمةنتو', '2026-01-26 13:19:12', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 13:19:12', '2026-01-26 13:19:12', NULL),
(413, 285, NULL, 446, NULL, 2, 'IQD', 'transfer', 'customer', 85500, 0.00, 85500.00, 'لبري 5قةلاقيم و1جةمةنتو', '2026-01-26 13:19:12', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 13:19:12', '2026-01-26 13:19:12', NULL),
(414, 285, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 97500, 0.00, 97500.00, 'لبري 5قةلاقيم و1جةمةنتو', '2026-01-26 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 13:19:12', '2026-01-26 13:19:12', NULL),
(415, 295, NULL, 512, NULL, 2, 'USD', 'transfer', 'customer', 443, 0.00, 443.00, '', '2026-01-26 14:10:01', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:10:01', '2026-01-26 14:10:01', NULL),
(416, 295, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 443, 0.00, 443.00, '', '2026-01-26 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:10:01', '2026-01-26 14:10:01', NULL),
(417, 23, NULL, 41, NULL, 2, 'USD', 'transfer', 'customer', 654.95, 0.00, 654.95, '', '2026-01-26 14:13:56', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:13:56', '2026-01-26 14:13:56', NULL),
(418, 23, NULL, 513, NULL, 2, 'USD', 'transfer', 'customer', 192.5, 0.00, 192.50, '', '2026-01-26 14:13:56', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:13:56', '2026-01-26 14:13:56', NULL),
(419, 23, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 847.45, 0.00, 847.45, '', '2026-01-26 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:13:56', '2026-01-26 14:13:56', NULL),
(420, 182, NULL, 497, NULL, 2, 'IQD', 'transfer', 'customer', 372000, 0.00, 372000.00, '', '2026-01-26 14:16:44', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:16:44', '2026-01-26 14:16:44', NULL),
(421, 182, NULL, 510, NULL, 2, 'IQD', 'transfer', 'customer', 46000, 0.00, 46000.00, '', '2026-01-26 14:16:44', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:16:44', '2026-01-26 14:16:44', NULL),
(422, 182, NULL, 316, NULL, 2, 'IQD', 'transfer', 'customer', 25000, 0.00, 25000.00, '', '2026-01-26 14:16:44', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:16:44', '2026-01-26 14:16:44', NULL),
(423, 182, NULL, 317, NULL, 2, 'IQD', 'transfer', 'customer', 176000, 0.00, 176000.00, '', '2026-01-26 14:16:44', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:16:44', '2026-01-26 14:16:44', NULL),
(424, 182, NULL, 320, NULL, 2, 'IQD', 'transfer', 'customer', 1000, 0.00, 1000.00, '', '2026-01-26 14:16:44', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:16:44', '2026-01-26 14:16:44', NULL),
(425, 182, NULL, 324, NULL, 2, 'IQD', 'transfer', 'customer', 412850, 0.00, 412850.00, '', '2026-01-26 14:16:44', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:16:44', '2026-01-26 14:16:44', NULL),
(426, 182, NULL, 326, NULL, 2, 'IQD', 'transfer', 'customer', 1035000, 0.00, 1035000.00, '', '2026-01-26 14:16:44', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:16:44', '2026-01-26 14:16:44', NULL),
(427, 182, NULL, 347, NULL, 2, 'IQD', 'transfer', 'customer', 196000, 0.00, 196000.00, '', '2026-01-26 14:16:44', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:16:44', '2026-01-26 14:16:44', NULL),
(428, 182, NULL, 431, NULL, 2, 'IQD', 'transfer', 'customer', 34000, 0.00, 34000.00, '', '2026-01-26 14:16:44', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:16:44', '2026-01-26 14:16:44', NULL),
(429, 182, NULL, 432, NULL, 2, 'IQD', 'transfer', 'customer', 980000, 0.00, 980000.00, '', '2026-01-26 14:16:44', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:16:44', '2026-01-26 14:16:44', NULL),
(430, 182, NULL, 213, NULL, 2, 'IQD', 'transfer', 'customer', 1737150, 0.00, 1737150.00, '', '2026-01-26 14:16:44', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:16:44', '2026-01-26 14:16:44', NULL),
(431, 182, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 5015000, 0.00, 5015000.00, '', '2026-01-26 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:16:44', '2026-01-26 14:16:44', NULL),
(432, 236, NULL, 269, NULL, 2, 'IQD', 'transfer', 'customer', 425, 0.00, 425.00, ' (بەشی زیادە)', '2026-01-26 14:17:41', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:17:41', '2026-01-26 14:17:41', NULL),
(433, 236, NULL, 310, NULL, 2, 'IQD', 'transfer', 'customer', 425, 0.00, 425.00, ' (بەشی زیادە)', '2026-01-26 14:17:41', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:17:41', '2026-01-26 14:17:41', NULL),
(434, 236, NULL, NULL, NULL, 2, 'IQD', 'cash', 'customer', 9495000, 9494150.00, 850.00, ' (زیادەی پارە: 9,494,150.00 IQD)', '2026-01-26 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:17:41', '2026-01-26 14:17:41', NULL),
(435, 32, NULL, 50, NULL, 2, 'USD', 'transfer', 'customer', 1785.76, 0.00, 1785.76, ' (بەشی زیادە)', '2026-01-26 14:19:18', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:19:18', '2026-01-26 14:19:18', NULL),
(436, 32, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 4500, 2714.24, 1785.76, ' (زیادەی پارە: 2,714.24 USD)', '2026-01-26 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 14:19:18', '2026-01-26 14:19:18', NULL),
(437, 270, NULL, 348, NULL, 2, 'USD', 'transfer', 'customer', 0, 0.00, 0.00, '', '2026-01-26 15:34:20', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 15:34:20', '2026-01-26 15:34:20', NULL),
(438, 270, NULL, 526, NULL, 2, 'USD', 'transfer', 'customer', 2180, 0.00, 2180.00, '', '2026-01-26 15:34:20', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 15:34:20', '2026-01-26 15:34:20', NULL),
(439, 270, NULL, 459, NULL, 2, 'USD', 'transfer', 'customer', 316.04, 0.00, 316.04, '', '2026-01-26 15:34:20', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 15:34:20', '2026-01-26 15:34:20', NULL),
(440, 270, NULL, NULL, NULL, 2, 'USD', 'cash', 'customer', 2496.04, 0.00, 2496.04, '', '2026-01-26 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 15:34:20', '2026-01-26 15:34:20', NULL),
(441, 263, NULL, 493, NULL, 3, 'IQD', 'transfer', 'customer', 76500, 0.00, 76500.00, '', '2026-01-26 18:59:17', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 18:59:17', '2026-01-26 18:59:17', NULL),
(442, 263, NULL, NULL, NULL, 3, 'IQD', 'cash', 'customer', 76500, 0.00, 76500.00, '', '2026-01-26 05:00:00', NULL, NULL, NULL, NULL, NULL, 'completed', NULL, '2026-01-26 18:59:17', '2026-01-26 18:59:17', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `category_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `code` varchar(255) NOT NULL,
  `barcode` varchar(255) DEFAULT NULL,
  `unit_type` enum('piece','kg','meter','liter','box','carton','packet','bundle') NOT NULL DEFAULT 'piece',
  `unit_name` varchar(255) DEFAULT NULL,
  `purchase_price_iqd` float NOT NULL DEFAULT 0,
  `purchase_price_usd` float NOT NULL DEFAULT 0,
  `selling_price_iqd` float NOT NULL DEFAULT 0,
  `selling_price_usd` float NOT NULL DEFAULT 0,
  `quantity` float NOT NULL DEFAULT 0,
  `min_stock_level` float NOT NULL DEFAULT 20,
  `track_stock` tinyint(1) NOT NULL DEFAULT 1,
  `image` varchar(255) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `base_unit_id` bigint(20) UNSIGNED DEFAULT NULL,
  `purchase_unit_id` bigint(20) UNSIGNED DEFAULT NULL,
  `sale_unit_id` bigint(20) UNSIGNED DEFAULT NULL,
  `purchase_to_base_factor` float NOT NULL DEFAULT 1,
  `sale_to_base_factor` float NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`id`, `category_id`, `name`, `code`, `barcode`, `unit_type`, `unit_name`, `purchase_price_iqd`, `purchase_price_usd`, `selling_price_iqd`, `selling_price_usd`, `quantity`, `min_stock_level`, `track_stock`, `image`, `description`, `created_at`, `updated_at`, `base_unit_id`, `purchase_unit_id`, `sale_unit_id`, `purchase_to_base_factor`, `sale_to_base_factor`) VALUES
(2, 5, 'بلوكى 20*40', '1', 'BRC-65109586', 'piece', NULL, 0, 0, 425, 0, 90000000000, 1, 1, 'products/BlnPiw46jJdsA9XXk0UWfaoP4Bk0byMpmeCQOPOX.jpg', NULL, '2025-12-25 17:21:03', '2026-01-26 14:01:12', 1, 1, 1, 1, 1),
(3, 5, 'بلوك 10*40', '2', NULL, 'piece', NULL, 0, 0, 425, 0, 37014, 20, 1, 'products/4kJmobQoOYhqMkZGd72ojCyP5GJsdOw39OJ9x80B.jpg', NULL, '2025-12-25 17:23:13', '2026-01-25 15:04:33', 1, 1, 1, 1, 1),
(4, 5, 'بلوك 15*40', '3', NULL, 'piece', NULL, 0, 0, 425, 0, 39549, 20, 1, NULL, NULL, '2025-12-25 17:24:34', '2026-01-12 12:10:37', 1, 1, 1, 1, 1),
(5, 5, 'بلوك 17*40', '4', NULL, 'piece', NULL, 0, 0, 425, 0, 27015, 20, 1, 'products/d2T0C8bxrNBOWumUcVmBwM8Prtdodh8Sv2yEY0sq.jpg', NULL, '2025-12-25 17:27:49', '2026-01-26 14:16:12', 1, 1, 1, 1, 1),
(6, 1, 'جةمةنتوي ماس', '5', 'BRC-65857484', 'piece', NULL, 0, 0, 102000, 73, 6, 1, 1, 'products/boCU8AyAnpKRI0dN2I4Ymkv5gWzk5Kpc1Phkm5PL.png', NULL, '2025-12-25 17:32:41', '2026-01-25 15:05:54', 2, 2, 2, 1, 1),
(7, 1, 'جةمةنتوي opc', '6', NULL, 'piece', NULL, 0, 0, 98000, 69, 8999940, 900000000, 1, 'products/lznveGmXJ7NbCRPU9RJdw2IcZuKWlixcYyw3Zcft.png', NULL, '2025-12-25 17:35:27', '2026-01-25 15:08:49', 2, 2, 2, 1, 1),
(8, 1, 'جةمةنتوي كرستة', '7', NULL, 'piece', NULL, 0, 0, 95000, 66, 12000000, 20, 1, 'products/AkpNLRgIxJtlsc55vK1P1fJ1XHA1iSReQkELMdF1.png', NULL, '2025-12-25 17:41:53', '2026-01-26 13:46:56', 2, 2, 2, 1, 1),
(9, 1, 'جةمةنتوي دالتا  بة كيسة', '8', NULL, 'piece', NULL, 0, 0, 5000, 0, 900000000, 20, 1, 'products/rHnYanChtIHmp90pfW8tgtKebrby4Topv6jgbMYT.png', NULL, '2025-12-25 17:43:42', '2026-01-26 14:21:12', 1, 1, 1, 1, 1),
(10, 6, 'زاويةيي 3مليم', '9', NULL, 'piece', NULL, 0, 0, 4000, 0, 1950.2, 20, 1, 'products/WkFHso0Aiw4LP4LXnsDhKqVf9JECo7Nq1CSVpu8y.png', NULL, '2025-12-25 17:45:14', '2026-01-06 11:55:31', 4, 4, 4, 1, 1),
(11, 6, 'زاويةي 6مليم', '10', NULL, 'piece', NULL, 0, 0, 5750, 0, 1924.8, 20, 1, 'products/TItmDIqx8j8M3V2PNlH4o9ruB9XqMb6sJO4E6yzg.png', NULL, '2025-12-25 17:46:28', '2026-01-25 16:31:42', 4, 4, 4, 1, 1),
(12, 3, 'BRC15*15', '11', NULL, 'piece', NULL, 0, 0, 24500, 0, 101, 20, 1, 'products/3L5rB8a7hKeopEPgYSyKjTkJMjqCgZpW0ZEHPYBF.jpg', NULL, '2025-12-25 17:52:17', '2026-01-25 15:02:13', 1, 1, 1, 1, 1),
(13, 3, 'BRC20*20', '12', NULL, 'piece', NULL, 0, 0, 16000, 0, 130, 20, 1, 'products/W2cVdDHB4VQiBuB5fKA5EzXwUWrzmInk1tTfWEd6.jpg', NULL, '2025-12-25 17:53:34', '2025-12-25 17:53:34', 1, 1, 1, 1, 1),
(14, 10, 'بةردي ئاكري', '13', NULL, 'piece', NULL, 0, 0, 1250, 0, 400, 20, 1, 'products/OptrWd7YBXvdWUqOsjlncxxDNgRarrCWQWejlSCo.jpg', NULL, '2025-12-25 17:55:30', '2025-12-25 17:55:30', 1, 1, 1, 1, 1),
(15, 8, 'كةربووج', '14', NULL, 'piece', NULL, 370, 0, 450, 0, 2500, 20, 1, 'products/LjIiaiDILJzUDm1Ttpr8UaeAyS93eWY4W8xzF38c.jpg', NULL, '2025-12-25 17:56:45', '2025-12-25 17:56:45', 1, 1, 1, 1, 1),
(16, 7, 'كونجي 120', '15', NULL, 'piece', NULL, 32000, 0, 34000, 0, 17, 3, 1, 'products/zjTCISag6LoSEfhvwLY3A4MghFA5Y1qiJPJtHp7L.jpg', NULL, '2025-12-25 17:57:57', '2026-01-07 16:24:18', 1, 1, 1, 1, 1),
(17, 7, 'كونجي 90', '16', NULL, 'piece', NULL, 20000, 0, 22500, 0, 50000000, 10, 1, 'products/Tgm6hqeCNd9aUHyeHXTM0l7CVYpBpORMM8vtGgvb.jpg', NULL, '2025-12-25 17:59:41', '2026-01-25 15:01:19', 1, 1, 1, 1, 1),
(18, 9, 'لمی تەق تەق', '30', 'BRC-67681131', 'piece', NULL, 0, 0, 20000, 0, 90000000000, 20, 1, 'products/AzZDJpp7IG4W72E4eDsKWnxdO9zM5OtGtTJn5a5k.jpg', NULL, '2025-12-25 18:01:59', '2026-01-26 14:21:12', 4, 4, 4, 1, 1),
(19, 7, 'كونجي 75', '18', NULL, 'piece', NULL, 16000, 0, 18500, 0, 20, 5, 1, 'products/2vs8KVq0S9v3rIu9DndRlvI7DmQvrkFyndM209oN.jpg', NULL, '2025-12-25 18:02:14', '2025-12-25 20:01:31', 1, 1, 1, 1, 1),
(20, 9, 'لمی قەڵادزێ', '31', 'BRC-67748294', 'piece', NULL, 0, 0, 23000, 0, 78, 10, 1, 'products/ltMWpvx4NvNmFQtxLLwhSqXlYqVbuEZusiM74VbR.jpg', NULL, '2025-12-25 18:03:01', '2026-01-17 15:14:18', 4, 4, 4, 1, 1),
(33, 7, 'كونجي 40', '193', NULL, 'piece', NULL, 6500, 0, 8500, 0, 59975, 5, 1, 'products/gd4n7gydDEY0D6s5oAvnEKwMWEHh7EJdMGuBa7im.jpg', NULL, '2025-12-25 18:03:36', '2026-01-24 15:13:58', 1, 1, 1, 1, 1),
(34, 7, 'کونجی ٣٠', '3٤', NULL, 'piece', NULL, 0, 0, 7500, 0, 13, 5, 1, 'products/2QZDgNtSLYo03vsFyTQNezWnYxXSDfu1RuJJPmvS.jpg', NULL, '2025-12-25 19:49:34', '2026-01-01 18:01:21', 1, 1, 1, 1, 1),
(35, 14, 'چەو', '35', NULL, 'piece', NULL, 0, 0, 15000, 0, 87.75, 5, 1, 'products/OMy2TD0SeTCYwEZ81UG86KV91DbFXKff3actMkqj.png', NULL, '2025-12-25 19:55:14', '2026-01-07 18:29:02', 4, 4, 4, 1, 1),
(36, 4, 'بلوکی سوور', '36', NULL, 'piece', NULL, 0, 0, 1450, 0, 999847, 20, 1, 'products/SQ3baKxnBvKxTsdsqiupZVauDbvVSzj0T2QWq08s.png', NULL, '2025-12-25 19:58:06', '2025-12-26 13:31:57', 1, 1, 1, 1, 1),
(37, 4, 'بلوکی پۆنزا', '37', NULL, 'piece', NULL, 0, 0, 1250, 0, 800, 20, 1, 'products/2pLd9JNJ6M8TWzY6qZ9ogvml0otntI9M1T0Of6i1.png', NULL, '2025-12-25 19:59:31', '2026-01-08 10:01:16', 1, 1, 1, 1, 1),
(38, 15, 'کرێی بار', '38', NULL, 'piece', NULL, 0, 0, 10000, 0, 1000000000, 20, 1, 'products/izA7LdnNawxre7fNyDOdR8SuWUW916UGI2EMyRMc.jpg', NULL, '2025-12-25 20:08:25', '2026-01-26 13:46:56', 5, 5, 5, 1, 1),
(39, 15, 'کرێی عەمبار', '39', NULL, 'piece', NULL, 0, 0, 5000, 0, 1000000000, 20, 1, 'products/xgpwic621IvUTWW8HmGzmA9HHsvNneIQZDh1Lafq.jpg', NULL, '2025-12-25 20:10:46', '2026-01-26 13:46:56', 6, 6, 6, 1, 1),
(40, 2, 'شیشی سلێمانی', '40', NULL, 'piece', NULL, 0, 0, 0, 580, 7.74, 10, 1, 'products/F9tNOpBDuoSoeDOAMFmdayINuAqQVeDp2mcVU1qn.png', NULL, '2025-12-25 20:12:57', '2026-01-26 15:35:42', 2, 2, 2, 1, 1),
(41, 2, 'شیشی سعودی', '41', NULL, 'piece', NULL, 0, 0, 0, 595, 25.545, 10, 1, 'products/exKSwZKSq1fLvRr9FmAp5lVtpzPsZW75DwCLJyX4.png', NULL, '2025-12-25 20:14:09', '2026-01-26 15:35:42', 2, 2, 2, 1, 1),
(42, 2, 'شیشی ماس', '42', NULL, 'piece', NULL, 0, 0, 0, 710, 98.204, 10, 1, 'products/oV7ydC9ZFpFiQoo3SYRGRxjhaqeohCLk93HSBoUC.png', NULL, '2025-12-25 20:15:08', '2025-12-27 15:08:06', 2, 2, 2, 1, 1),
(43, 16, 'تێل', '43', NULL, 'piece', NULL, 0, 0, 0, 2, 600000000, 10, 1, 'products/u2g0JnEvXmrqf8HZypyizTp9llOK2KR1SaZxA7D7.jpg', NULL, '2025-12-25 20:39:01', '2026-01-26 14:07:30', 1, 1, 1, 1, 1),
(44, 2, 'قەفیز 30*30', '45', NULL, 'piece', NULL, 0, 0, 0, 0.55, 89999100, 1, 1, 'products/gbgqoDhB2QUtPf7je3KIe4bcJwPy0rVONqLN8veT.png', NULL, '2025-12-25 20:42:51', '2026-01-26 14:07:30', 1, 1, 1, 1, 1),
(45, 17, 'کورسی  ئاسن', '46', NULL, 'piece', NULL, 0, 0, 0.28, 0.28, 864, 20, 1, 'products/KIyg0x4dEgeTzQfDILqmY9whPee8ekxGby3WmNaf.png', NULL, '2025-12-25 20:45:25', '2025-12-27 16:33:18', 1, 1, 1, 1, 1),
(46, 17, 'کورسی چەمەنتۆ', '47', NULL, 'piece', NULL, 0, 0, 6, 6, 832, 20, 1, 'products/sQfohO8oLyeWrbatEPIGI7f7lZAKlixu6mEt4MOd.png', NULL, '2025-12-25 20:47:49', '2026-01-17 15:17:02', 1, 1, 1, 1, 1),
(47, 1, 'قةلاقيمي توركي 10*54', '100', NULL, 'piece', NULL, 0, 0, 18500, 0, 981, 20, 1, 'products/JS3uwYBLzxssACxwctZvki1FjyvJUfqqwp5zO4c1.jpg', NULL, '2025-12-26 11:52:16', '2025-12-26 13:44:16', 1, 1, 1, 1, 1),
(48, 15, 'كريي باري كريين', '101', NULL, 'piece', NULL, 0, 0, 45000, 0, 99969, 20, 1, 'products/zBg2Lw6E4uDtNkXH1qTOLw9T3NeFEOFiGXNtyuhx.jpg', NULL, '2025-12-26 11:53:37', '2026-01-26 13:43:16', 1, 1, 1, 1, 1),
(49, 9, 'لمي لبخ', '102', NULL, 'piece', NULL, 0, 0, 30000, 0, 18.5, 20, 1, 'products/FiV0FErmfsH9yThMys0sYtKbFctq8Mu8bHWdSZ2O.jpg', NULL, '2025-12-26 12:12:40', '2026-01-24 12:37:59', 1, 1, 1, 1, 1),
(50, 1, 'كةجي ئيراني', '104', NULL, 'piece', NULL, 0, 0, 4500, 0, 203, 20, 1, 'products/IWKN3TWIZxhwHMB23lEZEP6KxZ0uH1gF2BwMsLlZ.png', NULL, '2025-12-26 12:59:26', '2026-01-24 23:39:09', 1, 1, 1, 1, 1),
(51, 1, 'كةجيي مخمور', '105', NULL, 'piece', NULL, 0, 0, 3000, 0, 772, 20, 1, 'products/orgTSpmpqcoW7MSPzm0OIFrda11olulMtXVkRUNe.png', NULL, '2025-12-26 13:00:46', '2026-01-24 12:39:17', 1, 1, 1, 1, 1),
(52, 1, 'شةربةتي بجوك', '106', NULL, 'piece', NULL, 0, 0, 9000, 0, 193, 20, 1, 'products/ygIEEgHdxD9HWx2IkGOOkQADFbFjY6nHBZUJw7nq.jpg', NULL, '2025-12-26 13:38:15', '2026-01-24 15:13:58', 1, 1, 1, 1, 1),
(53, 9, 'لميي كةسارة', '107', NULL, 'piece', NULL, 0, 0, 15000, 0, 499936, 20, 1, 'products/d6Df8p6WErpF6M71iRrwoZG5r9dT7KUZRJiTw02z.jpg', NULL, '2025-12-26 13:46:55', '2026-01-26 13:46:08', 1, 1, 1, 1, 1),
(54, 8, 'حةمباري شيش', '108', NULL, 'piece', NULL, 0, 0, 0, 7, 899999000, 20, 1, 'products/rOctEj5r0g3k7akRVa5hAed2i3DDvqxnIpsTzTTk.jpg', NULL, '2025-12-26 16:19:55', '2026-01-26 14:07:30', 1, 1, 1, 1, 1),
(55, 7, 'كواستنةوة و قةبان كردن', '109', NULL, 'piece', NULL, 0, 0, 0, 16, 9000000000, 20, 1, 'products/Wjxrw2SdLy0ZJa8c5ZlfDiWw408WWFei5wJJJiyf.png', NULL, '2025-12-26 16:21:19', '2026-01-26 14:07:30', 1, 1, 1, 1, 1),
(56, 2, 'كةفةر', '110', NULL, 'piece', NULL, 0, 0, 0, 9, 9999980, 20, 1, 'products/nl8wrvvHBaWEjX5t3xhEK3JYWOBYQeP6z7VoNwLS.png', NULL, '2025-12-27 13:37:13', '2026-01-17 15:17:02', 1, 1, 1, 1, 1),
(57, 1, 'جةمةنتوي ماس بة دولار', '130', NULL, 'piece', NULL, 0, 0, 0, 74, 8999990, 20, 1, NULL, NULL, '2026-01-06 10:22:07', '2026-01-06 10:24:19', 2, 2, 2, 1, 1),
(58, 1, 'قةلاقيم 10 54', '121', NULL, 'piece', NULL, 0, 0, 18500, 0, 89975, 20, 1, NULL, NULL, '2026-01-06 10:38:00', '2026-01-18 11:32:01', 1, 1, 1, 1, 1),
(59, 9, 'جةوي بةرد', '124', NULL, 'piece', NULL, 0, 0, 10000, 0, 8999990, 20, 1, NULL, NULL, '2026-01-06 12:08:05', '2026-01-26 13:21:12', 4, 4, 4, 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `purchases`
--

CREATE TABLE `purchases` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `supplier_id` bigint(20) UNSIGNED DEFAULT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `invoice_number` varchar(255) NOT NULL,
  `purchase_type` enum('cash','credit') NOT NULL,
  `currency` enum('IQD','USD') NOT NULL,
  `payment_method` enum('cash','pos','transfer') DEFAULT NULL,
  `total_amount` float NOT NULL,
  `paid_amount` float NOT NULL DEFAULT 0,
  `remaining_amount` float NOT NULL DEFAULT 0,
  `notes` text DEFAULT NULL,
  `purchase_date` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `purchases`
--

INSERT INTO `purchases` (`id`, `supplier_id`, `user_id`, `invoice_number`, `purchase_type`, `currency`, `payment_method`, `total_amount`, `paid_amount`, `remaining_amount`, `notes`, `purchase_date`, `created_at`, `updated_at`) VALUES
(1, 1, 2, 'PUR-000001', 'credit', 'IQD', NULL, 0, 0, 0, NULL, '2026-01-04 05:00:00', '2026-01-04 18:17:46', '2026-01-04 18:17:46');

-- --------------------------------------------------------

--
-- Table structure for table `purchase_items`
--

CREATE TABLE `purchase_items` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `purchase_id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `quantity` float NOT NULL,
  `unit_price` float NOT NULL,
  `selling_price` float NOT NULL,
  `total_price` float NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `purchase_items`
--

INSERT INTO `purchase_items` (`id`, `purchase_id`, `product_id`, `quantity`, `unit_price`, `selling_price`, `total_price`, `created_at`, `updated_at`) VALUES
(1, 1, 35, 6, 0, 15000, 0, '2026-01-04 18:17:46', '2026-01-04 18:17:46');

-- --------------------------------------------------------

--
-- Table structure for table `sales`
--

CREATE TABLE `sales` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `customer_id` bigint(20) UNSIGNED DEFAULT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `invoice_number` varchar(255) NOT NULL,
  `sale_type` enum('cash','credit') NOT NULL,
  `currency` enum('IQD','USD') NOT NULL,
  `payment_method` enum('cash','pos') DEFAULT NULL,
  `total_amount` float NOT NULL,
  `paid_amount` float NOT NULL DEFAULT 0,
  `remaining_amount` float NOT NULL DEFAULT 0,
  `notes` text DEFAULT NULL,
  `sale_date` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `sales`
--

INSERT INTO `sales` (`id`, `customer_id`, `user_id`, `invoice_number`, `sale_type`, `currency`, `payment_method`, `total_amount`, `paid_amount`, `remaining_amount`, `notes`, `sale_date`, `created_at`, `updated_at`) VALUES
(2, 3, 2, 'SAL-000001', 'cash', 'IQD', NULL, 476000, 476000, 0, NULL, '2025-12-31 08:54:44', '2025-12-26 11:23:50', '2025-12-31 13:54:44'),
(3, 3, 2, 'SAL-000002', 'cash', 'IQD', NULL, 180000, 180000, 0, NULL, '2025-12-31 08:54:44', '2025-12-26 11:28:01', '2025-12-31 13:54:44'),
(4, 3, 2, 'SAL-000003', 'cash', 'IQD', NULL, 45000, 45000, 0, NULL, '2025-12-31 08:54:44', '2025-12-26 11:34:18', '2025-12-31 13:54:44'),
(5, 4, 2, 'SAL-000004', 'cash', 'IQD', NULL, 78000, 78000, 0, NULL, '2026-01-19 12:07:55', '2025-12-26 11:55:16', '2026-01-19 17:07:55'),
(6, 4, 2, 'SAL-000005', 'cash', 'IQD', NULL, 994500, 994500, 0, NULL, '2026-01-19 12:07:55', '2025-12-26 12:11:28', '2026-01-19 17:07:55'),
(7, 4, 2, 'SAL-000006', 'cash', 'IQD', NULL, 75000, 75000, 0, NULL, '2026-01-19 12:07:55', '2025-12-26 12:13:44', '2026-01-19 17:07:55'),
(8, 4, 2, 'SAL-000007', 'cash', 'IQD', NULL, 59500, 59500, 0, NULL, '2026-01-19 12:07:55', '2025-12-26 12:16:32', '2026-01-19 17:07:55'),
(9, 5, 2, 'SAL-000008', 'credit', 'IQD', NULL, 99250, 0, 99250, NULL, '2025-12-26 05:00:00', '2025-12-26 13:04:12', '2025-12-26 13:04:12'),
(10, 6, 2, 'SAL-000009', 'cash', 'IQD', NULL, 235850, 235850, 0.015625, NULL, '2026-01-05 11:57:36', '2025-12-26 13:31:57', '2026-01-05 16:57:36'),
(11, 7, 2, 'SAL-000010', 'credit', 'IQD', NULL, 9000, 0, 9000, NULL, '2025-12-26 05:00:00', '2025-12-26 13:38:37', '2025-12-26 13:38:37'),
(12, 8, 2, 'SAL-000011', 'credit', 'IQD', NULL, 253500, 0, 253500, NULL, '2025-12-26 05:00:00', '2025-12-26 13:44:16', '2025-12-26 13:44:16'),
(13, NULL, 2, 'SAL-000012', 'credit', 'IQD', NULL, 510000, 0, 510000, NULL, '2025-12-26 05:00:00', '2025-12-26 13:48:47', '2025-12-26 13:48:47'),
(14, 10, 2, 'SAL-000013', 'cash', 'IQD', NULL, 290375, 290375, 0, NULL, '2026-01-24 08:15:41', '2025-12-26 13:53:50', '2026-01-24 13:15:41'),
(15, 11, 2, 'SAL-000014', 'credit', 'IQD', NULL, 424750, 0, 424750, NULL, '2025-12-26 05:00:00', '2025-12-26 15:25:44', '2025-12-26 15:25:44'),
(16, 11, 2, 'SAL-000015', 'credit', 'IQD', NULL, 318750, 0, 318750, NULL, '2025-12-26 05:00:00', '2025-12-26 15:57:19', '2025-12-26 15:57:19'),
(17, 17, 2, 'SAL-000016', 'credit', 'USD', NULL, 1034.58, 1033.98, 0.603984, NULL, '2026-01-01 08:11:08', '2025-12-26 16:23:01', '2026-01-01 13:11:08'),
(18, 18, 2, 'SAL-000017', 'cash', 'USD', NULL, 760.828, 760.83, -0.00199707, NULL, '2026-01-10 08:32:24', '2025-12-26 16:32:52', '2026-01-10 13:32:24'),
(36, 19, 2, 'SAL-000018', 'credit', 'USD', NULL, 1431.25, 400, 1031.25, NULL, '2025-12-27 08:24:06', '2025-12-27 13:01:47', '2025-12-27 13:24:06'),
(37, 20, 2, 'SAL-000019', 'cash', 'USD', NULL, 6319.85, 6319.85, 0.0000976563, NULL, '2026-01-20 12:46:40', '2025-12-27 13:15:31', '2026-01-20 17:46:40'),
(38, 21, 2, 'SAL-000020', 'cash', 'USD', NULL, 2125.76, 2125.76, -0.00194336, 'بة دوو جار بوي جووة و جاريكيان 2694 و جاريكيتر 740 كيلو', '2026-01-25 10:33:26', '2025-12-27 13:40:29', '2026-01-25 15:33:26'),
(39, 21, 2, 'SAL-000021', 'credit', 'IQD', NULL, 425, 0, 425, '2320 واسل كردووة بة دةستي كاك عمر ئي 4تةن شيشي سليماني', '2025-12-27 05:00:00', '2025-12-27 14:50:39', '2025-12-27 14:50:39'),
(40, 22, 2, 'SAL-000022', 'cash', 'USD', NULL, 1081.84, 1081.84, -0.00394043, 'ئةو شيشة بة دوو جار رويشتية جاريكيان 1003 كيلو وئةوةيتريشي 2وة 580 قةفيزيشة 25كيلو بووة', '2026-01-22 08:45:32', '2025-12-27 14:57:24', '2026-01-22 13:45:32'),
(41, 23, 2, 'SAL-000023', 'cash', 'USD', NULL, 654.95, 654.95, 0.000012207, NULL, '2026-01-26 09:13:56', '2025-12-27 15:02:42', '2026-01-26 14:13:56'),
(42, 24, 2, 'SAL-000024', 'credit', 'USD', NULL, 1363.93, 0, 1363.93, NULL, '2025-12-27 05:00:00', '2025-12-27 15:08:06', '2025-12-27 15:08:06'),
(43, 25, 2, 'SAL-000025', 'cash', 'USD', NULL, 391.8, 391.8, -0.000012207, NULL, '2026-01-22 09:01:54', '2025-12-27 15:14:31', '2026-01-22 14:01:54'),
(44, 27, 2, 'SAL-000026', 'cash', 'USD', NULL, 1276.78, 1276.78, -0.00399902, NULL, '2026-01-03 09:05:38', '2025-12-27 15:57:14', '2026-01-03 14:05:38'),
(45, 28, 2, 'SAL-000027', 'credit', 'IQD', NULL, 792000, 0, 792000, NULL, '2025-12-27 05:00:00', '2025-12-27 16:15:20', '2025-12-27 16:15:20'),
(46, 29, 2, 'SAL-000028', 'credit', 'IQD', NULL, 298500, 0, 298500, NULL, '2025-12-27 05:00:00', '2025-12-27 16:22:26', '2025-12-27 16:22:26'),
(47, 30, 2, 'SAL-000029', 'credit', 'USD', NULL, 1928.02, 1928, 0.0240479, NULL, '2026-01-01 15:29:48', '2025-12-27 16:25:51', '2026-01-01 20:29:48'),
(48, 31, 2, 'SAL-000030', 'credit', 'USD', NULL, 1518.6, 0, 1518.6, NULL, '2025-12-27 05:00:00', '2025-12-27 16:33:18', '2025-12-27 16:33:18'),
(49, 31, 2, 'SAL-000031', 'credit', 'IQD', NULL, 50000, 0, 50000, NULL, '2025-12-27 05:00:00', '2025-12-27 16:34:02', '2025-12-27 16:34:02'),
(50, 32, 2, 'SAL-000032', 'cash', 'USD', NULL, 1785.76, 1785.76, 0.00000976562, '45وةرةقة واسلكراوة بةدةستي محمد', '2026-01-26 09:19:18', '2025-12-27 16:38:27', '2026-01-26 14:19:18'),
(51, 33, 2, 'SAL-000033', 'cash', 'USD', NULL, 3002.62, 3002.62, 0.000117187, NULL, '2026-01-20 07:05:53', '2025-12-27 16:50:20', '2026-01-20 12:05:53'),
(52, 34, 2, 'SAL-000034', 'cash', 'IQD', NULL, 425, 425, 0, NULL, '2026-01-24 10:02:34', '2025-12-27 16:52:56', '2026-01-24 15:02:34'),
(53, 35, 2, 'SAL-000035', 'credit', 'USD', NULL, 2872.05, 1342, 1530.05, NULL, '2026-01-04 09:56:42', '2025-12-27 16:58:31', '2026-01-04 14:56:42'),
(54, 36, 2, 'SAL-000036', 'credit', 'USD', NULL, 2081.8, 0, 2081.8, NULL, '2025-12-27 05:00:00', '2025-12-27 17:41:07', '2025-12-27 17:41:07'),
(55, 19, 2, 'SAL-000037', 'credit', 'IQD', NULL, 274000, 0, 274000, NULL, '2025-12-27 05:00:00', '2025-12-27 17:53:10', '2025-12-27 17:53:10'),
(56, 37, 2, 'SAL-000038', 'cash', 'USD', NULL, 1318, 1318, 0, NULL, '2026-01-06 06:10:20', '2025-12-27 17:58:21', '2026-01-06 11:10:20'),
(57, 38, 2, 'SAL-000039', 'credit', 'IQD', NULL, 3859850, 0, 3859850, NULL, '2025-12-27 05:00:00', '2025-12-27 18:03:58', '2025-12-27 18:03:58'),
(58, 39, 2, 'SAL-000040', 'cash', 'IQD', NULL, 170000, 170000, 0, NULL, '2026-01-12 06:30:41', '2025-12-27 18:08:34', '2026-01-12 11:30:41'),
(59, 18, 2, 'SAL-000041', 'cash', 'IQD', NULL, 170000, 170000, 0, NULL, '2026-01-10 08:31:42', '2025-12-27 18:10:16', '2026-01-10 13:31:42'),
(60, 18, 2, 'SAL-000042', 'cash', 'IQD', NULL, 56750, 56750, 0, NULL, '2026-01-10 08:31:42', '2025-12-27 18:11:27', '2026-01-10 13:31:42'),
(61, 40, 2, 'SAL-000043', 'cash', 'IQD', NULL, 806250, 806250, 0, NULL, '2026-01-25 14:35:08', '2025-12-27 18:14:30', '2026-01-25 19:35:08'),
(62, 4, 2, 'SAL-000044', 'cash', 'IQD', NULL, 89500, 89500, 0, NULL, '2026-01-19 12:07:55', '2025-12-27 18:15:59', '2026-01-19 17:07:55'),
(63, 4, 2, 'SAL-000045', 'cash', 'IQD', NULL, 18000, 18000, 0, NULL, '2026-01-19 12:07:55', '2025-12-27 18:16:43', '2026-01-19 17:07:55'),
(64, 41, 2, 'SAL-000046', 'credit', 'IQD', NULL, 801375, 0, 801375, NULL, '2025-12-27 05:00:00', '2025-12-27 18:20:22', '2025-12-27 18:20:22'),
(65, 18, 2, 'SAL-000047', 'cash', 'IQD', NULL, 85000, 85000, 0, NULL, '2026-01-10 08:31:42', '2025-12-27 18:21:39', '2026-01-10 13:31:42'),
(66, 42, 2, 'SAL-000048', 'credit', 'USD', NULL, 1550.72, 1550, 0.719971, NULL, '2026-01-20 11:46:50', '2025-12-28 10:23:22', '2026-01-20 16:46:50'),
(67, 43, 2, 'SAL-000049', 'credit', 'IQD', NULL, 1384000, 0, 1384000, NULL, '2025-12-28 05:00:00', '2025-12-28 10:27:44', '2025-12-28 10:27:44'),
(68, 43, 2, 'SAL-000050', 'credit', 'USD', NULL, 1258, 0, 1258, NULL, '2025-12-28 05:00:00', '2025-12-28 10:29:58', '2025-12-28 10:29:58'),
(69, 44, 2, 'SAL-000051', 'credit', 'USD', NULL, 1942, 0, 1942, NULL, '2025-12-28 05:00:00', '2025-12-28 10:36:21', '2025-12-28 10:36:21'),
(70, 45, 2, 'SAL-000052', 'credit', 'USD', NULL, 1451.9, 1451, 0.900024, NULL, '2026-01-07 08:24:03', '2025-12-28 10:43:52', '2026-01-07 13:24:03'),
(71, 46, 2, 'SAL-000053', 'credit', 'USD', NULL, 400, 0, 400, NULL, '2025-12-28 05:00:00', '2025-12-28 10:47:14', '2025-12-28 10:47:14'),
(72, 47, 2, 'SAL-000054', 'credit', 'USD', NULL, 1457, 553, 904, NULL, '2026-01-01 13:09:10', '2025-12-28 10:50:08', '2026-01-01 18:09:10'),
(73, 48, 2, 'SAL-000055', 'credit', 'USD', NULL, 594.2, 594, 0.200012, NULL, '2025-12-29 07:13:38', '2025-12-28 10:52:27', '2025-12-29 12:13:38'),
(74, 49, 2, 'SAL-000056', 'cash', 'USD', NULL, 1160.05, 1160.05, -0.00300293, '15 وةرةقةي داوة بة دوةستي كاك عمر', '2026-01-24 13:30:17', '2025-12-28 10:57:49', '2026-01-24 18:30:17'),
(75, 50, 2, 'SAL-000057', 'credit', 'USD', NULL, 997.6, 0, 997.6, NULL, '2025-12-28 05:00:00', '2025-12-28 11:11:09', '2025-12-28 11:11:09'),
(76, 50, 2, 'SAL-000058', 'credit', 'IQD', NULL, 518500, 0, 518500, NULL, '2025-12-28 05:00:00', '2025-12-28 11:15:58', '2025-12-28 11:15:58'),
(77, 51, 2, 'SAL-000059', 'credit', 'USD', NULL, 2492, 0, 2492, NULL, '2025-12-28 05:00:00', '2025-12-28 11:21:30', '2025-12-28 11:21:30'),
(78, 52, 2, 'SAL-000060', 'cash', 'IQD', NULL, 159000, 159000, 0, NULL, '2026-01-20 06:42:39', '2025-12-28 11:44:03', '2026-01-20 11:42:39'),
(79, 53, 2, 'SAL-000061', 'credit', 'IQD', NULL, 262500, 0, 262500, NULL, '2025-12-28 05:00:00', '2025-12-28 11:46:25', '2025-12-28 11:46:25'),
(80, 54, 2, 'SAL-000062', 'credit', 'IQD', NULL, 673000, 0, 673000, NULL, '2025-12-28 05:00:00', '2025-12-28 11:47:52', '2025-12-28 11:47:52'),
(81, 55, 2, 'SAL-000063', 'credit', 'IQD', NULL, 3389500, 0, 3389500, NULL, '2025-12-28 05:00:00', '2025-12-28 11:49:53', '2025-12-28 11:49:53'),
(82, 56, 2, 'SAL-000064', 'credit', 'IQD', NULL, 3690500, 690000, 3000500, NULL, '2025-12-31 08:12:22', '2025-12-28 11:51:46', '2025-12-31 13:12:22'),
(83, 24, 2, 'SAL-000065', 'credit', 'IQD', NULL, 302500, 0, 302500, NULL, '2025-12-28 05:00:00', '2025-12-28 11:52:38', '2025-12-28 11:52:38'),
(84, 57, 2, 'SAL-000066', 'credit', 'IQD', NULL, 3813000, 24000, 3789000, NULL, '2026-01-06 08:16:11', '2025-12-28 12:03:50', '2026-01-06 13:16:11'),
(85, 57, 2, 'SAL-000067', 'cash', 'USD', NULL, 2397.66, 2397.66, -0.0000878906, NULL, '2026-01-19 11:50:48', '2025-12-28 12:07:24', '2026-01-19 16:50:48'),
(86, 58, 2, 'SAL-000068', 'credit', 'IQD', NULL, 1026000, 0, 1026000, NULL, '2025-12-28 05:00:00', '2025-12-28 12:10:32', '2025-12-28 12:10:32'),
(87, 59, 2, 'SAL-000069', 'credit', 'IQD', NULL, 183000, 0, 183000, NULL, '2025-12-28 05:00:00', '2025-12-28 12:13:07', '2025-12-28 12:13:07'),
(88, 60, 2, 'SAL-000070', 'credit', 'IQD', NULL, 313000, 0, 313000, NULL, '2025-12-28 05:00:00', '2025-12-28 12:14:43', '2025-12-28 12:14:43'),
(89, 61, 2, 'SAL-000071', 'credit', 'IQD', NULL, 1114000, 0, 1114000, NULL, '2025-12-28 05:00:00', '2025-12-28 12:16:27', '2025-12-28 12:16:27'),
(90, 62, 2, 'SAL-000072', 'credit', 'IQD', NULL, 1089000, 0, 1089000, NULL, '2025-12-28 05:00:00', '2025-12-28 12:31:30', '2025-12-28 12:31:30'),
(91, 63, 2, 'SAL-000073', 'credit', 'IQD', NULL, 226000, 0, 226000, NULL, '2025-12-28 05:00:00', '2025-12-28 12:33:35', '2025-12-28 12:33:35'),
(92, 23, 2, 'SAL-000074', 'credit', 'IQD', NULL, 548750, 548750, 0.01, NULL, '2025-12-28 08:25:19', '2025-12-28 12:36:55', '2025-12-28 13:25:19'),
(93, 65, 2, 'SAL-000075', 'credit', 'IQD', NULL, 497500, 317000, 180500, NULL, '2026-01-21 12:59:43', '2025-12-28 12:38:14', '2026-01-21 17:59:43'),
(94, 66, 2, 'SAL-000076', 'credit', 'IQD', NULL, 1174500, 0, 1174500, NULL, '2025-12-28 05:00:00', '2025-12-28 12:39:37', '2025-12-28 12:39:37'),
(95, 67, 2, 'SAL-000077', 'credit', 'IQD', NULL, 2423000, 1000000, 1423000, NULL, '2025-12-28 11:21:07', '2025-12-28 12:41:00', '2025-12-28 16:21:07'),
(96, 68, 2, 'SAL-000078', 'credit', 'IQD', NULL, 108750, 0, 108750, NULL, '2025-12-28 05:00:00', '2025-12-28 12:42:10', '2025-12-28 12:42:10'),
(97, 69, 2, 'SAL-000079', 'credit', 'IQD', NULL, 377750, 200000, 177750, NULL, '2026-01-08 07:21:03', '2025-12-28 12:46:28', '2026-01-08 12:21:03'),
(98, 70, 2, 'SAL-000080', 'credit', 'IQD', NULL, 362500, 150000, 212500, NULL, '2026-01-04 12:33:54', '2025-12-28 12:48:16', '2026-01-04 17:33:54'),
(99, 71, 2, 'SAL-000081', 'credit', 'IQD', NULL, 318750, 0, 318750, NULL, '2025-12-28 05:00:00', '2025-12-28 12:49:28', '2025-12-28 12:49:28'),
(100, 72, 2, 'SAL-000082', 'credit', 'IQD', NULL, 137000, 0, 137000, NULL, '2025-12-28 05:00:00', '2025-12-28 12:51:12', '2025-12-28 12:51:12'),
(101, 73, 2, 'SAL-000083', 'credit', 'IQD', NULL, 50000, 0, 50000, NULL, '2025-12-28 05:00:00', '2025-12-28 12:52:11', '2025-12-28 12:52:11'),
(102, 74, 2, 'SAL-000084', 'credit', 'IQD', NULL, 234000, 0, 234000, NULL, '2025-12-28 05:00:00', '2025-12-28 12:54:01', '2025-12-28 12:54:01'),
(103, 75, 2, 'SAL-000085', 'cash', 'IQD', NULL, 125000, 125000, 0, NULL, '2026-01-04 10:03:36', '2025-12-28 12:55:19', '2026-01-04 15:03:36'),
(104, 76, 2, 'SAL-000086', 'credit', 'IQD', NULL, 336500, 0, 336500, NULL, '2025-12-28 05:00:00', '2025-12-28 12:56:29', '2025-12-28 12:56:29'),
(105, 77, 2, 'SAL-000087', 'credit', 'IQD', NULL, 148750, 0, 148750, NULL, '2025-12-28 05:00:00', '2025-12-28 12:58:58', '2025-12-28 12:58:58'),
(106, 17, 2, 'SAL-000088', 'cash', 'IQD', NULL, 511250, 511250, 0, NULL, '2026-01-01 08:11:32', '2025-12-28 12:59:48', '2026-01-01 13:11:32'),
(107, 42, 2, 'SAL-000089', 'cash', 'IQD', NULL, 1740000, 1740000, 0, NULL, '2026-01-24 12:36:50', '2025-12-28 13:01:19', '2026-01-24 17:36:50'),
(108, 78, 2, 'SAL-000090', 'credit', 'IQD', NULL, 94000, 0, 94000, NULL, '2025-12-28 05:00:00', '2025-12-28 13:02:31', '2025-12-28 13:02:31'),
(109, 79, 2, 'SAL-000091', 'credit', 'IQD', NULL, 230250, 0, 230250, NULL, '2025-12-28 05:00:00', '2025-12-28 13:03:50', '2025-12-28 13:03:50'),
(110, 80, 2, 'SAL-000092', 'credit', 'IQD', NULL, 625000, 0, 625000, NULL, '2025-12-28 05:00:00', '2025-12-28 13:05:19', '2025-12-28 13:05:19'),
(111, 81, 2, 'SAL-000093', 'credit', 'IQD', NULL, 101000, 0, 101000, NULL, '2025-12-28 05:00:00', '2025-12-28 13:07:14', '2025-12-28 13:07:14'),
(112, 82, 2, 'SAL-000094', 'cash', 'IQD', NULL, 125000, 125000, 0, NULL, '2026-01-24 11:05:38', '2025-12-28 13:08:31', '2026-01-24 16:05:38'),
(113, 83, 2, 'SAL-000095', 'credit', 'IQD', NULL, 56000, 0, 56000, NULL, '2025-12-28 05:00:00', '2025-12-28 13:09:45', '2025-12-28 13:09:45'),
(114, 84, 2, 'SAL-000096', 'credit', 'IQD', NULL, 366750, 0, 366750, NULL, '2025-12-28 05:00:00', '2025-12-28 13:10:50', '2025-12-28 13:10:50'),
(115, 85, 2, 'SAL-000097', 'credit', 'IQD', NULL, 650000, 0, 650000, NULL, '2025-12-28 05:00:00', '2025-12-28 13:12:48', '2025-12-28 13:12:48'),
(116, 86, 2, 'SAL-000098', 'credit', 'IQD', NULL, 173500, 0, 173500, NULL, '2025-12-28 05:00:00', '2025-12-28 13:14:11', '2025-12-28 13:14:11'),
(117, 87, 2, 'SAL-000099', 'cash', 'IQD', NULL, 129250, 129250, 0, NULL, '2026-01-19 12:10:26', '2025-12-28 13:17:09', '2026-01-19 17:10:26'),
(118, 88, 2, 'SAL-000100', 'credit', 'IQD', NULL, 75000, 0, 75000, NULL, '2025-12-28 05:00:00', '2025-12-28 13:21:45', '2025-12-28 13:21:45'),
(119, 89, 2, 'SAL-000101', 'cash', 'IQD', NULL, 4543750, 4543750, 0, NULL, '2026-01-01 13:05:03', '2025-12-28 13:28:03', '2026-01-01 18:05:03'),
(120, 91, 2, 'SAL-000102', 'credit', 'IQD', NULL, 30250, 0, 30250, NULL, '2025-12-28 05:00:00', '2025-12-28 13:30:09', '2025-12-28 13:30:09'),
(121, 92, 2, 'SAL-000103', 'credit', 'IQD', NULL, 157000, 0, 157000, NULL, '2025-12-28 05:00:00', '2025-12-28 13:31:23', '2025-12-28 13:31:23'),
(122, 93, 2, 'SAL-000104', 'credit', 'IQD', NULL, 410000, 0, 410000, NULL, '2025-12-28 05:00:00', '2025-12-28 13:32:26', '2025-12-28 13:32:26'),
(123, 94, 2, 'SAL-000105', 'credit', 'IQD', NULL, 454000, 0, 454000, NULL, '2025-12-28 05:00:00', '2025-12-28 13:33:40', '2025-12-28 13:33:40'),
(124, 95, 2, 'SAL-000106', 'credit', 'IQD', NULL, 369000, 0, 369000, NULL, '2025-12-28 05:00:00', '2025-12-28 13:35:14', '2025-12-28 13:35:14'),
(125, 96, 2, 'SAL-000107', 'cash', 'IQD', NULL, 2281250, 2281250, 0, NULL, '2025-12-31 11:03:11', '2025-12-28 13:37:32', '2025-12-31 16:03:11'),
(126, 97, 2, 'SAL-000108', 'cash', 'IQD', NULL, 2023250, 2023250, 0, NULL, '2026-01-20 13:22:50', '2025-12-28 13:39:17', '2026-01-20 18:22:50'),
(127, 98, 2, 'SAL-000109', 'credit', 'IQD', NULL, 135500, 0, 135500, NULL, '2025-12-28 05:00:00', '2025-12-28 13:40:46', '2025-12-28 13:40:46'),
(128, 99, 2, 'SAL-000110', 'cash', 'IQD', NULL, 116000, 116000, 0, NULL, '2026-01-19 12:10:05', '2025-12-28 13:42:26', '2026-01-19 17:10:05'),
(129, 100, 2, 'SAL-000111', 'credit', 'IQD', NULL, 456500, 0, 456500, NULL, '2025-12-28 05:00:00', '2025-12-28 13:43:39', '2025-12-28 13:43:39'),
(130, 101, 2, 'SAL-000112', 'credit', 'IQD', NULL, 3687500, 500000, 3187500, NULL, '2026-01-04 13:30:12', '2025-12-28 13:45:25', '2026-01-04 18:30:12'),
(131, 102, 2, 'SAL-000113', 'credit', 'IQD', NULL, 340000, 0, 340000, NULL, '2025-12-28 05:00:00', '2025-12-28 13:46:29', '2025-12-28 13:46:29'),
(132, 103, 2, 'SAL-000114', 'credit', 'IQD', NULL, 328250, 0, 328250, NULL, '2025-12-28 05:00:00', '2025-12-28 13:48:00', '2025-12-28 13:48:00'),
(133, 104, 2, 'SAL-000115', 'credit', 'IQD', NULL, 89500, 0, 89500, NULL, '2025-12-28 05:00:00', '2025-12-28 13:49:19', '2025-12-28 13:49:19'),
(134, 105, 2, 'SAL-000116', 'credit', 'IQD', NULL, 561500, 0, 561500, NULL, '2025-12-28 05:00:00', '2025-12-28 13:50:38', '2025-12-28 13:50:38'),
(135, 106, 2, 'SAL-000117', 'credit', 'IQD', NULL, 4629750, 0, 4629750, NULL, '2025-12-28 05:00:00', '2025-12-28 13:51:49', '2025-12-28 13:51:49'),
(136, 107, 2, 'SAL-000118', 'credit', 'IQD', NULL, 339500, 0, 339500, NULL, '2025-12-28 05:00:00', '2025-12-28 13:53:03', '2025-12-28 13:53:03'),
(137, 108, 2, 'SAL-000119', 'cash', 'IQD', NULL, 124000, 124000, 0, NULL, '2026-01-20 06:33:07', '2025-12-28 16:22:29', '2026-01-20 11:33:07'),
(138, 109, 2, 'SAL-000120', 'cash', 'IQD', NULL, 3872750, 3872750, 0, NULL, '2025-12-31 11:00:18', '2025-12-28 16:23:31', '2025-12-31 16:00:18'),
(139, 110, 2, 'SAL-000121', 'credit', 'IQD', NULL, 229000, 0, 229000, NULL, '2025-12-28 05:00:00', '2025-12-28 16:24:31', '2025-12-28 16:24:31'),
(140, 111, 2, 'SAL-000122', 'credit', 'IQD', NULL, 55000, 0, 55000, NULL, '2025-12-28 05:00:00', '2025-12-28 16:25:38', '2025-12-28 16:25:38'),
(141, 112, 2, 'SAL-000123', 'credit', 'IQD', NULL, 2169250, 0, 2169250, NULL, '2025-12-28 05:00:00', '2025-12-28 16:58:53', '2025-12-28 16:58:53'),
(142, 113, 2, 'SAL-000124', 'credit', 'IQD', NULL, 240000, 0, 240000, NULL, '2025-12-28 05:00:00', '2025-12-28 17:00:17', '2025-12-28 17:00:17'),
(143, 114, 2, 'SAL-000125', 'credit', 'IQD', NULL, 140000, 0, 140000, NULL, '2025-12-28 05:00:00', '2025-12-28 17:01:24', '2025-12-28 17:01:24'),
(144, 115, 2, 'SAL-000126', 'credit', 'IQD', NULL, 202500, 0, 202500, NULL, '2025-12-28 05:00:00', '2025-12-28 17:07:40', '2025-12-28 17:07:40'),
(145, 116, 2, 'SAL-000127', 'credit', 'IQD', NULL, 5908000, 0, 5908000, NULL, '2025-12-28 05:00:00', '2025-12-28 17:08:48', '2025-12-28 17:08:48'),
(146, 117, 2, 'SAL-000128', 'credit', 'IQD', NULL, 234500, 0, 234500, NULL, '2025-12-28 05:00:00', '2025-12-28 17:09:48', '2025-12-28 17:09:48'),
(147, 118, 2, 'SAL-000129', 'credit', 'IQD', NULL, 23500, 0, 23500, NULL, '2025-12-28 05:00:00', '2025-12-28 17:10:59', '2025-12-28 17:10:59'),
(148, 119, 2, 'SAL-000130', 'credit', 'IQD', NULL, 1115750, 0, 1115750, NULL, '2025-12-28 05:00:00', '2025-12-28 17:12:09', '2025-12-28 17:12:09'),
(149, 120, 2, 'SAL-000131', 'credit', 'IQD', NULL, 125500, 0, 125500, NULL, '2025-12-28 05:00:00', '2025-12-28 17:13:50', '2025-12-28 17:13:50'),
(150, 121, 2, 'SAL-000132', 'cash', 'IQD', NULL, 2974500, 2974500, 0, NULL, '2026-01-20 11:44:16', '2025-12-28 17:14:55', '2026-01-20 16:44:16'),
(151, 122, 2, 'SAL-000133', 'credit', 'IQD', NULL, 1432000, 605000, 827000, NULL, '2026-01-01 08:06:13', '2025-12-28 17:17:24', '2026-01-01 13:06:13'),
(152, 123, 2, 'SAL-000134', 'credit', 'IQD', NULL, 605500, 605000, 500, NULL, '2026-01-06 07:32:32', '2025-12-28 17:19:33', '2026-01-06 12:32:32'),
(153, 124, 2, 'SAL-000135', 'credit', 'IQD', NULL, 895000, 0, 895000, NULL, '2025-12-28 05:00:00', '2025-12-28 17:20:43', '2025-12-28 17:20:43'),
(154, 125, 2, 'SAL-000136', 'cash', 'IQD', NULL, 245000, 245000, 0, NULL, '2026-01-20 08:13:11', '2025-12-28 17:21:57', '2026-01-20 13:13:11'),
(155, 126, 2, 'SAL-000137', 'credit', 'IQD', NULL, 200000, 0, 200000, NULL, '2025-12-28 05:00:00', '2025-12-28 17:23:19', '2025-12-28 17:23:19'),
(156, 127, 2, 'SAL-000138', 'credit', 'IQD', NULL, 360000, 0, 360000, NULL, '2025-12-28 05:00:00', '2025-12-28 17:24:20', '2025-12-28 17:24:20'),
(157, 128, 2, 'SAL-000139', 'credit', 'IQD', NULL, 998750, 680000, 318750, NULL, '2026-01-01 15:21:07', '2025-12-28 17:25:18', '2026-01-01 20:21:07'),
(158, 129, 2, 'SAL-000140', 'credit', 'IQD', NULL, 301250, 0, 301250, NULL, '2025-12-28 05:00:00', '2025-12-28 17:26:59', '2025-12-28 17:26:59'),
(159, 130, 2, 'SAL-000141', 'credit', 'IQD', NULL, 40000, 0, 40000, NULL, '2025-12-28 05:00:00', '2025-12-28 17:28:21', '2025-12-28 17:28:21'),
(160, 131, 2, 'SAL-000142', 'credit', 'IQD', NULL, 255000, 0, 255000, NULL, '2025-12-28 05:00:00', '2025-12-28 17:29:18', '2025-12-28 17:29:18'),
(161, 132, 2, 'SAL-000143', 'credit', 'IQD', NULL, 10000, 0, 10000, NULL, '2025-12-28 05:00:00', '2025-12-28 17:34:37', '2025-12-28 17:34:37'),
(162, 25, 2, 'SAL-000144', 'cash', 'IQD', NULL, 2730250, 2730250, 0, NULL, '2026-01-22 09:01:19', '2025-12-28 17:35:58', '2026-01-22 14:01:19'),
(163, 133, 2, 'SAL-000145', 'credit', 'IQD', NULL, 134000, 0, 134000, NULL, '2025-12-28 05:00:00', '2025-12-28 17:37:04', '2025-12-28 17:37:04'),
(164, 134, 2, 'SAL-000146', 'credit', 'IQD', NULL, 35000, 0, 35000, NULL, '2025-12-28 05:00:00', '2025-12-28 17:38:14', '2025-12-28 17:38:14'),
(165, 135, 2, 'SAL-000147', 'credit', 'IQD', NULL, 2235250, 0, 2235250, NULL, '2025-12-28 05:00:00', '2025-12-28 17:40:33', '2025-12-28 17:40:33'),
(166, 136, 2, 'SAL-000148', 'credit', 'IQD', NULL, 390500, 0, 390500, NULL, '2025-12-28 05:00:00', '2025-12-28 17:41:43', '2025-12-28 17:41:43'),
(167, 137, 2, 'SAL-000149', 'credit', 'IQD', NULL, 267500, 0, 267500, NULL, '2025-12-28 05:00:00', '2025-12-28 17:43:00', '2025-12-28 17:43:00'),
(168, 138, 2, 'SAL-000150', 'credit', 'IQD', NULL, 3054750, 3054000, 750, NULL, '2026-01-03 05:52:09', '2025-12-28 17:44:06', '2026-01-03 10:52:09'),
(169, 139, 2, 'SAL-000151', 'credit', 'IQD', NULL, 192000, 0, 192000, NULL, '2025-12-28 05:00:00', '2025-12-28 17:51:36', '2025-12-28 17:51:36'),
(170, 141, 2, 'SAL-000152', 'credit', 'IQD', NULL, 2179250, 500000, 1679250, NULL, '2026-01-12 06:31:47', '2025-12-28 18:01:13', '2026-01-12 11:31:47'),
(171, 140, 2, 'SAL-000153', 'credit', 'IQD', NULL, 926500, 0, 926500, NULL, '2025-12-28 05:00:00', '2025-12-28 18:01:43', '2025-12-28 18:01:43'),
(172, 143, 2, 'SAL-000154', 'credit', 'IQD', NULL, 4135750, 0, 4135750, NULL, '2025-12-29 05:00:00', '2025-12-29 12:08:23', '2025-12-29 12:08:23'),
(173, 144, 2, 'SAL-000155', 'credit', 'IQD', NULL, 40000, 0, 40000, NULL, '2025-12-29 05:00:00', '2025-12-29 12:09:09', '2025-12-29 12:09:09'),
(174, 145, 2, 'SAL-000156', 'credit', 'IQD', NULL, 689500, 0, 689500, NULL, '2025-12-29 05:00:00', '2025-12-29 12:10:05', '2025-12-29 12:10:05'),
(175, 146, 2, 'SAL-000157', 'cash', 'IQD', NULL, 617000, 617000, 0, NULL, '2026-01-07 12:33:03', '2025-12-29 12:12:07', '2026-01-07 17:33:03'),
(176, 147, 2, 'SAL-000158', 'credit', 'IQD', NULL, 3173250, 0, 3173250, NULL, '2025-12-29 05:00:00', '2025-12-29 12:14:48', '2025-12-29 12:14:48'),
(177, 148, 2, 'SAL-000159', 'credit', 'IQD', NULL, 768500, 600000, 168500, NULL, '2025-12-29 10:51:17', '2025-12-29 12:15:46', '2025-12-29 15:51:17'),
(178, 149, 2, 'SAL-000160', 'credit', 'IQD', NULL, 186500, 0, 186500, NULL, '2025-12-29 05:00:00', '2025-12-29 12:16:38', '2025-12-29 12:16:38'),
(179, 150, 2, 'SAL-000161', 'credit', 'IQD', NULL, 503500, 0, 503500, NULL, '2025-12-29 05:00:00', '2025-12-29 12:17:36', '2025-12-29 12:17:36'),
(180, 151, 2, 'SAL-000162', 'cash', 'IQD', NULL, 318750, 318750, 0, NULL, '2026-01-21 10:54:42', '2025-12-29 12:18:20', '2026-01-21 15:54:42'),
(182, 153, 2, 'SAL-000164', 'credit', 'IQD', NULL, 701750, 0, 701750, NULL, '2025-12-29 05:00:00', '2025-12-29 12:20:22', '2025-12-29 12:20:22'),
(183, 154, 2, 'SAL-000165', 'cash', 'IQD', NULL, 1056000, 1056000, 0, NULL, '2026-01-02 07:35:19', '2025-12-29 12:21:18', '2026-01-02 12:35:19'),
(184, 155, 2, 'SAL-000166', 'credit', 'IQD', NULL, 190000, 0, 190000, NULL, '2025-12-29 05:00:00', '2025-12-29 12:22:53', '2025-12-29 12:22:53'),
(185, 156, 2, 'SAL-000167', 'credit', 'IQD', NULL, 352000, 0, 352000, NULL, '2025-12-29 05:00:00', '2025-12-29 12:23:52', '2025-12-29 12:23:52'),
(186, 157, 2, 'SAL-000168', 'cash', 'IQD', NULL, 258000, 258000, 0, NULL, '2026-01-20 11:54:28', '2025-12-29 12:24:30', '2026-01-20 16:54:28'),
(187, 158, 2, 'SAL-000169', 'credit', 'IQD', NULL, 10000, 0, 10000, NULL, '2025-12-29 05:00:00', '2025-12-29 12:25:24', '2025-12-29 12:25:24'),
(188, 159, 2, 'SAL-000170', 'credit', 'IQD', NULL, 1075500, 0, 1075500, NULL, '2025-12-29 05:00:00', '2025-12-29 12:27:43', '2025-12-29 12:27:43'),
(189, 160, 2, 'SAL-000171', 'credit', 'IQD', NULL, 199750, 0, 199750, NULL, '2025-12-29 05:00:00', '2025-12-29 12:29:29', '2025-12-29 12:29:29'),
(190, 161, 2, 'SAL-000172', 'credit', 'IQD', NULL, 340000, 0, 340000, NULL, '2025-12-29 05:00:00', '2025-12-29 12:31:56', '2025-12-29 12:31:56'),
(191, 162, 2, 'SAL-000173', 'credit', 'IQD', NULL, 418750, 0, 418750, NULL, '2025-12-29 05:00:00', '2025-12-29 12:33:08', '2025-12-29 12:33:08'),
(192, 163, 2, 'SAL-000174', 'credit', 'IQD', NULL, 598500, 0, 598500, NULL, '2025-12-29 05:00:00', '2025-12-29 12:34:03', '2025-12-29 12:34:03'),
(193, 164, 2, 'SAL-000175', 'credit', 'IQD', NULL, 1350000, 0, 1350000, NULL, '2025-12-29 05:00:00', '2025-12-29 12:34:42', '2025-12-29 12:34:42'),
(194, 165, 2, 'SAL-000176', 'credit', 'IQD', NULL, 1035000, 0, 1035000, NULL, '2025-12-29 05:00:00', '2025-12-29 12:35:59', '2025-12-29 12:35:59'),
(195, 49, 2, 'SAL-000177', 'cash', 'IQD', NULL, 3215750, 3215750, 0, NULL, '2026-01-20 10:47:01', '2025-12-29 12:36:39', '2026-01-20 15:47:01'),
(196, 166, 2, 'SAL-000178', 'credit', 'IQD', NULL, 795000, 440000, 355000, NULL, '2026-01-01 13:10:01', '2025-12-29 12:37:24', '2026-01-01 18:10:01'),
(197, 167, 2, 'SAL-000179', 'credit', 'IQD', NULL, 2839500, 1000000, 1839500, NULL, '2026-01-24 12:41:09', '2025-12-29 12:38:42', '2026-01-24 17:41:09'),
(198, 168, 2, 'SAL-000180', 'credit', 'IQD', NULL, 149100, 0, 149100, NULL, '2025-12-29 05:00:00', '2025-12-29 12:39:36', '2025-12-29 12:39:36'),
(199, 169, 2, 'SAL-000181', 'credit', 'IQD', NULL, 103000, 0, 103000, NULL, '2025-12-29 05:00:00', '2025-12-29 12:40:34', '2025-12-29 12:40:34'),
(200, 170, 2, 'SAL-000182', 'credit', 'IQD', NULL, 66750, 0, 66750, NULL, '2025-12-29 05:00:00', '2025-12-29 12:41:52', '2025-12-29 12:41:52'),
(201, 171, 2, 'SAL-000183', 'credit', 'IQD', NULL, 66750, 0, 66750, NULL, '2025-12-29 05:00:00', '2025-12-29 12:44:40', '2025-12-29 12:44:40'),
(202, 172, 2, 'SAL-000184', 'cash', 'IQD', NULL, 50000, 50000, 0, NULL, '2026-01-12 06:48:23', '2025-12-29 12:46:22', '2026-01-12 11:48:23'),
(203, 173, 2, 'SAL-000185', 'credit', 'IQD', NULL, 187500, 0, 187500, NULL, '2025-12-29 05:00:00', '2025-12-29 12:47:19', '2025-12-29 12:47:19'),
(204, 174, 2, 'SAL-000186', 'credit', 'IQD', NULL, 110000, 0, 110000, NULL, '2025-12-29 05:00:00', '2025-12-29 12:48:01', '2025-12-29 12:48:01'),
(205, 175, 2, 'SAL-000187', 'credit', 'IQD', NULL, 123000, 0, 123000, NULL, '2025-12-29 05:00:00', '2025-12-29 12:48:40', '2025-12-29 12:48:40'),
(206, 176, 2, 'SAL-000188', 'credit', 'IQD', NULL, 35000, 0, 35000, NULL, '2025-12-29 05:00:00', '2025-12-29 12:49:27', '2025-12-29 12:49:27'),
(207, 177, 2, 'SAL-000189', 'cash', 'IQD', NULL, 945500, 945500, 0, NULL, '2026-01-24 13:33:14', '2025-12-29 12:50:08', '2026-01-24 18:33:14'),
(208, 178, 2, 'SAL-000190', 'credit', 'IQD', NULL, 251500, 0, 251500, NULL, '2025-12-29 05:00:00', '2025-12-29 12:51:37', '2025-12-29 12:51:37'),
(209, 179, 2, 'SAL-000191', 'credit', 'IQD', NULL, 1636000, 0, 1636000, NULL, '2025-12-29 05:00:00', '2025-12-29 12:52:57', '2025-12-29 12:52:57'),
(210, 180, 2, 'SAL-000192', 'credit', 'IQD', NULL, 78750, 0, 78750, NULL, '2025-12-29 05:00:00', '2025-12-29 12:54:17', '2025-12-29 12:54:17'),
(211, 181, 2, 'SAL-000193', 'credit', 'IQD', NULL, 168750, 0, 168750, NULL, '2025-12-29 05:00:00', '2025-12-29 12:55:13', '2025-12-29 12:55:13'),
(212, 36, 2, 'SAL-000194', 'credit', 'IQD', NULL, 9743500, 0, 9743500, NULL, '2025-12-29 05:00:00', '2025-12-29 12:58:29', '2025-12-29 12:58:29'),
(213, 182, 2, 'SAL-000195', 'credit', 'IQD', NULL, 1939500, 1779150, 160350, NULL, '2026-01-26 09:16:44', '2025-12-29 13:01:00', '2026-01-26 14:16:44'),
(214, 183, 2, 'SAL-000196', 'credit', 'IQD', NULL, 68500, 0, 68500, NULL, '2025-12-29 05:00:00', '2025-12-29 13:01:52', '2025-12-29 13:01:52'),
(215, 184, 2, 'SAL-000197', 'credit', 'IQD', NULL, 460000, 0, 460000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:02:43', '2025-12-29 13:02:43'),
(216, 185, 2, 'SAL-000198', 'credit', 'IQD', NULL, 206000, 0, 206000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:03:40', '2025-12-29 13:03:40'),
(217, 186, 2, 'SAL-000199', 'credit', 'IQD', NULL, 617500, 250000, 367500, NULL, '2026-01-21 13:26:35', '2025-12-29 13:05:13', '2026-01-21 18:26:35'),
(218, 187, 2, 'SAL-000200', 'credit', 'IQD', NULL, 2308750, 1460000, 848750, NULL, '2026-01-07 14:18:51', '2025-12-29 13:06:50', '2026-01-07 19:18:51'),
(219, 188, 2, 'SAL-000201', 'credit', 'IQD', NULL, 791500, 0, 791500, NULL, '2025-12-29 05:00:00', '2025-12-29 13:07:33', '2025-12-29 13:07:33'),
(220, 189, 2, 'SAL-000202', 'cash', 'IQD', NULL, 205000, 205000, 0, NULL, '2026-01-07 07:16:44', '2025-12-29 13:08:05', '2026-01-07 12:16:44'),
(221, 190, 2, 'SAL-000203', 'credit', 'IQD', NULL, 165000, 0, 165000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:08:58', '2025-12-29 13:08:58'),
(222, 191, 2, 'SAL-000204', 'credit', 'IQD', NULL, 448000, 0, 448000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:09:39', '2025-12-29 13:09:39'),
(223, 192, 2, 'SAL-000205', 'credit', 'IQD', NULL, 46500, 0, 46500, NULL, '2025-12-29 05:00:00', '2025-12-29 13:11:19', '2025-12-29 13:11:19'),
(224, 48, 2, 'SAL-000206', 'credit', 'IQD', NULL, 1000000, 0, 1000000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:12:16', '2025-12-29 13:12:16'),
(225, 193, 2, 'SAL-000207', 'credit', 'IQD', NULL, 640000, 0, 640000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:13:18', '2025-12-29 13:13:18'),
(226, 194, 2, 'SAL-000208', 'cash', 'IQD', NULL, 323000, 323000, 0, NULL, '2026-01-20 13:01:48', '2025-12-29 13:14:03', '2026-01-20 18:01:48'),
(227, 195, 2, 'SAL-000209', 'credit', 'IQD', NULL, 1369500, 686000, 683500, NULL, '2026-01-03 08:49:26', '2025-12-29 13:15:34', '2026-01-03 13:49:26'),
(228, 196, 2, 'SAL-000210', 'credit', 'IQD', NULL, 361500, 0, 361500, NULL, '2025-12-29 05:00:00', '2025-12-29 13:16:26', '2025-12-29 13:16:26'),
(229, 197, 2, 'SAL-000211', 'cash', 'IQD', NULL, 293750, 293750, 0, NULL, '2026-01-01 05:33:07', '2025-12-29 13:17:40', '2026-01-01 10:33:07'),
(230, 198, 2, 'SAL-000212', 'credit', 'IQD', NULL, 430000, 0, 430000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:18:31', '2025-12-29 13:18:31'),
(231, 199, 2, 'SAL-000213', 'cash', 'IQD', NULL, 334000, 334000, 0, NULL, '2026-01-04 10:03:09', '2025-12-29 13:19:50', '2026-01-04 15:03:09'),
(232, 200, 2, 'SAL-000214', 'cash', 'IQD', NULL, 1808750, 1808750, 0, NULL, '2026-01-06 08:31:04', '2025-12-29 13:20:47', '2026-01-06 13:31:04'),
(233, 201, 2, 'SAL-000215', 'credit', 'IQD', NULL, 416250, 0, 416250, NULL, '2025-12-29 05:00:00', '2025-12-29 13:21:34', '2025-12-29 13:21:34'),
(234, 202, 2, 'SAL-000216', 'credit', 'IQD', NULL, 616000, 0, 616000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:22:09', '2025-12-29 13:22:09'),
(235, 203, 2, 'SAL-000217', 'credit', 'IQD', NULL, 203750, 203000, 750, NULL, '2026-01-01 07:43:08', '2025-12-29 13:23:11', '2026-01-01 12:43:08'),
(236, 204, 2, 'SAL-000218', 'credit', 'IQD', NULL, 68000, 0, 68000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:23:55', '2025-12-29 13:23:55'),
(237, 205, 2, 'SAL-000219', 'credit', 'IQD', NULL, 342000, 0, 342000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:25:00', '2025-12-29 13:25:00'),
(238, 206, 2, 'SAL-000220', 'credit', 'IQD', NULL, 63000, 0, 63000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:26:16', '2025-12-29 13:26:16'),
(239, 207, 2, 'SAL-000221', 'credit', 'IQD', NULL, 550750, 0, 550750, NULL, '2025-12-29 05:00:00', '2025-12-29 13:27:10', '2025-12-29 13:27:10'),
(240, 208, 2, 'SAL-000222', 'credit', 'IQD', NULL, 1146000, 1000000, 146000, NULL, '2025-12-29 08:28:52', '2025-12-29 13:28:17', '2025-12-29 13:28:52'),
(241, 209, 2, 'SAL-000223', 'credit', 'IQD', NULL, 116250, 0, 116250, NULL, '2025-12-29 05:00:00', '2025-12-29 13:29:56', '2025-12-29 13:29:56'),
(242, 210, 2, 'SAL-000224', 'cash', 'IQD', NULL, 790000, 790000, 0, NULL, '2026-01-20 11:02:40', '2025-12-29 13:31:09', '2026-01-20 16:02:40'),
(243, 211, 2, 'SAL-000225', 'cash', 'IQD', NULL, 335000, 335000, 0, NULL, '2026-01-25 08:11:38', '2025-12-29 13:32:33', '2026-01-25 13:11:38'),
(244, 212, 2, 'SAL-000226', 'credit', 'IQD', NULL, 1, 0, 1, NULL, '2026-01-03 05:00:00', '2025-12-29 13:35:09', '2026-01-25 15:04:33'),
(245, 213, 2, 'SAL-000227', 'credit', 'IQD', NULL, 465250, 0, 465250, NULL, '2025-12-29 05:00:00', '2025-12-29 13:36:12', '2025-12-29 13:36:12'),
(246, 214, 2, 'SAL-000228', 'credit', 'IQD', NULL, 150000, 0, 150000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:37:00', '2025-12-29 13:37:00'),
(247, 215, 2, 'SAL-000229', 'credit', 'IQD', NULL, 417000, 0, 417000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:37:47', '2025-12-29 13:37:47'),
(248, 216, 2, 'SAL-000230', 'credit', 'IQD', NULL, 450000, 100000, 350000, NULL, '2026-01-03 10:53:20', '2025-12-29 13:38:52', '2026-01-03 15:53:20'),
(249, 217, 2, 'SAL-000231', 'credit', 'IQD', NULL, 999750, 539000, 460750, NULL, '2026-01-03 06:04:36', '2025-12-29 13:39:53', '2026-01-03 11:04:36'),
(250, 218, 2, 'SAL-000232', 'cash', 'IQD', NULL, 1111250, 1111250, 0, NULL, '2026-01-24 15:16:57', '2025-12-29 13:40:43', '2026-01-24 20:16:57'),
(251, 219, 2, 'SAL-000233', 'credit', 'IQD', NULL, 565000, 0, 565000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:41:33', '2025-12-29 13:41:33'),
(252, 220, 2, 'SAL-000234', 'credit', 'IQD', NULL, 75500, 0, 75500, NULL, '2025-12-29 05:00:00', '2025-12-29 13:42:22', '2025-12-29 13:42:22'),
(253, 221, 2, 'SAL-000235', 'cash', 'IQD', NULL, 403500, 403500, 0, NULL, '2026-01-25 11:21:32', '2025-12-29 13:43:14', '2026-01-25 16:21:32'),
(254, 222, 2, 'SAL-000236', 'credit', 'IQD', NULL, 60500, 0, 60500, NULL, '2025-12-29 05:00:00', '2025-12-29 13:44:08', '2025-12-29 13:44:08'),
(255, 223, 2, 'SAL-000237', 'credit', 'IQD', NULL, 567500, 0, 567500, NULL, '2025-12-29 05:00:00', '2025-12-29 13:44:37', '2025-12-29 13:44:37'),
(256, 224, 2, 'SAL-000238', 'credit', 'IQD', NULL, 1000000, 0, 1000000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:46:38', '2025-12-29 13:46:38'),
(257, 225, 2, 'SAL-000239', 'credit', 'IQD', NULL, 704500, 0, 704500, NULL, '2025-12-29 05:00:00', '2025-12-29 13:47:52', '2025-12-29 13:47:52'),
(258, 226, 2, 'SAL-000240', 'credit', 'IQD', NULL, 495500, 0, 495500, NULL, '2025-12-29 05:00:00', '2025-12-29 13:49:33', '2025-12-29 13:49:33'),
(259, 227, 2, 'SAL-000241', 'cash', 'IQD', NULL, 1224000, 1224000, 0, NULL, '2026-01-20 06:27:50', '2025-12-29 13:51:50', '2026-01-20 11:27:50'),
(260, 228, 2, 'SAL-000242', 'credit', 'IQD', NULL, 481000, 0, 481000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:52:44', '2025-12-29 13:52:44'),
(261, 229, 2, 'SAL-000243', 'credit', 'IQD', NULL, 250000, 0, 250000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:53:24', '2025-12-29 13:53:24'),
(262, 230, 2, 'SAL-000244', 'credit', 'IQD', NULL, 180000, 0, 180000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:54:21', '2025-12-29 13:54:21'),
(263, 231, 2, 'SAL-000245', 'cash', 'IQD', NULL, 87500, 87500, 0, NULL, '2026-01-01 13:10:27', '2025-12-29 13:55:14', '2026-01-01 18:10:27'),
(264, 232, 2, 'SAL-000246', 'credit', 'IQD', NULL, 2346750, 2000000, 346750, NULL, '2026-01-20 14:02:04', '2025-12-29 13:58:36', '2026-01-20 19:02:04'),
(265, 233, 2, 'SAL-000247', 'credit', 'IQD', NULL, 723000, 0, 723000, NULL, '2025-12-29 05:00:00', '2025-12-29 13:59:40', '2025-12-29 13:59:40'),
(266, 234, 2, 'SAL-000248', 'cash', 'IQD', NULL, 1420000, 1420000, 0, NULL, '2026-01-04 14:07:38', '2025-12-29 14:02:18', '2026-01-04 19:07:38'),
(267, 235, 2, 'SAL-000249', 'credit', 'IQD', NULL, 270000, 0, 270000, NULL, '2025-12-29 05:00:00', '2025-12-29 14:04:10', '2025-12-29 14:04:10'),
(268, 234, 2, 'SAL-000250', 'credit', 'IQD', NULL, 748500, 444500, 304000, NULL, '2026-01-20 10:47:47', '2025-12-29 14:05:39', '2026-01-20 15:47:47'),
(269, 236, 2, 'SAL-000251', 'cash', 'IQD', NULL, 425, 425, 0, NULL, '2026-01-26 09:17:41', '2025-12-29 15:19:22', '2026-01-26 14:17:41'),
(270, 237, 2, 'SAL-000252', 'credit', 'IQD', NULL, 390000, 0, 390000, NULL, '2025-12-29 05:00:00', '2025-12-29 15:25:43', '2025-12-29 15:25:43'),
(271, 238, 2, 'SAL-000253', 'credit', 'IQD', NULL, 440750, 240000, 200750, NULL, '2026-01-24 13:17:13', '2025-12-29 15:26:39', '2026-01-24 18:17:13'),
(272, 239, 2, 'SAL-000254', 'credit', 'IQD', NULL, 197500, 0, 197500, NULL, '2025-12-29 05:00:00', '2025-12-29 15:27:51', '2025-12-29 15:27:51'),
(273, 45, 2, 'SAL-000255', 'credit', 'IQD', NULL, 2758250, 7750, 2750500, NULL, '2026-01-07 08:23:13', '2025-12-29 15:30:29', '2026-01-07 13:23:13'),
(274, 240, 2, 'SAL-000256', 'credit', 'IQD', NULL, 160000, 0, 160000, NULL, '2025-12-29 05:00:00', '2025-12-29 15:31:02', '2025-12-29 15:31:02'),
(275, 241, 2, 'SAL-000257', 'credit', 'IQD', NULL, 63000, 0, 63000, NULL, '2025-12-29 05:00:00', '2025-12-29 15:31:42', '2025-12-29 15:31:42'),
(276, 242, 2, 'SAL-000258', 'credit', 'IQD', NULL, 2171500, 0, 2171500, NULL, '2025-12-29 05:00:00', '2025-12-29 15:32:24', '2025-12-29 15:32:24'),
(277, 30, 2, 'SAL-000259', 'credit', 'IQD', NULL, 3294500, 1773500, 1521000, NULL, '2026-01-01 15:28:58', '2025-12-29 15:36:53', '2026-01-01 20:28:58'),
(278, 244, 2, 'SAL-000260', 'credit', 'IQD', NULL, 318750, 0, 318750, NULL, '2025-12-29 05:00:00', '2025-12-29 15:37:36', '2025-12-29 15:37:36'),
(279, 10, 2, 'SAL-000261', 'cash', 'IQD', NULL, 329000, 329000, 0, NULL, '2026-01-24 08:15:41', '2025-12-29 15:38:26', '2026-01-24 13:15:41'),
(280, 246, 2, 'SAL-000262', 'cash', 'IQD', NULL, 404500, 404500, 0, NULL, '2026-01-24 14:07:17', '2025-12-29 15:39:29', '2026-01-24 19:07:17'),
(281, 247, 2, 'SAL-000263', 'credit', 'IQD', NULL, 985003, 886500, 98503, NULL, '2025-12-29 10:45:53', '2025-12-29 15:44:59', '2025-12-29 15:45:53'),
(282, 248, 2, 'SAL-000264', 'credit', 'IQD', NULL, 2909250, 230000, 2679250, NULL, '2026-01-24 13:48:32', '2025-12-29 15:46:55', '2026-01-24 18:48:32'),
(283, 249, 2, 'SAL-000265', 'credit', 'IQD', NULL, 936500, 0, 936500, NULL, '2025-12-29 05:00:00', '2025-12-29 15:47:51', '2025-12-29 15:47:51'),
(284, 250, 2, 'SAL-000266', 'cash', 'IQD', NULL, 1789750, 1789750, 0, NULL, '2026-01-05 11:58:29', '2025-12-29 15:48:38', '2026-01-05 16:58:29'),
(285, 251, 2, 'SAL-000267', 'credit', 'IQD', NULL, 4114250, 2900000, 1214250, NULL, '2026-01-08 13:14:10', '2025-12-29 15:51:58', '2026-01-08 18:14:10'),
(286, 252, 2, 'SAL-000268', 'credit', 'IQD', NULL, 815000, 0, 815000, NULL, '2025-12-29 05:00:00', '2025-12-29 15:53:00', '2025-12-29 15:53:00'),
(287, 253, 2, 'SAL-000269', 'cash', 'IQD', NULL, 66750, 66750, 0, NULL, '2026-01-22 07:23:03', '2025-12-29 15:54:09', '2026-01-22 12:23:03'),
(288, 254, 2, 'SAL-000270', 'credit', 'IQD', NULL, 187000, 0, 187000, NULL, '2025-12-29 05:00:00', '2025-12-29 15:55:08', '2025-12-29 15:55:08'),
(289, 255, 2, 'SAL-000271', 'credit', 'IQD', NULL, 212500, 0, 212500, NULL, '2025-12-29 05:00:00', '2025-12-29 15:55:44', '2025-12-29 15:55:44'),
(290, 256, 2, 'SAL-000272', 'credit', 'IQD', NULL, 2109000, 0, 2109000, NULL, '2025-12-29 05:00:00', '2025-12-29 15:56:17', '2025-12-29 15:56:17'),
(291, 257, 2, 'SAL-000273', 'credit', 'IQD', NULL, 887250, 400000, 487250, NULL, '2026-01-12 06:35:09', '2025-12-29 15:56:59', '2026-01-12 11:35:09'),
(292, 258, 2, 'SAL-000274', 'credit', 'IQD', NULL, 686500, 0, 686500, NULL, '2025-12-29 05:00:00', '2025-12-29 15:57:34', '2025-12-29 15:57:34'),
(293, 259, 2, 'SAL-000275', 'cash', 'IQD', NULL, 70500, 70500, 0, NULL, '2026-01-07 07:34:29', '2025-12-29 15:58:09', '2026-01-07 12:34:29'),
(294, 260, 2, 'SAL-000276', 'credit', 'IQD', NULL, 99500, 0, 99500, NULL, '2025-12-29 05:00:00', '2025-12-29 15:58:44', '2025-12-29 15:58:44'),
(295, 261, 2, 'SAL-000277', 'cash', 'IQD', NULL, 86850, 86850, 0, NULL, '2026-01-20 11:50:00', '2025-12-29 15:59:41', '2026-01-20 16:50:00'),
(296, 262, 2, 'SAL-000278', 'cash', 'USD', NULL, 515.82, 515.82, 0.00000732422, NULL, '2026-01-03 05:40:44', '2025-12-29 16:12:12', '2026-01-03 10:40:44'),
(297, 4, 2, 'SAL-000279', 'cash', 'IQD', NULL, 36250, 36250, 0, NULL, '2026-01-19 12:07:55', '2025-12-29 16:57:44', '2026-01-19 17:07:55'),
(298, 6, 2, 'SAL-000280', 'cash', 'IQD', NULL, 36000, 36000, 0, NULL, '2026-01-05 11:57:36', '2025-12-29 16:58:42', '2026-01-05 16:57:36'),
(299, 235, 2, 'SAL-000281', 'credit', 'IQD', NULL, 60000, 0, 60000, NULL, '2025-12-29 05:00:00', '2025-12-29 16:59:15', '2025-12-29 16:59:15'),
(300, 263, 2, 'SAL-000282', 'cash', 'IQD', NULL, 120000, 120000, 0, NULL, '2026-01-04 11:46:20', '2025-12-29 17:00:27', '2026-01-04 16:46:20'),
(301, 234, 2, 'SAL-000283', 'credit', 'IQD', NULL, 65000, 9000, 56000, NULL, '2026-01-10 05:28:55', '2025-12-29 17:01:20', '2026-01-10 10:28:55'),
(302, 263, 2, 'SAL-000284', 'cash', 'IQD', NULL, 60000, 60000, 0, NULL, '2026-01-04 11:46:20', '2025-12-29 17:30:01', '2026-01-04 16:46:20'),
(303, 261, 2, 'SAL-000285', 'credit', 'IQD', NULL, 800000, 63150, 736850, NULL, '2026-01-20 11:50:00', '2025-12-31 12:51:32', '2026-01-20 16:50:00'),
(304, 20, 2, 'SAL-000286', 'cash', 'USD', NULL, 54, 54, 0, '10 تيل و 350 قةفيز', '2026-01-20 12:46:40', '2025-12-31 13:10:21', '2026-01-20 17:46:40'),
(305, 35, 2, 'SAL-000287', 'cash', 'IQD', NULL, 3054000, 3054000, 0, NULL, '2026-01-04 09:55:34', '2025-12-31 15:18:08', '2026-01-04 14:55:34'),
(306, 38, 2, 'SAL-000288', 'credit', 'USD', NULL, 515, 0, 515, NULL, '2025-12-31 05:00:00', '2025-12-31 15:46:43', '2025-12-31 15:46:43'),
(307, 44, 2, 'SAL-000289', 'credit', 'IQD', NULL, 3872750, 0, 3872750, NULL, '2025-12-31 05:00:00', '2025-12-31 16:01:07', '2025-12-31 16:01:07'),
(308, 96, 2, 'SAL-000290', 'credit', 'IQD', NULL, 34, 30, 4, NULL, '2025-12-31 11:03:11', '2025-12-31 16:02:14', '2025-12-31 16:03:11'),
(309, 32, 2, 'SAL-000291', 'credit', 'IQD', NULL, 4543000, 0, 4543000, NULL, '2025-12-31 05:00:00', '2025-12-31 16:19:14', '2025-12-31 16:19:14'),
(310, 236, 2, 'SAL-000292', 'cash', 'IQD', NULL, 425, 425, 0, NULL, '2026-01-26 09:17:41', '2025-12-31 16:42:44', '2026-01-26 14:17:41'),
(311, 48, 2, 'SAL-000293', 'credit', 'IQD', NULL, 1990000, 0, 1990000, NULL, '2026-01-01 05:00:00', '2026-01-01 16:35:31', '2026-01-01 16:35:31'),
(312, 186, 2, 'SAL-000294', 'credit', 'IQD', NULL, 125500, 0, 125500, NULL, '2026-01-01 05:00:00', '2026-01-01 18:01:21', '2026-01-01 18:01:21'),
(313, 121, 2, 'SAL-000295', 'cash', 'IQD', NULL, 220500, 220500, 0, NULL, '2026-01-20 11:44:16', '2026-01-01 18:12:07', '2026-01-20 16:44:16'),
(314, 264, 2, 'SAL-000296', 'credit', 'IQD', NULL, 130000, 0, 130000, NULL, '2026-01-01 05:00:00', '2026-01-01 18:19:35', '2026-01-01 18:19:35'),
(315, 265, 2, 'SAL-000297', 'cash', 'IQD', NULL, 39000, 39000, 0, NULL, '2026-01-03 05:32:02', '2026-01-02 11:51:17', '2026-01-03 10:32:02'),
(316, 182, 2, 'SAL-000298', 'cash', 'IQD', NULL, 25000, 25000, 0, NULL, '2026-01-26 09:16:44', '2026-01-03 15:12:15', '2026-01-26 14:16:44'),
(317, 182, 2, 'SAL-000299', 'cash', 'IQD', NULL, 176000, 176000, 0, NULL, '2026-01-26 09:16:44', '2026-01-03 17:20:40', '2026-01-26 14:16:44'),
(318, 266, 2, 'SAL-000300', 'credit', 'IQD', NULL, 16500, 0, 16500, NULL, '2026-01-03 05:00:00', '2026-01-03 17:48:27', '2026-01-03 17:48:27'),
(319, 267, 2, 'SAL-000301', 'cash', 'IQD', NULL, 1017500, 1017500, 0, NULL, '2026-01-24 14:04:55', '2026-01-03 17:56:23', '2026-01-24 19:04:55'),
(320, 182, 2, 'SAL-000302', 'cash', 'IQD', NULL, 1000, 1000, 0, NULL, '2026-01-26 09:16:44', '2026-01-03 18:20:46', '2026-01-26 14:16:44'),
(321, 263, 2, 'SAL-000303', 'cash', 'IQD', NULL, 67500, 67500, 0, NULL, '2026-01-15 10:51:07', '2026-01-03 20:52:06', '2026-01-15 15:51:06'),
(322, 218, 2, 'SAL-000304', 'cash', 'IQD', NULL, 221000, 221000, 0, NULL, '2026-01-24 15:16:57', '2026-01-04 09:31:36', '2026-01-24 20:16:57'),
(323, 167, 2, 'SAL-000305', 'credit', 'USD', NULL, 1546.16, 0, 1546.16, NULL, '2026-01-07 05:06:51', '2026-01-04 10:54:25', '2026-01-07 10:06:51'),
(324, 182, 2, 'SAL-000306', 'cash', 'IQD', NULL, 412850, 412850, 0, NULL, '2026-01-26 09:16:44', '2026-01-04 14:53:10', '2026-01-26 14:16:44'),
(325, 218, 2, 'SAL-000307', 'cash', 'IQD', NULL, 158750, 158750, 0, NULL, '2026-01-24 15:16:57', '2026-01-04 15:19:50', '2026-01-24 20:16:57'),
(326, 182, 2, 'SAL-000308', 'cash', 'IQD', NULL, 1035000, 1035000, 0, NULL, '2026-01-26 09:16:44', '2026-01-04 16:11:07', '2026-01-26 14:16:44'),
(327, 268, 2, 'SAL-000309', 'credit', 'IQD', NULL, 431250, 0, 431250, NULL, '2026-01-04 05:00:00', '2026-01-04 16:15:19', '2026-01-04 16:15:19'),
(328, 263, 2, 'SAL-000310', 'cash', 'IQD', NULL, 54000, 54000, 0, NULL, '2026-01-15 10:51:07', '2026-01-04 16:48:01', '2026-01-15 15:51:07'),
(329, 218, 2, 'SAL-000311', 'cash', 'IQD', NULL, 158750, 158750, 0, NULL, '2026-01-24 15:16:57', '2026-01-04 18:53:08', '2026-01-24 20:16:57'),
(330, 243, 2, 'SAL-000312', 'credit', 'IQD', NULL, 3294000, 3293500, 500, NULL, '2026-01-13 09:24:07', '2026-01-05 14:39:21', '2026-01-13 14:24:07'),
(331, 269, 2, 'SAL-000313', 'cash', 'IQD', NULL, 115000, 115000, 0, NULL, '2026-01-25 06:56:38', '2026-01-06 09:57:50', '2026-01-25 11:56:38'),
(332, 10, 2, 'SAL-000314', 'cash', 'IQD', NULL, 80000, 80000, 0, NULL, '2026-01-24 08:15:41', '2026-01-06 10:02:26', '2026-01-24 13:15:41'),
(333, 52, 2, 'SAL-000315', 'cash', 'USD', NULL, 161.375, 161.38, -0.005, NULL, '2026-01-20 06:42:14', '2026-01-06 10:13:54', '2026-01-20 11:42:14'),
(334, 11, 2, 'SAL-000316', 'credit', 'USD', NULL, 505, 0, 505, NULL, '2026-01-06 05:00:00', '2026-01-06 10:24:19', '2026-01-06 10:24:19'),
(335, 56, 2, 'SAL-000317', 'credit', 'IQD', NULL, 190000, 0, 190000, NULL, '2026-01-06 05:00:00', '2026-01-06 10:30:48', '2026-01-06 10:30:48'),
(336, 4, 2, 'SAL-000318', 'cash', 'IQD', NULL, 84000, 84000, 0, NULL, '2026-01-19 12:07:55', '2026-01-06 10:38:43', '2026-01-19 17:07:55'),
(337, 270, 2, 'SAL-000319', 'cash', 'USD', NULL, 8752, 8752, 0, NULL, '2026-01-26 10:31:36', '2026-01-06 10:49:31', '2026-01-26 15:31:36'),
(338, 267, 2, 'SAL-000320', 'credit', 'IQD', NULL, 363750, 360750, 3000, NULL, '2026-01-24 14:04:55', '2026-01-06 10:54:39', '2026-01-24 19:04:55'),
(339, 218, 2, 'SAL-000321', 'cash', 'IQD', NULL, 253750, 253750, 0, NULL, '2026-01-24 15:16:57', '2026-01-06 11:03:23', '2026-01-24 20:16:57'),
(340, 271, 2, 'SAL-000322', 'credit', 'IQD', NULL, 960000, 0, 960000, NULL, '2026-01-06 05:00:00', '2026-01-06 11:13:09', '2026-01-06 11:13:09'),
(341, 272, 2, 'SAL-000323', 'credit', 'IQD', NULL, 59500, 0, 59500, NULL, '2026-01-06 05:00:00', '2026-01-06 11:14:14', '2026-01-06 11:14:14'),
(342, 123, 2, 'SAL-000324', 'credit', 'IQD', NULL, 425, 0, 425, NULL, '2026-01-06 05:00:00', '2026-01-06 11:14:43', '2026-01-07 14:37:19'),
(343, 4, 2, 'SAL-000325', 'cash', 'IQD', NULL, 25500, 25500, 0, NULL, '2026-01-19 12:07:55', '2026-01-06 11:19:08', '2026-01-19 17:07:55'),
(344, 268, 2, 'SAL-000326', 'credit', 'IQD', NULL, 52500, 0, 52500, NULL, '2026-01-06 05:00:00', '2026-01-06 11:22:04', '2026-01-06 11:22:04'),
(345, 273, 2, 'SAL-000327', 'credit', 'IQD', NULL, 277500, 0, 277500, NULL, '2026-01-06 05:00:00', '2026-01-06 11:26:39', '2026-01-06 11:26:39'),
(346, 69, 2, 'SAL-000328', 'credit', 'IQD', NULL, 425, 0, 425, NULL, '2026-01-08 07:20:27', '2026-01-06 11:43:39', '2026-01-08 12:20:27'),
(347, 182, 2, 'SAL-000329', 'cash', 'IQD', NULL, 196000, 196000, 0, NULL, '2026-01-26 09:16:44', '2026-01-06 11:55:31', '2026-01-26 14:16:44'),
(348, 270, 2, 'SAL-000330', 'cash', 'USD', NULL, 0.042, 0.04, 0.002, NULL, '2026-01-26 10:34:20', '2026-01-06 11:58:09', '2026-01-26 15:34:20'),
(349, 274, 2, 'SAL-000331', 'cash', 'IQD', NULL, 125000, 125000, 0, NULL, '2026-01-24 12:37:48', '2026-01-06 12:03:32', '2026-01-24 17:37:48'),
(350, 123, 2, 'SAL-000332', 'credit', 'IQD', NULL, 286750, 0, 286750, NULL, '2026-01-06 05:00:00', '2026-01-06 12:37:29', '2026-01-06 12:37:29'),
(351, 123, 2, 'SAL-000333', 'credit', 'IQD', NULL, 317750, 0, 317750, NULL, '2026-01-06 05:00:00', '2026-01-06 13:01:33', '2026-01-06 13:01:33'),
(352, 45, 2, 'SAL-000334', 'credit', 'USD', NULL, 0, 0, 0, NULL, '2026-01-06 05:00:00', '2026-01-06 13:52:15', '2026-01-06 13:52:15'),
(353, 157, 2, 'SAL-000335', 'cash', 'IQD', NULL, 29750, 29750, 0, NULL, '2026-01-20 11:54:28', '2026-01-06 13:53:00', '2026-01-20 16:54:28'),
(354, 274, 2, 'SAL-000336', 'cash', 'IQD', NULL, 178250, 178250, 0, NULL, '2026-01-24 12:37:48', '2026-01-06 13:55:24', '2026-01-24 17:37:48'),
(355, 275, 2, 'SAL-000337', 'cash', 'IQD', NULL, 425, 425, 0, NULL, '2026-01-08 05:49:59', '2026-01-06 13:58:16', '2026-01-08 10:49:59'),
(356, 200, 2, 'SAL-000338', 'credit', 'USD', NULL, 2677.3, 2000, 677.3, NULL, '2026-01-06 09:10:22', '2026-01-06 14:07:15', '2026-01-06 14:10:22'),
(357, 4, 2, 'SAL-000339', 'cash', 'IQD', NULL, 107500, 107500, 0, NULL, '2026-01-19 12:07:55', '2026-01-06 15:08:59', '2026-01-19 17:07:55'),
(360, 198, 2, 'SAL-000342', 'credit', 'IQD', NULL, 17000, 0, 17000, NULL, '2026-01-06 05:00:00', '2026-01-06 18:17:26', '2026-01-06 18:17:26'),
(361, 112, 2, 'SAL-000343', 'credit', 'IQD', NULL, 158750, 0, 158750, NULL, '2026-01-06 05:00:00', '2026-01-06 18:19:48', '2026-01-06 18:19:48'),
(362, 276, 2, 'SAL-000344', 'cash', 'IQD', NULL, 137500, 137500, 0, NULL, '2026-01-07 04:52:14', '2026-01-06 18:37:40', '2026-01-07 09:52:14'),
(363, 270, 2, 'SAL-000345', 'cash', 'USD', NULL, 2188, 2188, 0, NULL, '2026-01-26 10:31:51', '2026-01-06 19:16:22', '2026-01-26 15:31:51'),
(364, 276, 2, 'SAL-000346', 'cash', 'IQD', NULL, 55000, 55000, 0, NULL, '2026-01-07 04:52:14', '2026-01-06 19:29:00', '2026-01-07 09:52:14'),
(365, 56, 2, 'SAL-000347', 'credit', 'IQD', NULL, 145000, 0, 145000, NULL, '2026-01-06 05:00:00', '2026-01-06 19:56:47', '2026-01-06 19:56:47'),
(366, 246, 2, 'SAL-000348', 'cash', 'IQD', NULL, 67000, 67000, 0, NULL, '2026-01-24 14:07:17', '2026-01-07 09:50:26', '2026-01-24 19:07:17');
INSERT INTO `sales` (`id`, `customer_id`, `user_id`, `invoice_number`, `sale_type`, `currency`, `payment_method`, `total_amount`, `paid_amount`, `remaining_amount`, `notes`, `sale_date`, `created_at`, `updated_at`) VALUES
(367, 277, 2, 'SAL-000349', 'credit', 'IQD', NULL, 356250, 0, 356250, NULL, '2026-01-07 05:00:00', '2026-01-07 10:33:34', '2026-01-07 10:33:34'),
(368, 267, 2, 'SAL-000350', 'credit', 'IQD', NULL, 6000, 0, 6000, NULL, '2026-01-07 05:00:00', '2026-01-07 11:17:12', '2026-01-07 11:17:12'),
(369, 278, 2, 'SAL-000351', 'credit', 'IQD', NULL, 762750, 0, 762750, NULL, '2026-01-07 05:00:00', '2026-01-07 11:24:38', '2026-01-07 11:24:38'),
(370, 45, 2, 'SAL-000352', 'credit', 'IQD', NULL, 95000, 0, 95000, NULL, '2026-01-07 05:00:00', '2026-01-07 13:01:24', '2026-01-07 13:01:24'),
(371, 38, 2, 'SAL-000353', 'credit', 'USD', NULL, 1410.35, 0, 1410.35, NULL, '2026-01-07 05:00:00', '2026-01-07 13:28:00', '2026-01-07 13:28:00'),
(372, 267, 2, 'SAL-000354', 'credit', 'USD', NULL, 774.42, 774, 0.419983, NULL, '2026-01-24 14:05:42', '2026-01-07 13:44:05', '2026-01-24 19:05:42'),
(373, 108, 2, 'SAL-000355', 'cash', 'IQD', NULL, 47500, 47500, 0, NULL, '2026-01-20 06:33:07', '2026-01-07 15:52:52', '2026-01-20 11:33:07'),
(374, 275, 2, 'SAL-000356', 'cash', 'IQD', NULL, 127500, 127500, 0, NULL, '2026-01-10 08:40:26', '2026-01-07 16:23:28', '2026-01-10 13:40:26'),
(375, 198, 2, 'SAL-000357', 'credit', 'IQD', NULL, 8500, 0, 8500, NULL, '2026-01-07 05:00:00', '2026-01-07 16:28:18', '2026-01-07 16:28:18'),
(376, 112, 2, 'SAL-000358', 'credit', 'IQD', NULL, 158750, 0, 158750, NULL, '2026-01-07 05:00:00', '2026-01-07 16:29:54', '2026-01-07 16:29:54'),
(377, 112, 2, 'SAL-000359', 'credit', 'IQD', NULL, 158750, 0, 158750, NULL, '2026-01-07 05:00:00', '2026-01-07 16:33:38', '2026-01-07 16:33:38'),
(378, 276, 2, 'SAL-000360', 'credit', 'IQD', NULL, 50000, 0, 50000, NULL, '2026-01-07 05:00:00', '2026-01-07 17:09:19', '2026-01-07 17:09:19'),
(379, 276, 2, 'SAL-000361', 'credit', 'IQD', NULL, 20000, 0, 20000, NULL, '2026-01-07 05:00:00', '2026-01-07 17:12:04', '2026-01-07 17:12:04'),
(380, 108, 2, 'SAL-000362', 'cash', 'IQD', NULL, 17000, 17000, 0, NULL, '2026-01-20 06:33:07', '2026-01-07 17:26:13', '2026-01-20 11:33:07'),
(381, 36, 2, 'SAL-000363', 'credit', 'IQD', NULL, 250000, 0, 250000, NULL, '2026-01-07 05:00:00', '2026-01-07 18:29:02', '2026-01-07 18:29:02'),
(382, 210, 2, 'SAL-000364', 'cash', 'IQD', NULL, 727500, 727500, 0, NULL, '2026-01-20 11:02:40', '2026-01-07 19:32:21', '2026-01-20 16:02:40'),
(383, 263, 2, 'SAL-000365', 'cash', 'IQD', NULL, 18000, 18000, 0, NULL, '2026-01-15 10:51:07', '2026-01-08 09:50:06', '2026-01-15 15:51:07'),
(384, 5, 2, 'SAL-000366', 'credit', 'IQD', NULL, 18000, 0, 18000, NULL, '2026-01-08 05:00:00', '2026-01-08 09:50:36', '2026-01-08 09:50:36'),
(385, 277, 2, 'SAL-000367', 'credit', 'IQD', NULL, 134500, 0, 134500, NULL, '2026-01-08 05:00:00', '2026-01-08 09:58:41', '2026-01-08 09:58:41'),
(386, 279, 2, 'SAL-000368', 'credit', 'IQD', NULL, 311000, 51000, 260000, NULL, '2026-01-24 10:50:34', '2026-01-08 10:01:16', '2026-01-24 15:50:34'),
(387, 275, 2, 'SAL-000369', 'cash', 'IQD', NULL, 106250, 106250, 0, NULL, '2026-01-10 08:40:26', '2026-01-08 10:53:36', '2026-01-10 13:40:26'),
(388, 210, 2, 'SAL-000370', 'cash', 'IQD', NULL, 70000, 70000, 0, NULL, '2026-01-20 11:02:40', '2026-01-08 11:50:06', '2026-01-20 16:02:40'),
(389, 18, 2, 'SAL-000371', 'cash', 'IQD', NULL, 190000, 190000, 0, NULL, '2026-01-10 08:31:42', '2026-01-08 12:24:24', '2026-01-10 13:31:42'),
(390, 18, 2, 'SAL-000372', 'cash', 'IQD', NULL, 285000, 285000, 0, NULL, '2026-01-10 08:31:42', '2026-01-08 12:25:59', '2026-01-10 13:31:42'),
(391, 235, 2, 'SAL-000373', 'credit', 'IQD', NULL, 70000, 0, 70000, NULL, '2026-01-08 05:00:00', '2026-01-08 12:28:37', '2026-01-08 12:28:37'),
(392, 275, 2, 'SAL-000374', 'cash', 'IQD', NULL, 34000, 34000, 0, NULL, '2026-01-10 08:40:26', '2026-01-08 16:39:19', '2026-01-10 13:40:26'),
(393, 112, 2, 'SAL-000375', 'credit', 'IQD', NULL, 158750, 0, 158750, NULL, '2026-01-08 05:00:00', '2026-01-08 16:42:06', '2026-01-08 16:42:06'),
(394, 18, 2, 'SAL-000376', 'cash', 'IQD', NULL, 158750, 158750, 0, NULL, '2026-01-10 08:31:42', '2026-01-08 16:44:30', '2026-01-10 13:31:42'),
(395, 276, 2, 'SAL-000377', 'credit', 'IQD', NULL, 115000, 0, 115000, NULL, '2026-01-08 05:00:00', '2026-01-08 16:54:43', '2026-01-08 16:54:43'),
(396, 280, 2, 'SAL-000378', 'cash', 'IQD', NULL, 154500, 154500, 0, NULL, '2026-01-21 13:03:48', '2026-01-08 17:02:53', '2026-01-21 18:03:48'),
(397, 18, 2, 'SAL-000379', 'cash', 'IQD', NULL, 363750, 363750, 0, NULL, '2026-01-10 08:31:42', '2026-01-08 17:50:12', '2026-01-10 13:31:42'),
(398, 281, 2, 'SAL-000380', 'credit', 'IQD', NULL, 428750, 0, 428750, NULL, '2026-01-08 12:53:29', '2026-01-08 17:52:52', '2026-01-08 17:53:29'),
(399, 8, 2, 'SAL-000381', 'credit', 'IQD', NULL, 72500, 0, 72500, NULL, '2026-01-08 05:00:00', '2026-01-08 18:00:41', '2026-01-08 18:00:41'),
(400, 210, 2, 'SAL-000382', 'cash', 'IQD', NULL, 52500, 52500, 0, NULL, '2026-01-20 11:02:40', '2026-01-08 18:46:57', '2026-01-20 16:02:40'),
(401, 18, 2, 'SAL-000383', 'cash', 'IQD', NULL, 158750, 158750, 0, NULL, '2026-01-10 08:31:42', '2026-01-08 18:47:56', '2026-01-10 13:31:42'),
(402, 271, 2, 'SAL-000384', 'credit', 'IQD', NULL, 480000, 0, 480000, NULL, '2026-01-08 05:00:00', '2026-01-08 18:49:50', '2026-01-08 18:49:50'),
(403, 18, 2, 'SAL-000385', 'cash', 'IQD', NULL, 363750, 363750, 0, NULL, '2026-01-10 08:31:42', '2026-01-08 18:59:01', '2026-01-10 13:31:42'),
(404, 101, 2, 'SAL-000386', 'credit', 'IQD', NULL, 325000, 0, 325000, NULL, '2026-01-10 05:00:00', '2026-01-10 10:27:27', '2026-01-10 10:27:27'),
(405, 234, 2, 'SAL-000387', 'credit', 'IQD', NULL, 10000, 0, 10000, NULL, '2026-01-10 05:00:00', '2026-01-10 10:29:30', '2026-01-10 10:29:30'),
(406, 18, 2, 'SAL-000388', 'cash', 'IQD', NULL, 158750, 158750, 0, NULL, '2026-01-10 08:31:42', '2026-01-10 10:44:53', '2026-01-10 13:31:42'),
(407, 4, 2, 'SAL-000389', 'cash', 'IQD', NULL, 253000, 253000, 0, NULL, '2026-01-19 12:07:55', '2026-01-12 11:52:58', '2026-01-19 17:07:55'),
(408, 234, 2, 'SAL-000390', 'credit', 'IQD', NULL, 30000, 0, 30000, NULL, '2026-01-12 05:00:00', '2026-01-12 11:55:16', '2026-01-12 11:55:16'),
(409, 282, 2, 'SAL-000391', 'credit', 'IQD', NULL, 268750, 0, 268750, NULL, '2026-01-12 05:00:00', '2026-01-12 12:01:46', '2026-01-12 12:01:46'),
(410, 283, 2, 'SAL-000392', 'cash', 'IQD', NULL, 100000, 100000, 0, NULL, '2026-01-15 07:20:20', '2026-01-12 12:10:37', '2026-01-15 12:20:20'),
(411, 263, 2, 'SAL-000393', 'cash', 'IQD', NULL, 75000, 75000, 0, NULL, '2026-01-15 10:51:07', '2026-01-12 14:33:34', '2026-01-15 15:51:07'),
(412, 275, 2, 'SAL-000394', 'cash', 'IQD', NULL, 68000, 68000, 0, NULL, '2026-01-12 10:21:47', '2026-01-12 14:35:05', '2026-01-12 15:21:47'),
(413, 24, 2, 'SAL-000395', 'credit', 'IQD', NULL, 76750, 0, 76750, NULL, '2026-01-12 05:00:00', '2026-01-12 15:12:55', '2026-01-12 15:12:55'),
(414, 284, 2, 'SAL-000396', 'credit', 'USD', NULL, 304.24, 304, 0.23999, NULL, '2026-01-24 07:59:24', '2026-01-12 16:30:31', '2026-01-24 12:59:24'),
(415, 4, 2, 'SAL-000397', 'cash', 'IQD', NULL, 15000, 15000, 0, NULL, '2026-01-19 12:07:55', '2026-01-13 12:26:59', '2026-01-19 17:07:55'),
(416, 101, 2, 'SAL-000398', 'credit', 'IQD', NULL, 114000, 0, 114000, NULL, '2026-01-13 05:00:00', '2026-01-13 12:27:50', '2026-01-13 12:27:50'),
(417, 285, 2, 'SAL-000399', 'cash', 'IQD', NULL, 12000, 12000, 0, NULL, '2026-01-26 08:19:12', '2026-01-14 14:39:38', '2026-01-26 13:19:12'),
(418, 18, 2, 'SAL-000400', 'credit', 'USD', NULL, 591.44, 0, 591.44, NULL, '2026-01-15 05:00:00', '2026-01-15 13:30:39', '2026-01-15 13:30:39'),
(419, 286, 2, 'SAL-000401', 'credit', 'IQD', NULL, 14875, 13, 14862, NULL, '2026-01-20 07:17:21', '2026-01-15 16:08:00', '2026-01-20 12:17:21'),
(420, 286, 2, 'SAL-000402', 'cash', 'IQD', NULL, 53125, 53125, 0, NULL, '2026-01-20 07:18:04', '2026-01-15 16:29:27', '2026-01-20 12:18:04'),
(421, 286, 2, 'SAL-000403', 'cash', 'IQD', NULL, 31875, 31875, 0, NULL, '2026-01-20 07:18:04', '2026-01-15 16:30:36', '2026-01-20 12:18:04'),
(422, 286, 2, 'SAL-000404', 'credit', 'IQD', NULL, 212500, 50000, 162500, NULL, '2026-01-20 07:18:04', '2026-01-15 16:31:52', '2026-01-20 12:18:04'),
(423, 286, 2, 'SAL-000405', 'credit', 'IQD', NULL, 35500, 0, 35500, NULL, '2026-01-15 05:00:00', '2026-01-15 16:33:34', '2026-01-15 16:33:34'),
(424, 182, 2, 'SAL-000406', 'credit', 'USD', NULL, 1206.99, 0, 1206.99, NULL, '2026-01-15 05:00:00', '2026-01-15 16:45:48', '2026-01-15 16:45:48'),
(425, 33, 2, 'SAL-000407', 'credit', 'IQD', NULL, 727500, 0, 727500, NULL, '2026-01-15 05:00:00', '2026-01-15 16:48:14', '2026-01-15 16:48:14'),
(426, 282, 2, 'SAL-000408', 'credit', 'USD', NULL, 264.52, 0, 264.52, NULL, '2026-01-17 05:00:00', '2026-01-17 15:11:27', '2026-01-17 15:11:27'),
(427, 33, 2, 'SAL-000409', 'credit', 'IQD', NULL, 130000, 0, 130000, NULL, '2026-01-17 05:00:00', '2026-01-17 15:11:53', '2026-01-17 15:11:53'),
(428, 48, 2, 'SAL-000410', 'credit', 'IQD', NULL, 137000, 0, 137000, NULL, '2026-01-17 05:00:00', '2026-01-17 15:13:01', '2026-01-17 15:13:01'),
(429, 217, 2, 'SAL-000411', 'credit', 'IQD', NULL, 25000, 0, 25000, NULL, '2026-01-17 05:00:00', '2026-01-17 15:13:22', '2026-01-17 15:13:22'),
(430, 4, 2, 'SAL-000412', 'cash', 'IQD', NULL, 114500, 114500, 0, NULL, '2026-01-19 12:07:55', '2026-01-17 15:14:18', '2026-01-19 17:07:55'),
(431, 182, 2, 'SAL-000413', 'cash', 'IQD', NULL, 34000, 34000, 0, NULL, '2026-01-26 09:16:44', '2026-01-17 15:17:02', '2026-01-26 14:16:44'),
(432, 182, 2, 'SAL-000414', 'cash', 'IQD', NULL, 980000, 980000, 0, NULL, '2026-01-26 09:16:44', '2026-01-17 15:18:05', '2026-01-26 14:16:44'),
(433, 287, 2, 'SAL-000415', 'cash', 'IQD', NULL, 100000, 100000, 0, NULL, '2026-01-20 06:32:12', '2026-01-17 15:20:13', '2026-01-20 11:32:12'),
(434, 57, 2, 'SAL-000416', 'credit', 'IQD', NULL, 116250, 0, 116250, NULL, '2026-01-17 05:00:00', '2026-01-17 15:20:47', '2026-01-17 15:20:47'),
(435, 233, 2, 'SAL-000417', 'credit', 'IQD', NULL, 5000, 0, 5000, NULL, '2026-01-18 05:00:00', '2026-01-18 10:29:36', '2026-01-18 10:29:36'),
(436, 273, 2, 'SAL-000418', 'credit', 'IQD', NULL, 3000, 0, 3000, NULL, '2026-01-18 05:00:00', '2026-01-18 10:30:38', '2026-01-18 10:30:38'),
(437, 263, 2, 'SAL-000419', 'cash', 'IQD', NULL, 81000, 81000, 0, NULL, '2026-01-24 12:50:04', '2026-01-18 10:31:31', '2026-01-24 17:50:04'),
(438, 269, 2, 'SAL-000420', 'cash', 'IQD', NULL, 110000, 110000, 0, NULL, '2026-01-25 06:56:38', '2026-01-18 10:38:03', '2026-01-25 11:56:38'),
(439, 288, 2, 'SAL-000421', 'credit', 'IQD', NULL, 110000, 0, 110000, NULL, '2026-01-18 05:00:00', '2026-01-18 10:41:34', '2026-01-18 10:41:34'),
(440, 282, 2, 'SAL-000422', 'credit', 'IQD', NULL, 110000, 0, 110000, NULL, '2026-01-18 05:00:00', '2026-01-18 10:44:03', '2026-01-18 10:44:03'),
(441, 10, 2, 'SAL-000423', 'credit', 'IQD', NULL, 30000, 29625, 375, NULL, '2026-01-24 08:15:41', '2026-01-18 10:45:42', '2026-01-24 13:15:41'),
(442, 33, 2, 'SAL-000424', 'credit', 'IQD', NULL, 473750, 0, 473750, NULL, '2026-01-18 05:00:00', '2026-01-18 10:47:17', '2026-01-18 10:47:17'),
(443, 289, 2, 'SAL-000425', 'credit', 'IQD', NULL, 307500, 0, 307500, NULL, '2026-01-20 10:44:27', '2026-01-18 10:49:53', '2026-01-20 15:44:27'),
(444, 227, 2, 'SAL-000426', 'cash', 'IQD', NULL, 314000, 314000, 0, NULL, '2026-01-20 06:27:50', '2026-01-18 11:24:06', '2026-01-20 11:27:50'),
(445, 140, 2, 'SAL-000427', 'credit', 'IQD', NULL, 232500, 0, 232500, NULL, '2026-01-18 05:00:00', '2026-01-18 11:28:41', '2026-01-18 11:28:41'),
(446, 285, 2, 'SAL-000428', 'credit', 'IQD', NULL, 392500, 85500, 307000, NULL, '2026-01-26 08:19:12', '2026-01-18 11:32:01', '2026-01-26 13:19:12'),
(447, 140, 2, 'SAL-000429', 'credit', 'IQD', NULL, 50000, 0, 50000, NULL, '2026-01-18 05:00:00', '2026-01-18 12:25:16', '2026-01-18 12:25:16'),
(448, 290, 2, 'SAL-000430', 'cash', 'IQD', NULL, 363750, 363750, 0, NULL, '2026-01-19 06:03:52', '2026-01-18 12:26:34', '2026-01-19 11:03:52'),
(449, 285, 2, 'SAL-000431', 'credit', 'IQD', NULL, 5000, 0, 5000, NULL, '2026-01-18 05:00:00', '2026-01-18 13:08:36', '2026-01-18 13:08:36'),
(450, 290, 2, 'SAL-000432', 'cash', 'IQD', NULL, 727500, 727500, 0, NULL, '2026-01-19 06:03:52', '2026-01-18 13:23:11', '2026-01-19 11:03:52'),
(451, 33, 2, 'SAL-000433', 'credit', 'IQD', NULL, 727500, 0, 727500, NULL, '2026-01-19 05:00:00', '2026-01-19 11:03:27', '2026-01-19 11:03:27'),
(452, 227, 2, 'SAL-000434', 'cash', 'IQD', NULL, 6000, 6000, 0, NULL, '2026-01-20 06:27:50', '2026-01-19 11:38:27', '2026-01-20 11:27:50'),
(453, 217, 2, 'SAL-000435', 'credit', 'IQD', NULL, 10000, 0, 10000, NULL, '2026-01-19 05:00:00', '2026-01-19 11:38:57', '2026-01-19 11:38:57'),
(454, 270, 2, 'SAL-000436', 'credit', 'IQD', NULL, 425, 0, 425, NULL, '2026-01-19 05:00:00', '2026-01-19 16:54:33', '2026-01-19 16:54:33'),
(455, 186, 2, 'SAL-000437', 'credit', 'IQD', NULL, 79500, 0, 79500, NULL, '2026-01-20 05:00:00', '2026-01-20 11:30:53', '2026-01-20 11:30:53'),
(456, 140, 2, 'SAL-000438', 'credit', 'IQD', NULL, 116250, 0, 116250, NULL, '2026-01-20 05:00:00', '2026-01-20 11:44:16', '2026-01-20 11:44:16'),
(457, 226, 2, 'SAL-000439', 'credit', 'IQD', NULL, 5000, 0, 5000, NULL, '2026-01-20 05:00:00', '2026-01-20 11:45:45', '2026-01-20 11:45:45'),
(458, 285, 2, 'SAL-000440', 'credit', 'IQD', NULL, 94500, 0, 94500, NULL, '2026-01-20 05:00:00', '2026-01-20 11:49:06', '2026-01-20 11:49:06'),
(459, 270, 2, 'SAL-000441', 'cash', 'USD', NULL, 4376, 4376, 0.00000854492, NULL, '2026-01-26 10:34:20', '2026-01-20 12:11:39', '2026-01-26 15:34:20'),
(460, 289, 2, 'SAL-000442', 'credit', 'IQD', NULL, 60000, 0, 60000, NULL, '2026-01-20 05:00:00', '2026-01-20 15:40:01', '2026-01-20 15:40:01'),
(461, 8, 2, 'SAL-000443', 'credit', 'IQD', NULL, 501000, 0, 501000, NULL, '2026-01-20 05:00:00', '2026-01-20 15:54:59', '2026-01-20 15:54:59'),
(462, 193, 2, 'SAL-000444', 'credit', 'IQD', NULL, 116250, 0, 116250, NULL, '2026-01-20 05:00:00', '2026-01-20 17:58:04', '2026-01-20 17:58:04'),
(463, 285, 2, 'SAL-000445', 'credit', 'IQD', NULL, 180000, 0, 180000, NULL, '2026-01-20 05:00:00', '2026-01-20 18:12:13', '2026-01-20 18:12:13'),
(464, 51, 2, 'SAL-000446', 'credit', 'IQD', NULL, 2023000, 0, 2023000, NULL, '2026-01-20 05:00:00', '2026-01-20 18:22:15', '2026-01-20 18:22:15'),
(465, 269, 2, 'SAL-000447', 'cash', 'IQD', NULL, 65000, 65000, 0, NULL, '2026-01-25 06:56:38', '2026-01-21 15:57:25', '2026-01-25 11:56:38'),
(466, 12, 2, 'SAL-000448', 'credit', 'IQD', NULL, 147925, 0, 147925, NULL, '2026-01-21 05:00:00', '2026-01-21 16:01:13', '2026-01-21 16:01:13'),
(467, 274, 2, 'SAL-000449', 'cash', 'IQD', NULL, 158000, 158000, 0, NULL, '2026-01-24 13:37:02', '2026-01-21 16:03:09', '2026-01-24 18:37:02'),
(468, 279, 2, 'SAL-000450', 'credit', 'IQD', NULL, 5100, 0, 5100, NULL, '2026-01-21 05:00:00', '2026-01-21 16:09:27', '2026-01-21 16:09:27'),
(469, 291, 2, 'SAL-000451', 'credit', 'IQD', NULL, 568750, 0, 568750, NULL, '2026-01-21 05:00:00', '2026-01-21 16:19:41', '2026-01-21 16:19:41'),
(470, 285, 2, 'SAL-000452', 'credit', 'IQD', NULL, 63000, 0, 63000, NULL, '2026-01-21 05:00:00', '2026-01-21 17:37:41', '2026-01-21 17:37:41'),
(471, 269, 2, 'SAL-000453', 'cash', 'IQD', NULL, 5000, 5000, 0, NULL, '2026-01-25 06:56:38', '2026-01-21 17:38:34', '2026-01-25 11:56:38'),
(472, 285, 2, 'SAL-000454', 'credit', 'IQD', NULL, 7000, 0, 7000, NULL, '2026-01-21 05:00:00', '2026-01-21 18:42:04', '2026-01-21 18:42:04'),
(473, 231, 2, 'SAL-000455', 'cash', 'IQD', NULL, 285750, 285750, 0, NULL, '2026-01-22 12:03:21', '2026-01-22 11:09:45', '2026-01-22 17:03:21'),
(474, 110, 2, 'SAL-000456', 'credit', 'IQD', NULL, 127500, 0, 127500, NULL, '2026-01-22 05:00:00', '2026-01-22 12:06:51', '2026-01-22 12:06:51'),
(475, 218, 2, 'SAL-000457', 'cash', 'USD', NULL, 1081, 1081, 0, NULL, '2026-01-24 15:17:31', '2026-01-22 13:46:29', '2026-01-24 20:17:31'),
(483, 34, 3, 'SAL-000458', 'cash', 'IQD', NULL, 425, 425, 0, NULL, '2026-01-24 10:02:34', '2026-01-24 09:19:39', '2026-01-24 15:02:34'),
(484, 34, 3, 'SAL-000459', 'cash', 'IQD', NULL, 2266000, 2266000, 0, NULL, '2026-01-24 07:58:22', '2026-01-24 09:22:45', '2026-01-24 12:58:22'),
(485, 234, 3, 'SAL-000460', 'credit', 'IQD', NULL, 22500, 0, 22500, NULL, '2026-01-24 05:00:00', '2026-01-24 11:05:20', '2026-01-24 11:05:20'),
(487, 292, 3, 'SAL-000462', 'cash', 'IQD', NULL, 35625, 35625, 0, NULL, '2026-01-26 06:37:54', '2026-01-24 12:37:59', '2026-01-26 11:37:54'),
(488, 285, 3, 'SAL-000463', 'credit', 'IQD', NULL, 18000, 0, 18000, NULL, '2026-01-24 05:00:00', '2026-01-24 12:39:17', '2026-01-24 12:39:17'),
(489, 38, 3, 'SAL-000464', 'credit', 'IQD', NULL, 145000, 0, 145000, NULL, '2026-01-24 05:00:00', '2026-01-24 13:43:07', '2026-01-24 13:43:07'),
(490, 34, 3, 'SAL-000465', 'cash', 'IQD', NULL, 4048250, 4048250, 0, NULL, '2026-01-24 13:36:30', '2026-01-24 15:01:06', '2026-01-24 18:36:30'),
(491, 292, 2, 'SAL-000466', 'cash', 'IQD', NULL, 25000, 25000, 0, NULL, '2026-01-26 06:37:54', '2026-01-24 15:24:45', '2026-01-26 11:37:54'),
(492, 49, 2, 'SAL-000467', 'credit', 'IQD', NULL, 1995000, 0, 1995000, NULL, '2026-01-24 05:00:00', '2026-01-24 18:31:40', '2026-01-24 18:31:40'),
(493, 263, 2, 'SAL-000468', 'cash', 'IQD', NULL, 76500, 76500, 0, NULL, '2026-01-26 13:59:17', '2026-01-24 18:52:39', '2026-01-26 18:59:17'),
(494, 5, 2, 'SAL-000469', 'credit', 'IQD', NULL, 18000, 0, 18000, NULL, '2026-01-24 05:00:00', '2026-01-24 23:39:09', '2026-01-24 23:39:09'),
(495, 221, 3, 'SAL-000470', 'cash', 'IQD', NULL, 10625, 10625, 0, NULL, '2026-01-25 11:21:32', '2026-01-25 10:32:41', '2026-01-25 16:21:32'),
(496, 157, 3, 'SAL-000471', 'credit', 'IQD', NULL, 65000, 0, 65000, NULL, '2026-01-25 05:00:00', '2026-01-25 10:35:31', '2026-01-25 10:35:31'),
(497, 182, 3, 'SAL-000472', 'cash', 'IQD', NULL, 372000, 372000, 0, NULL, '2026-01-26 09:16:44', '2026-01-25 10:38:05', '2026-01-26 14:16:44'),
(498, 269, 3, 'SAL-000473', 'cash', 'IQD', NULL, 900000, 900000, 0, NULL, '2026-01-25 06:56:38', '2026-01-25 10:53:47', '2026-01-25 11:56:38'),
(499, 293, 3, 'SAL-000474', 'credit', 'IQD', NULL, 109550, 0, 109550, NULL, '2026-01-25 05:00:00', '2026-01-25 12:29:39', '2026-01-25 12:29:39'),
(500, 294, 3, 'SAL-000475', 'credit', 'IQD', NULL, 412000, 0, 412000, NULL, '2026-01-25 05:00:00', '2026-01-25 12:38:49', '2026-01-25 12:38:49'),
(501, 234, 3, 'SAL-000476', 'credit', 'IQD', NULL, 30000, 0, 30000, NULL, '2026-01-25 05:00:00', '2026-01-25 13:07:48', '2026-01-25 13:07:48'),
(502, 294, 3, 'SAL-000477', 'credit', 'IQD', NULL, 335000, 0, 335000, NULL, '2026-01-25 05:00:00', '2026-01-25 13:12:44', '2026-01-25 13:12:44'),
(503, 152, 2, 'SAL-000478', 'credit', 'IQD', NULL, 726000, 0, 726000, NULL, '2026-01-25 05:00:00', '2026-01-25 15:01:19', '2026-01-25 15:01:19'),
(504, 152, 2, 'SAL-000479', 'credit', 'IQD', NULL, 265000, 0, 265000, NULL, '2026-01-25 05:00:00', '2026-01-25 15:02:13', '2026-01-25 15:02:13'),
(505, 212, 2, 'SAL-000480', 'credit', 'IQD', NULL, 451750, 0, 451750, NULL, '2026-01-25 05:00:00', '2026-01-25 15:05:54', '2026-01-25 15:05:54'),
(506, 212, 2, 'SAL-000481', 'credit', 'IQD', NULL, 1462000, 0, 1462000, NULL, '2026-01-25 05:00:00', '2026-01-25 15:08:49', '2026-01-25 15:08:49'),
(507, 157, 2, 'SAL-000482', 'credit', 'IQD', NULL, 5000, 0, 5000, NULL, '2026-01-25 05:00:00', '2026-01-25 16:19:56', '2026-01-25 16:19:56'),
(508, 234, 2, 'SAL-000483', 'credit', 'IQD', NULL, 500, 0, 500, NULL, '2026-01-25 05:00:00', '2026-01-25 16:21:13', '2026-01-25 16:21:13'),
(509, 40, 2, 'SAL-000484', 'cash', 'IQD', NULL, 10000, 10000, 0, NULL, '2026-01-25 14:35:08', '2026-01-25 16:29:10', '2026-01-25 19:35:08'),
(510, 182, 2, 'SAL-000485', 'cash', 'IQD', NULL, 46000, 46000, 0, NULL, '2026-01-26 09:16:44', '2026-01-25 16:31:42', '2026-01-26 14:16:44'),
(511, 282, 2, 'SAL-000486', 'credit', 'IQD', NULL, 100000, 0, 100000, NULL, '2026-01-26 05:00:00', '2026-01-26 13:21:12', '2026-01-26 13:21:12'),
(512, 295, 2, 'SAL-000487', 'cash', 'USD', NULL, 443, 443, 0, NULL, '2026-01-26 09:10:01', '2026-01-26 13:26:43', '2026-01-26 14:10:01'),
(513, 23, 2, 'SAL-000488', 'cash', 'USD', NULL, 192.5, 192.5, 0, NULL, '2026-01-26 09:13:56', '2026-01-26 13:28:19', '2026-01-26 14:13:56'),
(514, 269, 2, 'SAL-000489', 'credit', 'IQD', NULL, 198000, 0, 198000, NULL, '2026-01-26 05:00:00', '2026-01-26 13:41:19', '2026-01-26 13:41:19'),
(515, 294, 2, 'SAL-000490', 'credit', 'IQD', NULL, 15000, 0, 15000, NULL, '2026-01-26 05:00:00', '2026-01-26 13:42:40', '2026-01-26 13:42:40'),
(516, 234, 2, 'SAL-000491', 'credit', 'IQD', NULL, 363750, 0, 363750, NULL, '2026-01-26 05:00:00', '2026-01-26 13:43:16', '2026-01-26 13:43:16'),
(517, 157, 2, 'SAL-000492', 'credit', 'IQD', NULL, 45000, 0, 45000, NULL, '2026-01-26 05:00:00', '2026-01-26 13:45:19', '2026-01-26 13:45:19'),
(518, 248, 2, 'SAL-000493', 'credit', 'IQD', NULL, 52500, 0, 52500, NULL, '2026-01-26 05:00:00', '2026-01-26 13:46:08', '2026-01-26 13:46:08'),
(519, 234, 2, 'SAL-000494', 'credit', 'IQD', NULL, 170000, 0, 170000, NULL, '2026-01-26 05:00:00', '2026-01-26 13:46:56', '2026-01-26 13:46:56'),
(520, 296, 2, 'SAL-000495', 'credit', 'USD', NULL, 2342.21, 0, 2342.21, NULL, '2026-01-26 08:57:09', '2026-01-26 13:54:48', '2026-01-26 13:57:09'),
(521, 296, 2, 'SAL-000496', 'credit', 'IQD', NULL, 474950, 0, 474950, NULL, '2026-01-26 05:00:00', '2026-01-26 14:00:31', '2026-01-26 14:00:31'),
(522, 64, 2, 'SAL-000497', 'credit', 'IQD', NULL, 640000, 0, 640000, NULL, '2026-01-26 05:00:00', '2026-01-26 14:04:26', '2026-01-26 14:04:26'),
(523, 64, 2, 'SAL-000498', 'credit', 'USD', NULL, 635.5, 0, 635.5, NULL, '2026-01-26 05:00:00', '2026-01-26 14:07:30', '2026-01-26 14:07:30'),
(524, 182, 2, 'SAL-000499', 'credit', 'IQD', NULL, 28000, 0, 28000, NULL, '2026-01-26 05:00:00', '2026-01-26 14:16:12', '2026-01-26 14:16:12'),
(525, 212, 2, 'SAL-000500', 'credit', 'IQD', NULL, 18000, 0, 18000, NULL, '2026-01-26 05:00:00', '2026-01-26 14:21:12', '2026-01-26 14:21:12'),
(526, 270, 2, 'SAL-000501', 'cash', 'USD', NULL, 2180, 2180, 0, NULL, '2026-01-26 10:34:20', '2026-01-26 14:22:18', '2026-01-26 15:34:20'),
(527, 270, 2, 'SAL-000502', 'credit', 'USD', NULL, 13120, 0, 13120, NULL, '2026-01-26 05:00:00', '2026-01-26 15:35:42', '2026-01-26 15:35:42');

-- --------------------------------------------------------

--
-- Table structure for table `sale_items`
--

CREATE TABLE `sale_items` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `sale_id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `quantity` float NOT NULL,
  `unit_price` float NOT NULL,
  `total_price` float NOT NULL,
  `note` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `sale_items`
--

INSERT INTO `sale_items` (`id`, `sale_id`, `product_id`, `quantity`, `unit_price`, `total_price`, `note`, `created_at`, `updated_at`) VALUES
(2, 2, 2, 1120, 425, 476000, NULL, '2025-12-26 11:23:50', '2025-12-26 11:23:50'),
(3, 3, 18, 5, 20000, 100000, NULL, '2025-12-26 11:28:01', '2025-12-26 11:28:01'),
(4, 3, 38, 2, 10000, 20000, NULL, '2025-12-26 11:28:01', '2025-12-26 11:28:01'),
(5, 3, 9, 12, 5000, 60000, NULL, '2025-12-26 11:28:01', '2025-12-26 11:28:01'),
(6, 4, 38, 1, 45000, 45000, NULL, '2025-12-26 11:34:18', '2025-12-26 11:34:18'),
(7, 5, 47, 4, 18500, 74000, NULL, '2025-12-26 11:55:16', '2025-12-26 11:55:16'),
(8, 5, 38, 1, 4000, 4000, NULL, '2025-12-26 11:55:16', '2025-12-26 11:55:16'),
(9, 6, 38, 10, 15000, 150000, NULL, '2025-12-26 12:11:28', '2025-12-26 12:11:28'),
(10, 6, 47, 10, 18500, 185000, NULL, '2025-12-26 12:11:28', '2025-12-26 12:11:28'),
(11, 6, 9, 4, 5000, 20000, NULL, '2025-12-26 12:11:28', '2025-12-26 12:11:28'),
(12, 6, 20, 8.5, 23000, 195500, NULL, '2025-12-26 12:11:28', '2025-12-26 12:11:28'),
(13, 6, 39, 1, 28000, 28000, NULL, '2025-12-26 12:11:28', '2025-12-26 12:11:28'),
(14, 6, 7, 4, 104000, 416000, NULL, '2025-12-26 12:11:28', '2025-12-26 12:11:28'),
(15, 7, 38, 1, 15000, 15000, NULL, '2025-12-26 12:13:44', '2025-12-26 12:13:44'),
(16, 7, 49, 2, 30000, 60000, NULL, '2025-12-26 12:13:44', '2025-12-26 12:13:44'),
(17, 8, 38, 1, 4000, 4000, NULL, '2025-12-26 12:16:32', '2025-12-26 12:16:32'),
(18, 8, 47, 3, 18500, 55500, NULL, '2025-12-26 12:16:32', '2025-12-26 12:16:32'),
(19, 9, 50, 14, 4500, 63000, NULL, '2025-12-26 13:04:12', '2025-12-26 13:04:12'),
(20, 9, 36, 25, 1450, 36250, NULL, '2025-12-26 13:04:12', '2025-12-26 13:04:12'),
(21, 10, 36, 153, 1450, 221850, NULL, '2025-12-26 13:31:57', '2025-12-26 13:31:57'),
(22, 10, 39, 1, 5000, 5000, NULL, '2025-12-26 13:31:57', '2025-12-26 13:31:57'),
(23, 10, 51, 3, 3000, 9000, NULL, '2025-12-26 13:31:57', '2025-12-26 13:31:57'),
(24, 11, 52, 1, 9000, 9000, NULL, '2025-12-26 13:38:37', '2025-12-26 13:38:37'),
(25, 12, 8, 2, 92000, 184000, NULL, '2025-12-26 13:44:16', '2025-12-26 13:44:16'),
(26, 12, 47, 2, 18500, 37000, NULL, '2025-12-26 13:44:16', '2025-12-26 13:44:16'),
(27, 12, 35, 0.25, 10000, 2500, NULL, '2025-12-26 13:44:16', '2025-12-26 13:44:16'),
(28, 12, 18, 2, 15000, 30000, NULL, '2025-12-26 13:44:16', '2025-12-26 13:44:16'),
(29, 13, 53, 20, 15000, 300000, NULL, '2025-12-26 13:48:47', '2025-12-26 13:48:47'),
(30, 13, 49, 6, 30000, 180000, NULL, '2025-12-26 13:48:47', '2025-12-26 13:48:47'),
(31, 13, 38, 3, 10000, 30000, NULL, '2025-12-26 13:48:47', '2025-12-26 13:48:47'),
(32, 14, 2, 15, 425, 6375, NULL, '2025-12-26 13:53:50', '2025-12-26 13:53:50'),
(33, 14, 8, 2, 92000, 184000, NULL, '2025-12-26 13:53:50', '2025-12-26 13:53:50'),
(34, 14, 39, 2, 5000, 10000, NULL, '2025-12-26 13:53:50', '2025-12-26 13:53:50'),
(35, 14, 18, 4, 20000, 80000, NULL, '2025-12-26 13:53:50', '2025-12-26 13:53:50'),
(36, 14, 38, 1, 10000, 10000, NULL, '2025-12-26 13:53:50', '2025-12-26 13:53:50'),
(37, 15, 2, 670, 425, 284750, NULL, '2025-12-26 15:25:44', '2025-12-26 15:25:44'),
(38, 15, 9, 10, 5000, 50000, NULL, '2025-12-26 15:25:44', '2025-12-26 15:25:44'),
(39, 15, 38, 2, 45000, 90000, NULL, '2025-12-26 15:25:44', '2025-12-26 15:25:44'),
(40, 16, 2, 750, 425, 318750, NULL, '2025-12-26 15:57:19', '2025-12-26 15:57:19'),
(41, 17, 41, 1.692, 595, 1006.74, NULL, '2025-12-26 16:23:01', '2025-12-26 16:23:01'),
(42, 17, 54, 1.692, 7, 11.844, NULL, '2025-12-26 16:23:01', '2025-12-26 16:23:01'),
(43, 17, 55, 1, 16, 16, NULL, '2025-12-26 16:23:01', '2025-12-26 16:23:01'),
(44, 18, 41, 1.214, 595, 722.33, NULL, '2025-12-26 16:32:52', '2025-12-26 16:32:52'),
(45, 18, 43, 7, 2, 14, NULL, '2025-12-26 16:32:52', '2025-12-26 16:32:52'),
(46, 18, 54, 1.214, 7, 8.498, NULL, '2025-12-26 16:32:52', '2025-12-26 16:32:52'),
(47, 18, 55, 1, 16, 16, NULL, '2025-12-26 16:32:52', '2025-12-26 16:32:52'),
(48, 36, 40, 2.29, 625, 1431.25, NULL, '2025-12-27 13:01:47', '2025-12-27 13:01:47'),
(49, 37, 54, 830, 7, 5810, NULL, '2025-12-27 13:15:31', '2025-12-27 13:15:31'),
(50, 37, 41, 0.83, 595, 493.85, NULL, '2025-12-27 13:15:31', '2025-12-27 13:15:31'),
(51, 37, 55, 1, 16, 16, NULL, '2025-12-27 13:15:31', '2025-12-27 13:15:31'),
(52, 38, 40, 3.434, 580, 1991.72, NULL, '2025-12-27 13:40:29', '2025-12-27 13:40:29'),
(53, 38, 43, 12, 2, 24, NULL, '2025-12-27 13:40:29', '2025-12-27 13:40:29'),
(54, 38, 54, 3.434, 7, 24.038, NULL, '2025-12-27 13:40:29', '2025-12-27 13:40:29'),
(55, 38, 55, 2, 16, 32, NULL, '2025-12-27 13:40:29', '2025-12-27 13:40:29'),
(56, 38, 56, 6, 9, 54, NULL, '2025-12-27 13:40:29', '2025-12-27 13:40:29'),
(57, 39, 5, 1, 425, 425, NULL, '2025-12-27 14:50:39', '2025-12-27 14:50:39'),
(58, 40, 40, 1.228, 580, 712.24, NULL, '2025-12-27 14:57:24', '2025-12-27 14:57:24'),
(59, 40, 43, 5, 2, 10, NULL, '2025-12-27 14:57:24', '2025-12-27 14:57:24'),
(60, 40, 44, 580, 0.55, 319, NULL, '2025-12-27 14:57:24', '2025-12-27 14:57:24'),
(61, 40, 54, 1.228, 7, 8.596, NULL, '2025-12-27 14:57:24', '2025-12-27 14:57:24'),
(62, 40, 55, 2, 16, 32, NULL, '2025-12-27 14:57:24', '2025-12-27 14:57:24'),
(63, 41, 41, 0.79, 600, 474, NULL, '2025-12-27 15:02:42', '2025-12-27 15:02:42'),
(64, 41, 43, 5, 2, 10, NULL, '2025-12-27 15:02:42', '2025-12-27 15:02:42'),
(65, 41, 44, 269, 0.55, 147.95, NULL, '2025-12-27 15:02:42', '2025-12-27 15:02:42'),
(66, 41, 54, 1, 7, 7, NULL, '2025-12-27 15:02:42', '2025-12-27 15:02:42'),
(67, 41, 55, 1, 16, 16, NULL, '2025-12-27 15:02:42', '2025-12-27 15:02:42'),
(68, 42, 42, 1.796, 710, 1275.16, NULL, '2025-12-27 15:08:06', '2025-12-27 15:08:06'),
(69, 42, 46, 140, 0.28, 39.2, NULL, '2025-12-27 15:08:06', '2025-12-27 15:08:06'),
(70, 42, 56, 1, 9, 9, NULL, '2025-12-27 15:08:06', '2025-12-27 15:08:06'),
(71, 42, 55, 1, 16, 16, NULL, '2025-12-27 15:08:06', '2025-12-27 15:08:06'),
(72, 42, 54, 1.796, 7, 12.572, NULL, '2025-12-27 15:08:06', '2025-12-27 15:08:06'),
(73, 42, 43, 6, 2, 12, NULL, '2025-12-27 15:08:06', '2025-12-27 15:08:06'),
(74, 43, 41, 0.598, 600, 358.8, NULL, '2025-12-27 15:14:31', '2025-12-27 15:14:31'),
(75, 43, 43, 5, 2, 10, NULL, '2025-12-27 15:14:31', '2025-12-27 15:14:31'),
(76, 43, 55, 1, 16, 16, NULL, '2025-12-27 15:14:31', '2025-12-27 15:14:31'),
(77, 43, 54, 1, 7, 7, NULL, '2025-12-27 15:14:31', '2025-12-27 15:14:31'),
(78, 44, 41, 1.988, 595, 1182.86, 'شيشي ئيراني بووة', '2025-12-27 15:57:14', '2025-12-27 15:57:14'),
(79, 44, 43, 10, 2, 20, NULL, '2025-12-27 15:57:14', '2025-12-27 15:57:14'),
(80, 44, 56, 2, 9, 18, NULL, '2025-12-27 15:57:15', '2025-12-27 15:57:15'),
(81, 44, 55, 1, 42, 42, '60000 كريبار ىبوة', '2025-12-27 15:57:15', '2025-12-27 15:57:15'),
(82, 44, 54, 1.988, 7, 13.916, NULL, '2025-12-27 15:57:15', '2025-12-27 15:57:15'),
(83, 45, 18, 1, 792000, 792000, 'ئي قةروزي بيشوو ئي مانكي ى7=8=2025', '2025-12-27 16:15:20', '2025-12-27 16:15:20'),
(84, 46, 5, 1, 298500, 298500, 'ئي قةرزي بيشوو', '2025-12-27 16:22:26', '2025-12-27 16:22:26'),
(85, 47, 40, 2.972, 635, 1887.22, 'شيشي فانة ئي 23-11-2025', '2025-12-27 16:25:51', '2025-12-27 16:25:51'),
(86, 47, 43, 2, 2, 4, NULL, '2025-12-27 16:25:51', '2025-12-27 16:25:51'),
(87, 47, 54, 2.972, 7, 20.804, NULL, '2025-12-27 16:25:51', '2025-12-27 16:25:51'),
(88, 47, 55, 1, 16, 16, NULL, '2025-12-27 16:25:51', '2025-12-27 16:25:51'),
(89, 48, 40, 2.44, 583, 1422.52, NULL, '2025-12-27 16:33:18', '2025-12-27 16:33:18'),
(90, 48, 56, 1, 9, 9, NULL, '2025-12-27 16:33:18', '2025-12-27 16:33:18'),
(91, 48, 43, 6, 2, 12, NULL, '2025-12-27 16:33:18', '2025-12-27 16:33:18'),
(92, 48, 45, 136, 0.28, 38.08, NULL, '2025-12-27 16:33:18', '2025-12-27 16:33:18'),
(93, 48, 54, 3, 7, 21, NULL, '2025-12-27 16:33:18', '2025-12-27 16:33:18'),
(94, 48, 55, 1, 16, 16, NULL, '2025-12-27 16:33:18', '2025-12-27 16:33:18'),
(95, 49, 38, 1, 10000, 10000, NULL, '2025-12-27 16:34:02', '2025-12-27 16:34:02'),
(96, 49, 35, 4, 10000, 40000, NULL, '2025-12-27 16:34:02', '2025-12-27 16:34:02'),
(97, 50, 40, 2.964, 590, 1748.76, NULL, '2025-12-27 16:38:27', '2025-12-27 16:38:27'),
(98, 50, 54, 3, 7, 21, NULL, '2025-12-27 16:38:27', '2025-12-27 16:38:27'),
(99, 50, 55, 1, 16, 16, NULL, '2025-12-27 16:38:27', '2025-12-27 16:38:27'),
(100, 51, 41, 0.55, 610, 335.5, 'شيشي ئيرانية', '2025-12-27 16:50:20', '2025-12-27 16:50:20'),
(101, 51, 40, 4.126, 620, 2558.12, 'شيشي سليمانيوة و ئي 2=11=', '2025-12-27 16:50:20', '2025-12-27 16:50:20'),
(102, 51, 43, 13, 2, 26, NULL, '2025-12-27 16:50:20', '2025-12-27 16:50:20'),
(103, 51, 54, 5, 7, 35, NULL, '2025-12-27 16:50:20', '2025-12-27 16:50:20'),
(104, 51, 55, 3, 16, 48, NULL, '2025-12-27 16:50:20', '2025-12-27 16:50:20'),
(108, 53, 40, 4.67, 615, 2872.05, 'بةدوو جار 1656و 3014 حةمباري و كري نازانم كة دراوة يان نا', '2025-12-27 16:58:31', '2025-12-27 16:58:31'),
(109, 54, 40, 2.142, 620, 1328.04, NULL, '2025-12-27 17:41:07', '2025-12-27 17:41:07'),
(110, 54, 41, 0.986, 660, 650.76, 'شيشي فان', '2025-12-27 17:41:07', '2025-12-27 17:41:07'),
(111, 54, 54, 3, 7, 21, NULL, '2025-12-27 17:41:07', '2025-12-27 17:41:07'),
(112, 54, 55, 2, 16, 32, NULL, '2025-12-27 17:41:07', '2025-12-27 17:41:07'),
(113, 54, 43, 13, 2, 26, NULL, '2025-12-27 17:41:07', '2025-12-27 17:41:07'),
(114, 54, 46, 4, 6, 24, NULL, '2025-12-27 17:41:07', '2025-12-27 17:41:07'),
(115, 55, 5, 1, 274000, 274000, 'ئي قةرزي بيشوو', '2025-12-27 17:53:10', '2025-12-27 17:53:10'),
(116, 56, 40, 1, 1318, 1318, 'ئي قةرزي بيشوو', '2025-12-27 17:58:21', '2025-12-27 17:58:21'),
(117, 57, 38, 11, 10000, 110000, NULL, '2025-12-27 18:03:58', '2025-12-27 18:03:58'),
(118, 57, 2, 1750, 425, 743750, NULL, '2025-12-27 18:03:58', '2025-12-27 18:03:58'),
(119, 57, 53, 1, 145000, 145000, NULL, '2025-12-27 18:03:58', '2025-12-27 18:03:58'),
(120, 57, 35, 1, 115000, 115000, NULL, '2025-12-27 18:03:58', '2025-12-27 18:03:58'),
(121, 57, 8, 20, 92000, 1840000, NULL, '2025-12-27 18:03:58', '2025-12-27 18:03:58'),
(122, 57, 3, 2132, 425, 906100, NULL, '2025-12-27 18:03:58', '2025-12-27 18:03:58'),
(123, 58, 2, 200, 425, 85000, NULL, '2025-12-27 18:08:34', '2025-12-27 18:08:34'),
(124, 58, 9, 7, 5000, 35000, NULL, '2025-12-27 18:08:34', '2025-12-27 18:08:34'),
(125, 58, 38, 1, 10000, 10000, NULL, '2025-12-27 18:08:34', '2025-12-27 18:08:34'),
(126, 58, 18, 2, 20000, 40000, NULL, '2025-12-27 18:08:34', '2025-12-27 18:08:34'),
(127, 59, 18, 3, 20000, 60000, NULL, '2025-12-27 18:10:16', '2025-12-27 18:10:16'),
(128, 59, 8, 1, 95000, 95000, NULL, '2025-12-27 18:10:16', '2025-12-27 18:10:16'),
(129, 59, 39, 1, 5000, 5000, NULL, '2025-12-27 18:10:16', '2025-12-27 18:10:16'),
(130, 59, 38, 1, 10000, 10000, NULL, '2025-12-27 18:10:16', '2025-12-27 18:10:16'),
(131, 60, 2, 110, 425, 46750, NULL, '2025-12-27 18:11:27', '2025-12-27 18:11:27'),
(132, 60, 38, 1, 10000, 10000, NULL, '2025-12-27 18:11:27', '2025-12-27 18:11:27'),
(133, 61, 9, 12, 5000, 60000, NULL, '2025-12-27 18:14:30', '2025-12-27 18:14:30'),
(134, 61, 38, 1, 10000, 10000, NULL, '2025-12-27 18:14:30', '2025-12-27 18:14:30'),
(135, 61, 2, 1450, 425, 616250, NULL, '2025-12-27 18:14:30', '2025-12-27 18:14:30'),
(136, 61, 48, 2, 60000, 120000, NULL, '2025-12-27 18:14:30', '2025-12-27 18:14:30'),
(137, 62, 2, 170, 425, 72250, NULL, '2025-12-27 18:15:59', '2025-12-27 18:15:59'),
(138, 62, 11, 3, 5750, 17250, NULL, '2025-12-27 18:15:59', '2025-12-27 18:15:59'),
(139, 63, 38, 1, 15000, 15000, NULL, '2025-12-27 18:16:43', '2025-12-27 18:16:43'),
(140, 63, 51, 1, 3000, 3000, NULL, '2025-12-27 18:16:43', '2025-12-27 18:16:43'),
(141, 64, 8, 1.65, 95000, 156750, NULL, '2025-12-27 18:20:22', '2025-12-27 18:20:22'),
(142, 64, 7, 5.5, 98000, 539000, NULL, '2025-12-27 18:20:22', '2025-12-27 18:20:22'),
(143, 64, 39, 3, 5000, 15000, NULL, '2025-12-27 18:20:22', '2025-12-27 18:20:22'),
(144, 64, 51, 2, 3000, 6000, NULL, '2025-12-27 18:20:22', '2025-12-27 18:20:22'),
(145, 64, 2, 105, 425, 44625, NULL, '2025-12-27 18:20:22', '2025-12-27 18:20:22'),
(146, 64, 9, 8, 5000, 40000, NULL, '2025-12-27 18:20:22', '2025-12-27 18:20:22'),
(147, 65, 18, 3, 20000, 60000, NULL, '2025-12-27 18:21:39', '2025-12-27 18:21:39'),
(148, 65, 9, 3, 5000, 15000, NULL, '2025-12-27 18:21:39', '2025-12-27 18:21:39'),
(149, 65, 38, 1, 10000, 10000, NULL, '2025-12-27 18:21:39', '2025-12-27 18:21:39'),
(150, 66, 40, 0.76, 615, 467.4, 'ئي كاتي 14=10=2025', '2025-12-28 10:23:22', '2025-12-28 10:23:22'),
(151, 66, 56, 2, 9, 18, NULL, '2025-12-28 10:23:22', '2025-12-28 10:23:22'),
(152, 66, 55, 1, 16, 16, NULL, '2025-12-28 10:23:22', '2025-12-28 10:23:22'),
(153, 66, 54, 0.76, 7, 5.32, NULL, '2025-12-28 10:23:22', '2025-12-28 10:23:22'),
(154, 66, 46, 6, 6, 36, NULL, '2025-12-28 10:23:22', '2025-12-28 10:23:22'),
(155, 66, 41, 1, 1008, 1008, 'ئي شيشي بيشوو باقي ماوة', '2025-12-28 10:23:22', '2025-12-28 10:23:22'),
(156, 67, 11, 1, 209000, 209000, '34مةتر زاويةي 6مكليم', '2025-12-28 10:27:44', '2025-12-28 10:27:44'),
(157, 67, 7, 10, 117500, 1175000, 'بة هةموو شتةوة بة كةياندنوو باردكرن و داكرتنيش', '2025-12-28 10:27:44', '2025-12-28 10:27:44'),
(158, 68, 40, 1, 1258, 1258, 'شيشةكة بة 580 دانراوة و 5كارتون كورسي و 1فةردة كةفةر و 3 تيل و حةمباري و كواسنةووة', '2025-12-28 10:29:58', '2025-12-28 10:29:58'),
(159, 69, 40, 1, 1942, 1942, 'باقي ماوة ئي شيش كوي كشتي باي سةدوو دوازدة وةرةقة بوو', '2025-12-28 10:36:21', '2025-12-28 10:36:21'),
(160, 70, 40, 2.344, 600, 1406.4, 'شيشي ئيراني 6=11=2025', '2025-12-28 10:43:52', '2025-12-28 10:43:52'),
(161, 70, 43, 6, 2, 12, NULL, '2025-12-28 10:43:52', '2025-12-28 10:43:52'),
(162, 70, 55, 1, 16, 16, NULL, '2025-12-28 10:43:52', '2025-12-28 10:43:52'),
(163, 70, 54, 2.5, 7, 17.5, NULL, '2025-12-28 10:43:52', '2025-12-28 10:43:52'),
(164, 71, 40, 1, 400, 400, 'جوارسةد دوبلار باقي ماوة و 1236كيلو شيش و 2كورسي و جوار تيل و حةباري و كريباو و قةان و كوي بارةكة 800 دولار بووة و 400 داوة 400 ماوة', '2025-12-28 10:47:14', '2025-12-28 10:47:14'),
(165, 72, 40, 1, 1457, 1457, 'كوي مةوادةكان باي 1790 و 333 دولار واسلفكلراوة', '2025-12-28 10:50:08', '2025-12-28 10:50:08'),
(166, 73, 40, 0.952, 600, 571.2, 'لة بةرواري 1=11=2025', '2025-12-28 10:52:27', '2025-12-28 10:52:27'),
(167, 73, 55, 1, 16, 16, NULL, '2025-12-28 10:52:27', '2025-12-28 10:52:27'),
(168, 73, 54, 1, 7, 7, NULL, '2025-12-28 10:52:27', '2025-12-28 10:52:27'),
(169, 74, 40, 1.704, 635, 1082.04, 'شيشي فان بة 635', '2025-12-28 10:57:49', '2025-12-28 10:57:49'),
(170, 74, 43, 7, 3, 21, NULL, '2025-12-28 10:57:49', '2025-12-28 10:57:49'),
(171, 74, 46, 3, 6, 18, NULL, '2025-12-28 10:57:49', '2025-12-28 10:57:49'),
(172, 74, 54, 2.001, 7, 14.007, NULL, '2025-12-28 10:57:49', '2025-12-28 10:57:49'),
(173, 74, 55, 1, 16, 16, NULL, '2025-12-28 10:57:49', '2025-12-28 10:57:49'),
(174, 74, 56, 1, 9, 9, NULL, '2025-12-28 10:57:49', '2025-12-28 10:57:49'),
(175, 75, 43, 7, 3, 21, NULL, '2025-12-28 11:11:09', '2025-12-28 11:11:09'),
(176, 75, 54, 1, 15, 15, NULL, '2025-12-28 11:11:09', '2025-12-28 11:11:09'),
(177, 75, 40, 1.024, 650, 665.6, NULL, '2025-12-28 11:11:09', '2025-12-28 11:11:09'),
(178, 75, 41, 1, 296, 296, 'بة دوو جار ججوة 12دانة و 25 دانة برينةوةشي تيدبوة و', '2025-12-28 11:11:09', '2025-12-28 11:11:09'),
(179, 76, 49, 2, 30000, 60000, NULL, '2025-12-28 11:15:58', '2025-12-28 11:15:58'),
(180, 76, 18, 7, 20000, 140000, NULL, '2025-12-28 11:15:58', '2025-12-28 11:15:58'),
(181, 76, 9, 12, 5000, 60000, NULL, '2025-12-28 11:15:58', '2025-12-28 11:15:58'),
(182, 76, 8, 1, 95000, 95000, NULL, '2025-12-28 11:15:58', '2025-12-28 11:15:58'),
(183, 76, 38, 1, 36000, 36000, 'بة حةمباري و كوارنةوةوة', '2025-12-28 11:15:58', '2025-12-28 11:15:58'),
(184, 76, 2, 300, 425, 127500, NULL, '2025-12-28 11:15:58', '2025-12-28 11:15:58'),
(185, 77, 40, 1, 2492, 2492, '3458كيلو بة دوو جار 604 و 28545 كيلو وة 320 قةفيز و 16 تيل و 2 كةفةر و 4كورسي بة باركردن و كواستةنوة', '2025-12-28 11:21:30', '2025-12-28 11:21:30'),
(186, 78, 5, 1, 159000, 159000, 'ئي قةرزي بيشوو', '2025-12-28 11:44:03', '2025-12-28 11:44:03'),
(187, 79, 5, 1, 262500, 262500, 'قةرزي بيشوو', '2025-12-28 11:46:25', '2025-12-28 11:46:25'),
(188, 80, 5, 1, 673000, 673000, NULL, '2025-12-28 11:47:52', '2025-12-28 11:47:52'),
(189, 81, 5, 1, 3389500, 3389500, 'ئي قةرزي بيشوو', '2025-12-28 11:49:53', '2025-12-28 11:49:53'),
(190, 82, 5, 1, 3690500, 3690500, 'ئي قةرزي بيشوو', '2025-12-28 11:51:46', '2025-12-28 11:51:46'),
(191, 83, 5, 1, 302500, 302500, 'بيشوو', '2025-12-28 11:52:38', '2025-12-28 11:52:38'),
(192, 84, 5, 1, 3813000, 3813000, 'باي 11044500بردوة و 7228500داوة و', '2025-12-28 12:03:50', '2025-12-28 12:03:50'),
(193, 85, 40, 3.526, 660, 2327.16, 'بة دوو جار جوة 3026كيلو 500كيلوو وة', '2025-12-28 12:07:24', '2025-12-28 12:07:24'),
(194, 85, 43, 10, 3, 30, NULL, '2025-12-28 12:07:24', '2025-12-28 12:07:24'),
(195, 85, 54, 3.5, 7, 24.5, NULL, '2025-12-28 12:07:24', '2025-12-28 12:07:24'),
(196, 85, 55, 1, 16, 16, NULL, '2025-12-28 12:07:24', '2025-12-28 12:07:24'),
(197, 86, 5, 1, 1026000, 1026000, 'ئي قةرزي بيشوو', '2025-12-28 12:10:32', '2025-12-28 12:10:32'),
(198, 87, 5, 1, 183000, 183000, 'ئي بيشوو', '2025-12-28 12:13:07', '2025-12-28 12:13:07'),
(199, 88, 5, 1, 313000, 313000, 'ئي قةرزي بيشوو', '2025-12-28 12:14:43', '2025-12-28 12:14:43'),
(200, 89, 5, 1, 1114000, 1114000, 'ئي قةرزي بيشوو', '2025-12-28 12:16:27', '2025-12-28 12:16:27'),
(201, 90, 5, 1, 1089000, 1089000, 'ئي قةرزي بيشو', '2025-12-28 12:31:30', '2025-12-28 12:31:30'),
(202, 91, 5, 1, 226000, 226000, 'ئي قةرزي بيشوو', '2025-12-28 12:33:35', '2025-12-28 12:33:35'),
(203, 92, 5, 1, 548750, 548750, 'قرزي بيشو', '2025-12-28 12:36:55', '2025-12-28 12:36:55'),
(204, 93, 5, 1, 497500, 497500, 'ئي قةرزي بيشوو', '2025-12-28 12:38:14', '2025-12-28 12:38:14'),
(205, 94, 5, 1, 1174500, 1174500, 'ئي قةرزي بيشوو', '2025-12-28 12:39:37', '2025-12-28 12:39:37'),
(206, 95, 5, 1, 2423000, 2423000, 'قرزي بيشوو', '2025-12-28 12:41:00', '2025-12-28 12:41:00'),
(207, 96, 5, 1, 108750, 108750, 'ئي قةرزي بيشوو', '2025-12-28 12:42:10', '2025-12-28 12:42:10'),
(208, 97, 5, 1, 377750, 377750, 'قةرزي بيشوو', '2025-12-28 12:46:28', '2025-12-28 12:46:28'),
(209, 98, 5, 1, 362500, 362500, 'ئي قةرزي بيشو', '2025-12-28 12:48:16', '2025-12-28 12:48:16'),
(210, 99, 5, 1, 318750, 318750, 'قةرزي بيشوو', '2025-12-28 12:49:28', '2025-12-28 12:49:28'),
(211, 100, 5, 1, 137000, 137000, 'ئي قةرزي بيشوو', '2025-12-28 12:51:12', '2025-12-28 12:51:12'),
(212, 101, 9, 10, 5000, 50000, NULL, '2025-12-28 12:52:11', '2025-12-28 12:52:11'),
(213, 102, 5, 1, 234000, 234000, 'قرزي بيشوو', '2025-12-28 12:54:01', '2025-12-28 12:54:01'),
(214, 103, 5, 1, 125000, 125000, 'بيشوو', '2025-12-28 12:55:19', '2025-12-28 12:55:19'),
(215, 104, 5, 1, 336500, 336500, 'بقيشوو', '2025-12-28 12:56:29', '2025-12-28 12:56:29'),
(216, 105, 9, 1, 148750, 148750, 'ئي بيشوو', '2025-12-28 12:58:58', '2025-12-28 12:58:58'),
(217, 106, 5, 1, 511250, 511250, 'ئير بيشوو', '2025-12-28 12:59:48', '2025-12-28 12:59:48'),
(218, 107, 5, 1, 1740000, 1740000, 'بيشوو', '2025-12-28 13:01:19', '2025-12-28 13:01:19'),
(219, 108, 5, 1, 94000, 94000, NULL, '2025-12-28 13:02:31', '2025-12-28 13:02:31'),
(220, 109, 5, 1, 230250, 230250, NULL, '2025-12-28 13:03:50', '2025-12-28 13:03:50'),
(221, 110, 5, 1, 625000, 625000, NULL, '2025-12-28 13:05:19', '2025-12-28 13:05:19'),
(222, 111, 5, 1, 101000, 101000, NULL, '2025-12-28 13:07:14', '2025-12-28 13:07:14'),
(223, 112, 5, 1, 125000, 125000, NULL, '2025-12-28 13:08:31', '2025-12-28 13:08:31'),
(224, 113, 5, 1, 56000, 56000, NULL, '2025-12-28 13:09:45', '2025-12-28 13:09:45'),
(225, 114, 5, 1, 366750, 366750, NULL, '2025-12-28 13:10:50', '2025-12-28 13:10:50'),
(226, 115, 5, 1, 650000, 650000, 'ئي بيشو و', '2025-12-28 13:12:48', '2025-12-28 13:12:48'),
(227, 116, 5, 1, 173500, 173500, 'ئي بيشوو', '2025-12-28 13:14:11', '2025-12-28 13:14:11'),
(228, 117, 5, 1, 129250, 129250, NULL, '2025-12-28 13:17:09', '2025-12-28 13:17:09'),
(229, 118, 5, 1, 75000, 75000, NULL, '2025-12-28 13:21:45', '2025-12-28 13:21:45'),
(230, 119, 5, 1, 4543750, 4543750, 'قةرزي بيشوو', '2025-12-28 13:28:03', '2025-12-28 13:28:03'),
(231, 120, 5, 1, 30250, 30250, NULL, '2025-12-28 13:30:09', '2025-12-28 13:30:09'),
(232, 121, 5, 1, 157000, 157000, NULL, '2025-12-28 13:31:23', '2025-12-28 13:31:23'),
(233, 122, 5, 1, 410000, 410000, NULL, '2025-12-28 13:32:26', '2025-12-28 13:32:26'),
(234, 123, 5, 1, 454000, 454000, NULL, '2025-12-28 13:33:40', '2025-12-28 13:33:40'),
(235, 124, 5, 1, 369000, 369000, 'قرزي بيشوو', '2025-12-28 13:35:14', '2025-12-28 13:35:14'),
(236, 125, 5, 1, 2281250, 2281250, '2281250', '2025-12-28 13:37:32', '2025-12-28 13:37:32'),
(237, 126, 5, 1, 2023250, 2023250, NULL, '2025-12-28 13:39:17', '2025-12-28 13:39:17'),
(238, 127, 5, 1, 135500, 135500, NULL, '2025-12-28 13:40:46', '2025-12-28 13:40:46'),
(239, 128, 5, 1, 116000, 116000, NULL, '2025-12-28 13:42:26', '2025-12-28 13:42:26'),
(240, 129, 5, 1, 456500, 456500, 'ئي بيشوو', '2025-12-28 13:43:39', '2025-12-28 13:43:39'),
(241, 130, 5, 1, 3687500, 3687500, 'ئي بيشوو', '2025-12-28 13:45:25', '2025-12-28 13:45:25'),
(242, 131, 5, 1, 340000, 340000, NULL, '2025-12-28 13:46:29', '2025-12-28 13:46:29'),
(243, 132, 5, 1, 328250, 328250, 'ئي قةرزي بيشوو', '2025-12-28 13:48:00', '2025-12-28 13:48:00'),
(244, 133, 5, 1, 89500, 89500, NULL, '2025-12-28 13:49:19', '2025-12-28 13:49:19'),
(245, 134, 5, 1, 561500, 561500, NULL, '2025-12-28 13:50:38', '2025-12-28 13:50:38'),
(246, 135, 5, 1, 4629750, 4629750, NULL, '2025-12-28 13:51:49', '2025-12-28 13:51:49'),
(247, 136, 5, 1, 339500, 339500, NULL, '2025-12-28 13:53:03', '2025-12-28 13:53:03'),
(248, 137, 5, 1, 124000, 124000, NULL, '2025-12-28 16:22:29', '2025-12-28 16:22:29'),
(249, 138, 5, 1, 3872750, 3872750, NULL, '2025-12-28 16:23:31', '2025-12-28 16:23:31'),
(250, 139, 5, 1, 229000, 229000, NULL, '2025-12-28 16:24:31', '2025-12-28 16:24:31'),
(251, 140, 5, 1, 55000, 55000, NULL, '2025-12-28 16:25:38', '2025-12-28 16:25:38'),
(252, 141, 5, 1, 2169250, 2169250, NULL, '2025-12-28 16:58:53', '2025-12-28 16:58:53'),
(253, 142, 5, 1, 240000, 240000, NULL, '2025-12-28 17:00:17', '2025-12-28 17:00:17'),
(254, 143, 5, 1, 140000, 140000, NULL, '2025-12-28 17:01:24', '2025-12-28 17:01:24'),
(255, 144, 5, 1, 202500, 202500, NULL, '2025-12-28 17:07:40', '2025-12-28 17:07:40'),
(256, 145, 5, 1, 5908000, 5908000, NULL, '2025-12-28 17:08:48', '2025-12-28 17:08:48'),
(257, 146, 5, 1, 234500, 234500, NULL, '2025-12-28 17:09:48', '2025-12-28 17:09:48'),
(258, 147, 5, 1, 23500, 23500, NULL, '2025-12-28 17:10:59', '2025-12-28 17:10:59'),
(259, 148, 5, 1, 1115750, 1115750, NULL, '2025-12-28 17:12:09', '2025-12-28 17:12:09'),
(260, 149, 5, 1, 125500, 125500, NULL, '2025-12-28 17:13:50', '2025-12-28 17:13:50'),
(261, 150, 5, 1, 2974500, 2974500, NULL, '2025-12-28 17:14:55', '2025-12-28 17:14:55'),
(262, 151, 5, 1, 1432000, 1432000, NULL, '2025-12-28 17:17:24', '2025-12-28 17:17:24'),
(263, 152, 5, 1, 605500, 605500, NULL, '2025-12-28 17:19:33', '2025-12-28 17:19:33'),
(264, 153, 5, 1, 895000, 895000, NULL, '2025-12-28 17:20:43', '2025-12-28 17:20:43'),
(265, 154, 5, 1, 245000, 245000, NULL, '2025-12-28 17:21:57', '2025-12-28 17:21:57'),
(266, 155, 5, 1, 200000, 200000, NULL, '2025-12-28 17:23:19', '2025-12-28 17:23:19'),
(267, 156, 5, 1, 360000, 360000, NULL, '2025-12-28 17:24:20', '2025-12-28 17:24:20'),
(268, 157, 5, 1, 998750, 998750, NULL, '2025-12-28 17:25:18', '2025-12-28 17:25:18'),
(269, 158, 5, 1, 301250, 301250, NULL, '2025-12-28 17:26:59', '2025-12-28 17:26:59'),
(270, 159, 5, 1, 40000, 40000, NULL, '2025-12-28 17:28:21', '2025-12-28 17:28:21'),
(271, 160, 5, 1, 255000, 255000, NULL, '2025-12-28 17:29:18', '2025-12-28 17:29:18'),
(272, 161, 5, 1, 10000, 10000, NULL, '2025-12-28 17:34:37', '2025-12-28 17:34:37'),
(273, 162, 5, 1, 2730250, 2730250, NULL, '2025-12-28 17:35:58', '2025-12-28 17:35:58'),
(274, 163, 5, 1, 134000, 134000, NULL, '2025-12-28 17:37:04', '2025-12-28 17:37:04'),
(275, 164, 5, 1, 35000, 35000, NULL, '2025-12-28 17:38:14', '2025-12-28 17:38:14'),
(276, 165, 5, 1, 2235250, 2235250, NULL, '2025-12-28 17:40:33', '2025-12-28 17:40:33'),
(277, 166, 5, 1, 390500, 390500, NULL, '2025-12-28 17:41:43', '2025-12-28 17:41:43'),
(278, 167, 5, 1, 267500, 267500, NULL, '2025-12-28 17:43:00', '2025-12-28 17:43:00'),
(279, 168, 5, 1, 3054750, 3054750, NULL, '2025-12-28 17:44:06', '2025-12-28 17:44:06'),
(280, 169, 5, 1, 192000, 192000, NULL, '2025-12-28 17:51:36', '2025-12-28 17:51:36'),
(281, 170, 5, 1, 2179250, 2179250, NULL, '2025-12-28 18:01:13', '2025-12-28 18:01:13'),
(282, 171, 5, 1, 926500, 926500, NULL, '2025-12-28 18:01:43', '2025-12-28 18:01:43'),
(283, 172, 5, 1, 4135750, 4135750, NULL, '2025-12-29 12:08:23', '2025-12-29 12:08:23'),
(284, 173, 5, 1, 40000, 40000, NULL, '2025-12-29 12:09:09', '2025-12-29 12:09:09'),
(285, 174, 5, 1, 689500, 689500, NULL, '2025-12-29 12:10:05', '2025-12-29 12:10:05'),
(286, 175, 5, 1, 617000, 617000, NULL, '2025-12-29 12:12:07', '2025-12-29 12:12:07'),
(287, 176, 5, 1, 3173250, 3173250, NULL, '2025-12-29 12:14:48', '2025-12-29 12:14:48'),
(288, 177, 5, 1, 768500, 768500, NULL, '2025-12-29 12:15:46', '2025-12-29 12:15:46'),
(289, 178, 5, 1, 186500, 186500, NULL, '2025-12-29 12:16:38', '2025-12-29 12:16:38'),
(290, 179, 5, 1, 503500, 503500, NULL, '2025-12-29 12:17:36', '2025-12-29 12:17:36'),
(291, 180, 5, 1, 318750, 318750, NULL, '2025-12-29 12:18:20', '2025-12-29 12:18:20'),
(293, 182, 5, 1, 701750, 701750, NULL, '2025-12-29 12:20:22', '2025-12-29 12:20:22'),
(294, 183, 5, 1, 1056000, 1056000, NULL, '2025-12-29 12:21:18', '2025-12-29 12:21:18'),
(295, 184, 5, 1, 190000, 190000, NULL, '2025-12-29 12:22:53', '2025-12-29 12:22:53'),
(296, 185, 5, 1, 352000, 352000, NULL, '2025-12-29 12:23:52', '2025-12-29 12:23:52'),
(297, 186, 5, 1, 258000, 258000, NULL, '2025-12-29 12:24:30', '2025-12-29 12:24:30'),
(298, 187, 9, 2, 5000, 10000, NULL, '2025-12-29 12:25:24', '2025-12-29 12:25:24'),
(299, 188, 5, 1, 1075500, 1075500, NULL, '2025-12-29 12:27:43', '2025-12-29 12:27:43'),
(300, 189, 5, 1, 199750, 199750, NULL, '2025-12-29 12:29:29', '2025-12-29 12:29:29'),
(301, 190, 5, 1, 340000, 340000, NULL, '2025-12-29 12:31:56', '2025-12-29 12:31:56'),
(302, 191, 5, 1, 418750, 418750, NULL, '2025-12-29 12:33:08', '2025-12-29 12:33:08'),
(303, 192, 5, 1, 598500, 598500, NULL, '2025-12-29 12:34:03', '2025-12-29 12:34:03'),
(304, 193, 5, 1, 1350000, 1350000, NULL, '2025-12-29 12:34:42', '2025-12-29 12:34:42'),
(305, 194, 5, 1, 1035000, 1035000, NULL, '2025-12-29 12:35:59', '2025-12-29 12:35:59'),
(306, 195, 5, 1, 3215750, 3215750, NULL, '2025-12-29 12:36:39', '2025-12-29 12:36:39'),
(307, 196, 5, 1, 795000, 795000, NULL, '2025-12-29 12:37:24', '2025-12-29 12:37:24'),
(308, 197, 5, 1, 2839500, 2839500, NULL, '2025-12-29 12:38:42', '2025-12-29 12:38:42'),
(309, 198, 5, 1, 149100, 149100, NULL, '2025-12-29 12:39:36', '2025-12-29 12:39:36'),
(310, 199, 5, 1, 103000, 103000, NULL, '2025-12-29 12:40:34', '2025-12-29 12:40:34'),
(311, 200, 5, 1, 66750, 66750, NULL, '2025-12-29 12:41:52', '2025-12-29 12:41:52'),
(312, 201, 5, 1, 66750, 66750, NULL, '2025-12-29 12:44:40', '2025-12-29 12:44:40'),
(313, 202, 5, 1, 50000, 50000, NULL, '2025-12-29 12:46:22', '2025-12-29 12:46:22'),
(314, 203, 5, 1, 187500, 187500, NULL, '2025-12-29 12:47:19', '2025-12-29 12:47:19'),
(315, 204, 5, 1, 110000, 110000, NULL, '2025-12-29 12:48:01', '2025-12-29 12:48:01'),
(316, 205, 5, 1, 123000, 123000, NULL, '2025-12-29 12:48:40', '2025-12-29 12:48:40'),
(317, 206, 5, 1, 35000, 35000, NULL, '2025-12-29 12:49:27', '2025-12-29 12:49:27'),
(318, 207, 5, 1, 945500, 945500, NULL, '2025-12-29 12:50:08', '2025-12-29 12:50:08'),
(319, 208, 5, 1, 251500, 251500, NULL, '2025-12-29 12:51:37', '2025-12-29 12:51:37'),
(320, 209, 5, 1, 1636000, 1636000, NULL, '2025-12-29 12:52:57', '2025-12-29 12:52:57'),
(321, 210, 5, 1, 78750, 78750, NULL, '2025-12-29 12:54:17', '2025-12-29 12:54:17'),
(322, 211, 5, 1, 168750, 168750, NULL, '2025-12-29 12:55:13', '2025-12-29 12:55:13'),
(323, 212, 5, 1, 9743500, 9743500, NULL, '2025-12-29 12:58:29', '2025-12-29 12:58:29'),
(324, 213, 5, 1, 1939500, 1939500, NULL, '2025-12-29 13:01:00', '2025-12-29 13:01:00'),
(325, 214, 5, 1, 68500, 68500, NULL, '2025-12-29 13:01:52', '2025-12-29 13:01:52'),
(326, 215, 5, 1, 460000, 460000, NULL, '2025-12-29 13:02:43', '2025-12-29 13:02:43'),
(327, 216, 5, 1, 206000, 206000, NULL, '2025-12-29 13:03:40', '2025-12-29 13:03:40'),
(328, 217, 5, 1, 617500, 617500, NULL, '2025-12-29 13:05:13', '2025-12-29 13:05:13'),
(329, 218, 5, 1, 2308750, 2308750, NULL, '2025-12-29 13:06:50', '2025-12-29 13:06:50'),
(330, 219, 5, 1, 791500, 791500, NULL, '2025-12-29 13:07:33', '2025-12-29 13:07:33'),
(331, 220, 5, 1, 205000, 205000, NULL, '2025-12-29 13:08:05', '2025-12-29 13:08:05'),
(332, 221, 5, 1, 165000, 165000, NULL, '2025-12-29 13:08:58', '2025-12-29 13:08:58'),
(333, 222, 5, 1, 448000, 448000, NULL, '2025-12-29 13:09:39', '2025-12-29 13:09:39'),
(334, 223, 5, 1, 46500, 46500, NULL, '2025-12-29 13:11:19', '2025-12-29 13:11:19'),
(335, 224, 5, 1, 1000000, 1000000, NULL, '2025-12-29 13:12:16', '2025-12-29 13:12:16'),
(336, 225, 5, 1, 640000, 640000, NULL, '2025-12-29 13:13:18', '2025-12-29 13:13:18'),
(337, 226, 5, 1, 323000, 323000, NULL, '2025-12-29 13:14:03', '2025-12-29 13:14:03'),
(338, 227, 5, 1, 1369500, 1369500, NULL, '2025-12-29 13:15:34', '2025-12-29 13:15:34'),
(339, 228, 5, 1, 361500, 361500, NULL, '2025-12-29 13:16:26', '2025-12-29 13:16:26'),
(340, 229, 5, 1, 293750, 293750, NULL, '2025-12-29 13:17:40', '2025-12-29 13:17:40'),
(341, 230, 5, 1, 430000, 430000, NULL, '2025-12-29 13:18:31', '2025-12-29 13:18:31'),
(342, 231, 5, 1, 334000, 334000, NULL, '2025-12-29 13:19:50', '2025-12-29 13:19:50'),
(343, 232, 5, 1, 1808750, 1808750, NULL, '2025-12-29 13:20:47', '2025-12-29 13:20:47'),
(344, 233, 5, 1, 416250, 416250, NULL, '2025-12-29 13:21:34', '2025-12-29 13:21:34'),
(345, 234, 5, 1, 616000, 616000, NULL, '2025-12-29 13:22:09', '2025-12-29 13:22:09'),
(346, 235, 5, 1, 203750, 203750, NULL, '2025-12-29 13:23:11', '2025-12-29 13:23:11'),
(347, 236, 5, 1, 68000, 68000, NULL, '2025-12-29 13:23:55', '2025-12-29 13:23:55'),
(348, 237, 5, 1, 342000, 342000, NULL, '2025-12-29 13:25:00', '2025-12-29 13:25:00'),
(349, 238, 5, 1, 63000, 63000, NULL, '2025-12-29 13:26:16', '2025-12-29 13:26:16'),
(350, 239, 5, 1, 550750, 550750, NULL, '2025-12-29 13:27:10', '2025-12-29 13:27:10'),
(351, 240, 5, 1, 1146000, 1146000, NULL, '2025-12-29 13:28:17', '2025-12-29 13:28:17'),
(352, 241, 5, 1, 116250, 116250, NULL, '2025-12-29 13:29:56', '2025-12-29 13:29:56'),
(353, 242, 5, 1, 790000, 790000, NULL, '2025-12-29 13:31:09', '2025-12-29 13:31:09'),
(354, 243, 5, 1, 335000, 335000, NULL, '2025-12-29 13:32:33', '2025-12-29 13:32:33'),
(356, 245, 5, 1, 465250, 465250, NULL, '2025-12-29 13:36:12', '2025-12-29 13:36:12'),
(357, 246, 5, 1, 150000, 150000, NULL, '2025-12-29 13:37:00', '2025-12-29 13:37:00'),
(358, 247, 5, 1, 417000, 417000, NULL, '2025-12-29 13:37:47', '2025-12-29 13:37:47'),
(359, 248, 5, 1, 450000, 450000, NULL, '2025-12-29 13:38:52', '2025-12-29 13:38:52'),
(360, 249, 5, 1, 999750, 999750, NULL, '2025-12-29 13:39:53', '2025-12-29 13:39:53'),
(361, 250, 5, 1, 1111250, 1111250, NULL, '2025-12-29 13:40:43', '2025-12-29 13:40:43'),
(362, 251, 5, 1, 565000, 565000, NULL, '2025-12-29 13:41:33', '2025-12-29 13:41:33'),
(363, 252, 5, 1, 75500, 75500, NULL, '2025-12-29 13:42:22', '2025-12-29 13:42:22'),
(364, 253, 5, 1, 403500, 403500, NULL, '2025-12-29 13:43:14', '2025-12-29 13:43:14'),
(365, 254, 5, 1, 60500, 60500, NULL, '2025-12-29 13:44:08', '2025-12-29 13:44:08'),
(366, 255, 5, 1, 567500, 567500, NULL, '2025-12-29 13:44:37', '2025-12-29 13:44:37'),
(367, 256, 5, 1, 1000000, 1000000, NULL, '2025-12-29 13:46:38', '2025-12-29 13:46:38'),
(368, 257, 5, 1, 704500, 704500, NULL, '2025-12-29 13:47:52', '2025-12-29 13:47:52'),
(369, 258, 5, 1, 495500, 495500, NULL, '2025-12-29 13:49:33', '2025-12-29 13:49:33'),
(370, 259, 5, 2, 612000, 1224000, NULL, '2025-12-29 13:51:50', '2025-12-29 13:51:50'),
(371, 260, 5, 1, 481000, 481000, NULL, '2025-12-29 13:52:44', '2025-12-29 13:52:44'),
(372, 261, 5, 1, 250000, 250000, NULL, '2025-12-29 13:53:24', '2025-12-29 13:53:24'),
(373, 262, 5, 1, 180000, 180000, NULL, '2025-12-29 13:54:21', '2025-12-29 13:54:21'),
(374, 263, 5, 1, 87500, 87500, NULL, '2025-12-29 13:55:14', '2025-12-29 13:55:14'),
(375, 264, 5, 1, 2346750, 2346750, NULL, '2025-12-29 13:58:36', '2025-12-29 13:58:36'),
(376, 265, 5, 1, 723000, 723000, NULL, '2025-12-29 13:59:40', '2025-12-29 13:59:40'),
(377, 266, 5, 3150, 400, 1260000, NULL, '2025-12-29 14:02:18', '2025-12-29 14:02:18'),
(378, 266, 38, 16, 10000, 160000, NULL, '2025-12-29 14:02:19', '2025-12-29 14:02:19'),
(379, 267, 5, 400, 425, 170000, NULL, '2025-12-29 14:04:10', '2025-12-29 14:04:10'),
(380, 267, 18, 1.5, 20000, 30000, NULL, '2025-12-29 14:04:10', '2025-12-29 14:04:10'),
(381, 267, 9, 14, 5000, 70000, NULL, '2025-12-29 14:04:10', '2025-12-29 14:04:10'),
(382, 268, 38, 1, 10000, 10000, NULL, '2025-12-29 14:05:39', '2025-12-29 14:05:39'),
(383, 268, 39, 7, 5500, 38500, NULL, '2025-12-29 14:05:39', '2025-12-29 14:05:39'),
(384, 268, 7, 7, 100000, 700000, NULL, '2025-12-29 14:05:39', '2025-12-29 14:05:39'),
(385, 269, 5, 1, 425, 425, '9495000 ئي قةرزارين', '2025-12-29 15:19:22', '2025-12-29 15:19:22'),
(386, 270, 5, 1, 390000, 390000, NULL, '2025-12-29 15:25:43', '2025-12-29 15:25:43'),
(387, 271, 5, 1, 440750, 440750, NULL, '2025-12-29 15:26:39', '2025-12-29 15:26:39'),
(388, 272, 5, 1, 197500, 197500, NULL, '2025-12-29 15:27:51', '2025-12-29 15:27:51'),
(389, 273, 5, 1, 2758250, 2758250, NULL, '2025-12-29 15:30:29', '2025-12-29 15:30:29'),
(390, 274, 5, 1, 160000, 160000, NULL, '2025-12-29 15:31:02', '2025-12-29 15:31:02'),
(391, 275, 5, 1, 63000, 63000, NULL, '2025-12-29 15:31:42', '2025-12-29 15:31:42'),
(392, 276, 5, 1, 2171500, 2171500, NULL, '2025-12-29 15:32:24', '2025-12-29 15:32:24'),
(393, 277, 5, 1, 3294500, 3294500, NULL, '2025-12-29 15:36:53', '2025-12-29 15:36:53'),
(394, 278, 5, 1, 318750, 318750, NULL, '2025-12-29 15:37:36', '2025-12-29 15:37:36'),
(395, 279, 5, 1, 329000, 329000, NULL, '2025-12-29 15:38:26', '2025-12-29 15:38:26'),
(396, 280, 5, 1, 404500, 404500, NULL, '2025-12-29 15:39:29', '2025-12-29 15:39:29'),
(397, 281, 5, 1, 985003, 985003, NULL, '2025-12-29 15:44:59', '2025-12-29 15:44:59'),
(398, 282, 5, 1, 2909250, 2909250, NULL, '2025-12-29 15:46:55', '2025-12-29 15:46:55'),
(399, 283, 5, 1, 936500, 936500, NULL, '2025-12-29 15:47:51', '2025-12-29 15:47:51'),
(400, 284, 5, 1, 1789750, 1789750, NULL, '2025-12-29 15:48:38', '2025-12-29 15:48:38'),
(401, 285, 5, 1, 4114250, 4114250, NULL, '2025-12-29 15:51:58', '2025-12-29 15:51:58'),
(402, 286, 5, 1, 815000, 815000, NULL, '2025-12-29 15:53:00', '2025-12-29 15:53:00'),
(403, 287, 5, 1, 66750, 66750, NULL, '2025-12-29 15:54:09', '2025-12-29 15:54:09'),
(404, 288, 5, 1, 187000, 187000, NULL, '2025-12-29 15:55:08', '2025-12-29 15:55:08'),
(405, 289, 5, 1, 212500, 212500, NULL, '2025-12-29 15:55:44', '2025-12-29 15:55:44'),
(406, 290, 5, 1, 2109000, 2109000, NULL, '2025-12-29 15:56:17', '2025-12-29 15:56:17'),
(407, 291, 5, 1, 887250, 887250, NULL, '2025-12-29 15:56:59', '2025-12-29 15:56:59'),
(408, 292, 5, 1, 686500, 686500, NULL, '2025-12-29 15:57:34', '2025-12-29 15:57:34'),
(409, 293, 5, 1, 70500, 70500, NULL, '2025-12-29 15:58:09', '2025-12-29 15:58:09'),
(410, 294, 5, 1, 99500, 99500, NULL, '2025-12-29 15:58:44', '2025-12-29 15:58:44'),
(411, 295, 5, 1, 86850, 86850, NULL, '2025-12-29 15:59:41', '2025-12-29 15:59:41'),
(412, 296, 40, 1, 72, 72, 'ئي قةرزي بيشوو', '2025-12-29 16:12:12', '2025-12-29 16:12:12'),
(413, 296, 41, 0.662, 610, 403.82, NULL, '2025-12-29 16:12:12', '2025-12-29 16:12:12'),
(414, 296, 56, 1, 9, 9, NULL, '2025-12-29 16:12:12', '2025-12-29 16:12:12'),
(415, 296, 55, 1, 16, 16, NULL, '2025-12-29 16:12:12', '2025-12-29 16:12:12'),
(416, 296, 54, 1, 7, 7, NULL, '2025-12-29 16:12:12', '2025-12-29 16:12:12'),
(417, 296, 43, 4, 2, 8, NULL, '2025-12-29 16:12:12', '2025-12-29 16:12:12'),
(418, 297, 5, 50, 425, 21250, NULL, '2025-12-29 16:57:44', '2025-12-29 16:57:44'),
(419, 297, 38, 1, 15000, 15000, NULL, '2025-12-29 16:57:44', '2025-12-29 16:57:44'),
(420, 298, 9, 6, 5000, 30000, NULL, '2025-12-29 16:58:42', '2025-12-29 16:58:42'),
(421, 298, 51, 2, 3000, 6000, NULL, '2025-12-29 16:58:42', '2025-12-29 16:58:42'),
(422, 299, 35, 6, 10000, 60000, NULL, '2025-12-29 16:59:15', '2025-12-29 16:59:15'),
(423, 300, 51, 40, 3000, 120000, NULL, '2025-12-29 17:00:27', '2025-12-29 17:00:27'),
(424, 301, 9, 1, 5000, 5000, NULL, '2025-12-29 17:01:20', '2025-12-29 17:01:20'),
(425, 301, 51, 20, 3000, 60000, NULL, '2025-12-29 17:01:20', '2025-12-29 17:01:20'),
(426, 302, 51, 20, 3000, 60000, NULL, '2025-12-29 17:30:01', '2025-12-29 17:30:01'),
(427, 303, 5, 1, 800000, 800000, NULL, '2025-12-31 12:51:32', '2025-12-31 12:51:32'),
(428, 304, 5, 1, 54, 54, NULL, '2025-12-31 13:10:21', '2025-12-31 13:10:21'),
(429, 305, 5, 1, 3054000, 3054000, NULL, '2025-12-31 15:18:08', '2025-12-31 15:18:08'),
(430, 306, 40, 1, 515, 515, NULL, '2025-12-31 15:46:43', '2025-12-31 15:46:43'),
(431, 307, 5, 1, 3872750, 3872750, NULL, '2025-12-31 16:01:07', '2025-12-31 16:01:07'),
(432, 308, 5, 1, 34, 34, '22812000 ئيمة قةرزارين', '2025-12-31 16:02:14', '2025-12-31 16:02:14'),
(433, 309, 5, 1, 4543000, 4543000, NULL, '2025-12-31 16:19:14', '2025-12-31 16:19:14'),
(434, 310, 5, 1, 425, 425, NULL, '2025-12-31 16:42:44', '2025-12-31 16:42:44'),
(435, 311, 5, 1, 1990000, 1990000, NULL, '2026-01-01 16:35:31', '2026-01-01 16:35:31'),
(436, 312, 34, 5, 7500, 37500, NULL, '2026-01-01 18:01:21', '2026-01-01 18:01:21'),
(437, 312, 33, 8, 8500, 68000, NULL, '2026-01-01 18:01:21', '2026-01-01 18:01:21'),
(438, 312, 39, 4, 5000, 20000, NULL, '2026-01-01 18:01:21', '2026-01-01 18:01:21'),
(439, 313, 40, 19, 11000, 209000, NULL, '2026-01-01 18:12:07', '2026-01-01 18:12:07'),
(440, 313, 43, 1, 3000, 3000, NULL, '2026-01-01 18:12:07', '2026-01-01 18:12:07'),
(441, 313, 56, 1, 8500, 8500, NULL, '2026-01-01 18:12:07', '2026-01-01 18:12:07'),
(442, 314, 38, 1, 10000, 10000, NULL, '2026-01-01 18:19:35', '2026-01-01 18:19:35'),
(443, 314, 18, 6, 20000, 120000, NULL, '2026-01-01 18:19:35', '2026-01-01 18:19:35'),
(444, 315, 5, 80, 425, 34000, NULL, '2026-01-02 11:51:17', '2026-01-02 11:51:17'),
(445, 315, 9, 1, 5000, 5000, NULL, '2026-01-02 11:51:17', '2026-01-02 11:51:17'),
(446, 316, 9, 5, 5000, 25000, 'بة شوفةل برودتمان لةبةريان برابوو', '2026-01-03 15:12:15', '2026-01-03 15:12:15'),
(447, 317, 8, 2, 88000, 176000, NULL, '2026-01-03 17:20:40', '2026-01-03 17:20:40'),
(448, 318, 9, 1, 5000, 5000, NULL, '2026-01-03 17:48:27', '2026-01-03 17:48:27'),
(449, 318, 3, 20, 425, 8500, NULL, '2026-01-03 17:48:27', '2026-01-03 17:48:27'),
(450, 318, 49, 1, 3000, 3000, NULL, '2026-01-03 17:48:27', '2026-01-03 17:48:27'),
(451, 319, 2, 1500, 425, 637500, NULL, '2026-01-03 17:56:23', '2026-01-03 17:56:23'),
(452, 319, 8, 1.5, 95000, 142500, NULL, '2026-01-03 17:56:23', '2026-01-03 17:56:23'),
(453, 319, 38, 2, 10000, 20000, NULL, '2026-01-03 17:56:23', '2026-01-03 17:56:23'),
(454, 319, 39, 1.5, 5000, 7500, NULL, '2026-01-03 17:56:23', '2026-01-03 17:56:23'),
(455, 319, 48, 2, 45000, 90000, NULL, '2026-01-03 17:56:23', '2026-01-03 17:56:23'),
(456, 319, 53, 8, 15000, 120000, NULL, '2026-01-03 17:56:23', '2026-01-03 17:56:23'),
(457, 320, 39, 1, 1000, 1000, NULL, '2026-01-03 18:20:46', '2026-01-03 18:20:46'),
(458, 321, 50, 15, 4500, 67500, 'بەشەو بردیتی', '2026-01-03 20:52:06', '2026-01-03 20:52:06'),
(459, 322, 7, 2, 98000, 196000, NULL, '2026-01-04 09:31:36', '2026-01-04 09:31:36'),
(460, 322, 38, 1, 10000, 10000, NULL, '2026-01-04 09:31:36', '2026-01-04 09:31:36'),
(461, 322, 39, 3, 5000, 15000, NULL, '2026-01-04 09:31:36', '2026-01-04 09:31:36'),
(465, 324, 11, 38.2, 5750, 219650, NULL, '2026-01-04 14:53:10', '2026-01-04 14:53:10'),
(466, 324, 10, 45.8, 4000, 183200, NULL, '2026-01-04 14:53:10', '2026-01-04 14:53:10'),
(467, 324, 39, 1, 5000, 5000, NULL, '2026-01-04 14:53:10', '2026-01-04 14:53:10'),
(468, 324, 38, 0.5, 10000, 5000, NULL, '2026-01-04 14:53:10', '2026-01-04 14:53:10'),
(469, 325, 5, 350, 425, 148750, NULL, '2026-01-04 15:19:50', '2026-01-04 15:19:50'),
(470, 325, 38, 1, 10000, 10000, NULL, '2026-01-04 15:19:50', '2026-01-04 15:19:50'),
(471, 326, 2, 2250, 400, 900000, NULL, '2026-01-04 16:11:07', '2026-01-04 16:11:07'),
(472, 326, 48, 3, 45000, 135000, NULL, '2026-01-04 16:11:07', '2026-01-04 16:11:07'),
(473, 327, 5, 650, 425, 276250, NULL, '2026-01-04 16:15:19', '2026-01-04 16:15:19'),
(474, 327, 8, 1, 95000, 95000, NULL, '2026-01-04 16:15:19', '2026-01-04 16:15:19'),
(475, 327, 38, 1, 10000, 10000, NULL, '2026-01-04 16:15:19', '2026-01-04 16:15:19'),
(476, 327, 39, 1, 5000, 5000, NULL, '2026-01-04 16:15:19', '2026-01-04 16:15:19'),
(477, 327, 48, 1, 45000, 45000, NULL, '2026-01-04 16:15:19', '2026-01-04 16:15:19'),
(478, 328, 50, 12, 4500, 54000, NULL, '2026-01-04 16:48:01', '2026-01-04 16:48:01'),
(479, 329, 2, 350, 425, 148750, NULL, '2026-01-04 18:53:08', '2026-01-04 18:53:08'),
(480, 329, 38, 1, 10000, 10000, NULL, '2026-01-04 18:53:08', '2026-01-04 18:53:08'),
(481, 330, 5, 1, 3294000, 3294000, NULL, '2026-01-05 14:39:21', '2026-01-05 14:39:21'),
(485, 332, 18, 3, 20000, 60000, NULL, '2026-01-06 10:02:26', '2026-01-06 10:02:26'),
(486, 332, 38, 2, 10000, 20000, NULL, '2026-01-06 10:02:26', '2026-01-06 10:02:26'),
(487, 333, 41, 0.235, 595, 139.825, NULL, '2026-01-06 10:13:54', '2026-01-06 10:13:54'),
(488, 333, 43, 1, 2, 2, NULL, '2026-01-06 10:13:54', '2026-01-06 10:13:54'),
(489, 333, 56, 0.2, 9, 1.8, NULL, '2026-01-06 10:13:54', '2026-01-06 10:13:54'),
(490, 333, 54, 0.25, 7, 1.75, NULL, '2026-01-06 10:13:54', '2026-01-06 10:13:54'),
(491, 333, 55, 1, 16, 16, NULL, '2026-01-06 10:13:54', '2026-01-06 10:13:54'),
(492, 334, 57, 6, 74, 444, NULL, '2026-01-06 10:24:19', '2026-01-06 10:24:19'),
(493, 334, 54, 6, 4, 24, NULL, '2026-01-06 10:24:19', '2026-01-06 10:24:19'),
(494, 334, 55, 1, 37, 37, NULL, '2026-01-06 10:24:19', '2026-01-06 10:24:19'),
(495, 335, 8, 1, 95000, 95000, NULL, '2026-01-06 10:30:48', '2026-01-06 10:30:48'),
(496, 335, 38, 1, 10000, 10000, NULL, '2026-01-06 10:30:48', '2026-01-06 10:30:48'),
(497, 335, 18, 4, 20000, 80000, NULL, '2026-01-06 10:30:48', '2026-01-06 10:30:48'),
(498, 335, 39, 1, 5000, 5000, NULL, '2026-01-06 10:30:48', '2026-01-06 10:30:48'),
(499, 336, 38, 1, 10000, 10000, NULL, '2026-01-06 10:38:43', '2026-01-06 10:38:43'),
(500, 336, 58, 4, 18500, 74000, NULL, '2026-01-06 10:38:43', '2026-01-06 10:38:43'),
(503, 338, 2, 750, 425, 318750, NULL, '2026-01-06 10:54:39', '2026-01-06 10:54:39'),
(504, 338, 48, 1, 45000, 45000, NULL, '2026-01-06 10:54:39', '2026-01-06 10:54:39'),
(505, 339, 2, 550, 425, 233750, NULL, '2026-01-06 11:03:23', '2026-01-06 11:03:23'),
(506, 339, 38, 2, 10000, 20000, NULL, '2026-01-06 11:03:23', '2026-01-06 11:03:23'),
(507, 340, 2, 2, 480000, 960000, '2000 بلوك', '2026-01-06 11:13:09', '2026-01-06 11:13:09'),
(508, 341, 5, 140, 425, 59500, NULL, '2026-01-06 11:14:14', '2026-01-06 11:14:14'),
(510, 343, 2, 60, 425, 25500, NULL, '2026-01-06 11:19:08', '2026-01-06 11:19:08'),
(511, 344, 2, 100, 425, 42500, NULL, '2026-01-06 11:22:04', '2026-01-06 11:22:04'),
(512, 344, 38, 1, 10000, 10000, NULL, '2026-01-06 11:22:04', '2026-01-06 11:22:04'),
(513, 345, 2, 500, 425, 212500, NULL, '2026-01-06 11:26:39', '2026-01-06 11:26:39'),
(514, 345, 48, 1, 65000, 65000, NULL, '2026-01-06 11:26:39', '2026-01-06 11:26:39'),
(519, 347, 2, 300, 400, 120000, NULL, '2026-01-06 11:55:31', '2026-01-06 11:55:31'),
(520, 347, 10, 4, 4000, 16000, NULL, '2026-01-06 11:55:31', '2026-01-06 11:55:31'),
(521, 347, 48, 1, 45000, 45000, NULL, '2026-01-06 11:55:31', '2026-01-06 11:55:31'),
(522, 347, 11, 1, 15000, 15000, NULL, '2026-01-06 11:55:31', '2026-01-06 11:55:31'),
(524, 349, 9, 5, 5000, 25000, NULL, '2026-01-06 12:03:32', '2026-01-06 12:03:32'),
(525, 349, 35, 6, 15000, 90000, NULL, '2026-01-06 12:03:32', '2026-01-06 12:03:32'),
(526, 349, 38, 1, 10000, 10000, NULL, '2026-01-06 12:03:32', '2026-01-06 12:03:32'),
(527, 350, 2, 300, 425, 127500, NULL, '2026-01-06 12:37:29', '2026-01-06 12:37:29'),
(528, 350, 20, 1, 23000, 23000, 'زرار', '2026-01-06 12:37:29', '2026-01-06 12:37:29'),
(529, 350, 3, 250, 425, 106250, 'زرار', '2026-01-06 12:37:29', '2026-01-06 12:37:29'),
(530, 350, 9, 6, 5000, 30000, 'زرار', '2026-01-06 12:37:29', '2026-01-06 12:37:29'),
(531, 351, 59, 0.5, 10000, 5000, NULL, '2026-01-06 13:01:33', '2026-01-06 13:01:33'),
(532, 351, 8, 1, 95000, 95000, NULL, '2026-01-06 13:01:33', '2026-01-06 13:01:33'),
(533, 351, 20, 3, 23000, 69000, NULL, '2026-01-06 13:01:33', '2026-01-06 13:01:33'),
(534, 351, 2, 350, 425, 148750, NULL, '2026-01-06 13:01:33', '2026-01-06 13:01:33'),
(535, 352, 5, 200, 0, 0, NULL, '2026-01-06 13:52:15', '2026-01-06 13:52:15'),
(536, 352, 38, 1, 0, 0, NULL, '2026-01-06 13:52:15', '2026-01-06 13:52:15'),
(537, 353, 5, 70, 425, 29750, NULL, '2026-01-06 13:53:00', '2026-01-06 13:53:00'),
(538, 354, 5, 90, 425, 38250, NULL, '2026-01-06 13:55:24', '2026-01-06 13:55:24'),
(539, 354, 37, 100, 1200, 120000, NULL, '2026-01-06 13:55:24', '2026-01-06 13:55:24'),
(540, 354, 38, 2, 10000, 20000, NULL, '2026-01-06 13:55:24', '2026-01-06 13:55:24'),
(545, 356, 40, 4.44, 570, 2530.8, NULL, '2026-01-06 14:07:15', '2026-01-06 14:07:15'),
(546, 356, 43, 20, 2, 40, NULL, '2026-01-06 14:07:15', '2026-01-06 14:07:15'),
(547, 356, 46, 8, 6, 48, NULL, '2026-01-06 14:07:15', '2026-01-06 14:07:15'),
(548, 356, 56, 3, 9, 27, NULL, '2026-01-06 14:07:15', '2026-01-06 14:07:15'),
(549, 356, 54, 4.5, 7, 31.5, NULL, '2026-01-06 14:07:15', '2026-01-06 14:07:15'),
(550, 357, 5, 170, 425, 72250, NULL, '2026-01-06 15:08:59', '2026-01-06 15:08:59'),
(551, 357, 38, 1, 15000, 15000, NULL, '2026-01-06 15:08:59', '2026-01-06 15:08:59'),
(552, 357, 11, 3, 5750, 17250, NULL, '2026-01-06 15:08:59', '2026-01-06 15:08:59'),
(553, 357, 51, 1, 3000, 3000, NULL, '2026-01-06 15:08:59', '2026-01-06 15:08:59'),
(558, 360, 2, 40, 425, 17000, 'حەرەسەکەی برڕی', '2026-01-06 18:17:26', '2026-01-06 18:17:26'),
(559, 361, 38, 1, 10000, 10000, NULL, '2026-01-06 18:19:48', '2026-01-06 18:19:48'),
(560, 361, 2, 350, 425, 148750, NULL, '2026-01-06 18:19:48', '2026-01-06 18:19:48'),
(561, 362, 4, 300, 425, 127500, NULL, '2026-01-06 18:37:40', '2026-01-06 18:37:40'),
(562, 362, 38, 1, 10000, 10000, NULL, '2026-01-06 18:37:40', '2026-01-06 18:37:40'),
(566, 364, 38, 1, 10000, 10000, NULL, '2026-01-06 19:29:00', '2026-01-06 19:29:00'),
(567, 364, 9, 5, 5000, 25000, NULL, '2026-01-06 19:29:00', '2026-01-06 19:29:00'),
(568, 364, 18, 1, 20000, 20000, NULL, '2026-01-06 19:29:00', '2026-01-06 19:29:00'),
(569, 365, 38, 1, 10000, 10000, NULL, '2026-01-06 19:56:47', '2026-01-06 19:56:47'),
(570, 365, 18, 4, 20000, 80000, NULL, '2026-01-06 19:56:47', '2026-01-06 19:56:47'),
(571, 365, 9, 10, 5000, 50000, NULL, '2026-01-06 19:56:47', '2026-01-06 19:56:47'),
(572, 365, 39, 1, 5000, 5000, NULL, '2026-01-06 19:56:47', '2026-01-06 19:56:47'),
(573, 366, 9, 5, 5000, 25000, NULL, '2026-01-07 09:50:26', '2026-01-07 09:50:26'),
(574, 366, 18, 1.5, 20000, 30000, NULL, '2026-01-07 09:50:26', '2026-01-07 09:50:26'),
(575, 366, 38, 1, 10000, 10000, NULL, '2026-01-07 09:50:26', '2026-01-07 09:50:26'),
(576, 366, 39, 1, 2000, 2000, NULL, '2026-01-07 09:50:26', '2026-01-07 09:50:26'),
(578, 337, 41, 16, 547, 8752, NULL, '2026-01-07 09:56:14', '2026-01-07 09:56:14'),
(579, 363, 41, 4, 547, 2188, NULL, '2026-01-07 09:57:31', '2026-01-07 09:57:31'),
(580, 348, 54, 0.006, 7, 0.042, NULL, '2026-01-07 10:05:55', '2026-01-07 10:05:55'),
(581, 323, 41, 2.568, 595, 1527.96, NULL, '2026-01-07 10:06:51', '2026-01-07 10:06:51'),
(582, 323, 54, 2.6, 7, 18.2, NULL, '2026-01-07 10:06:51', '2026-01-07 10:06:51'),
(583, 367, 2, 750, 415, 311250, NULL, '2026-01-07 10:33:34', '2026-01-07 10:33:34'),
(584, 367, 48, 1, 45000, 45000, NULL, '2026-01-07 10:33:34', '2026-01-07 10:33:34'),
(585, 368, 43, 1, 3000, 3000, NULL, '2026-01-07 11:17:12', '2026-01-07 11:17:12'),
(586, 368, 38, 1, 3000, 3000, 'تةكسي', '2026-01-07 11:17:12', '2026-01-07 11:17:12'),
(587, 369, 2, 700, 425, 297500, 'بو جةتو باني ماران', '2026-01-07 11:24:38', '2026-01-07 11:24:38'),
(588, 369, 3, 380, 425, 161500, 'بو نةهرو باةىقةب', '2026-01-07 11:24:38', '2026-01-07 11:24:38'),
(589, 369, 18, 3, 20000, 60000, 'زانا', '2026-01-07 11:24:38', '2026-01-07 11:24:38'),
(590, 369, 7, 1, 100000, 100000, 'بو زانا لة 26=10', '2026-01-07 11:24:38', '2026-01-07 11:24:38'),
(591, 369, 9, 7, 5000, 35000, 'بو هونةر باني ماران', '2026-01-07 11:24:38', '2026-01-07 11:24:38'),
(592, 369, 4, 150, 425, 63750, 'بو هونةر', '2026-01-07 11:24:38', '2026-01-07 11:24:38'),
(593, 369, 53, 1, 15000, 15000, 'هونةر', '2026-01-07 11:24:38', '2026-01-07 11:24:38'),
(594, 369, 59, 3, 10000, 30000, 'لة 12=11 بردراوة نةنوناوي بينةكوتين', '2026-01-07 11:24:38', '2026-01-07 11:24:38'),
(597, 370, 5, 200, 425, 85000, NULL, '2026-01-07 13:01:24', '2026-01-07 13:01:24'),
(598, 370, 38, 1, 10000, 10000, NULL, '2026-01-07 13:01:24', '2026-01-07 13:01:24'),
(599, 371, 41, 2.23, 595, 1326.85, NULL, '2026-01-07 13:28:00', '2026-01-07 13:28:00'),
(600, 371, 46, 3, 6, 18, NULL, '2026-01-07 13:28:00', '2026-01-07 13:28:00'),
(601, 371, 55, 1, 16, 16, NULL, '2026-01-07 13:28:00', '2026-01-07 13:28:00'),
(602, 371, 54, 2.5, 7, 17.5, NULL, '2026-01-07 13:28:00', '2026-01-07 13:28:00'),
(603, 371, 56, 2, 9, 18, NULL, '2026-01-07 13:28:00', '2026-01-07 13:28:00'),
(604, 371, 43, 7, 2, 14, NULL, '2026-01-07 13:28:00', '2026-01-07 13:28:00'),
(605, 372, 41, 1.186, 595, 705.67, NULL, '2026-01-07 13:44:05', '2026-01-07 13:44:05'),
(606, 372, 44, 45, 0.55, 24.75, NULL, '2026-01-07 13:44:05', '2026-01-07 13:44:05'),
(607, 372, 46, 2, 6, 12, NULL, '2026-01-07 13:44:05', '2026-01-07 13:44:05'),
(608, 372, 56, 1, 9, 9, NULL, '2026-01-07 13:44:05', '2026-01-07 13:44:05'),
(609, 372, 55, 1, 16, 16, NULL, '2026-01-07 13:44:05', '2026-01-07 13:44:05'),
(610, 372, 54, 1, 7, 7, NULL, '2026-01-07 13:44:05', '2026-01-07 13:44:05'),
(611, 342, 5, 1, 425, 425, NULL, '2026-01-07 14:37:19', '2026-01-07 14:37:19'),
(612, 373, 33, 5, 8500, 42500, NULL, '2026-01-07 15:52:52', '2026-01-07 15:52:52'),
(613, 373, 39, 1, 5000, 5000, 'شةمال', '2026-01-07 15:52:52', '2026-01-07 15:52:52'),
(614, 374, 5, 300, 425, 127500, 'بو شةوكير', '2026-01-07 16:23:28', '2026-01-07 16:23:28'),
(615, 355, 5, 1, 425, 425, NULL, '2026-01-07 16:24:18', '2026-01-07 16:24:18'),
(616, 375, 5, 20, 425, 8500, NULL, '2026-01-07 16:28:18', '2026-01-07 16:28:18'),
(617, 376, 2, 350, 425, 148750, NULL, '2026-01-07 16:29:54', '2026-01-07 16:29:54'),
(618, 376, 38, 1, 10000, 10000, NULL, '2026-01-07 16:29:54', '2026-01-07 16:29:54'),
(619, 377, 2, 350, 425, 148750, NULL, '2026-01-07 16:33:38', '2026-01-07 16:33:38'),
(620, 377, 38, 1, 10000, 10000, NULL, '2026-01-07 16:33:38', '2026-01-07 16:33:38'),
(621, 378, 38, 1, 10000, 10000, NULL, '2026-01-07 17:09:19', '2026-01-07 17:09:19'),
(622, 378, 18, 1.5, 20000, 30000, NULL, '2026-01-07 17:09:19', '2026-01-07 17:09:19'),
(623, 378, 59, 1, 10000, 10000, NULL, '2026-01-07 17:09:19', '2026-01-07 17:09:19'),
(624, 379, 9, 4, 5000, 20000, NULL, '2026-01-07 17:12:04', '2026-01-07 17:12:04');
INSERT INTO `sale_items` (`id`, `sale_id`, `product_id`, `quantity`, `unit_price`, `total_price`, `note`, `created_at`, `updated_at`) VALUES
(625, 380, 33, 2, 8500, 17000, 'شةمال', '2026-01-07 17:26:13', '2026-01-07 17:26:13'),
(626, 381, 35, 1, 100000, 100000, NULL, '2026-01-07 18:29:02', '2026-01-07 18:29:02'),
(627, 381, 53, 1, 150000, 150000, NULL, '2026-01-07 18:29:02', '2026-01-07 18:29:02'),
(628, 382, 2, 1500, 425, 637500, NULL, '2026-01-07 19:32:21', '2026-01-07 19:32:21'),
(629, 382, 48, 2, 45000, 90000, NULL, '2026-01-07 19:32:21', '2026-01-07 19:32:21'),
(630, 383, 50, 4, 4500, 18000, NULL, '2026-01-08 09:50:06', '2026-01-08 09:50:06'),
(631, 384, 50, 4, 4500, 18000, NULL, '2026-01-08 09:50:36', '2026-01-08 09:50:36'),
(632, 385, 2, 300, 415, 124500, NULL, '2026-01-08 09:58:41', '2026-01-08 09:58:41'),
(633, 385, 38, 1, 10000, 10000, NULL, '2026-01-08 09:58:41', '2026-01-08 09:58:41'),
(634, 386, 2, 200, 425, 85000, NULL, '2026-01-08 10:01:16', '2026-01-08 10:01:16'),
(635, 386, 9, 6, 5000, 30000, NULL, '2026-01-08 10:01:16', '2026-01-08 10:01:16'),
(636, 386, 37, 100, 1250, 125000, NULL, '2026-01-08 10:01:16', '2026-01-08 10:01:16'),
(637, 386, 38, 2, 10000, 20000, NULL, '2026-01-08 10:01:16', '2026-01-08 10:01:16'),
(638, 386, 39, 1, 5000, 5000, NULL, '2026-01-08 10:01:16', '2026-01-08 10:01:16'),
(639, 386, 20, 2, 23000, 46000, NULL, '2026-01-08 10:01:16', '2026-01-08 10:01:16'),
(640, 387, 2, 250, 425, 106250, 'توب عةدل', '2026-01-08 10:53:37', '2026-01-08 10:53:37'),
(641, 388, 18, 3, 20000, 60000, NULL, '2026-01-08 11:50:06', '2026-01-08 11:50:06'),
(642, 388, 38, 1, 10000, 10000, NULL, '2026-01-08 11:50:06', '2026-01-08 11:50:06'),
(643, 346, 5, 1, 425, 425, NULL, '2026-01-08 12:20:27', '2026-01-08 12:20:27'),
(644, 389, 8, 1, 95000, 95000, NULL, '2026-01-08 12:24:24', '2026-01-08 12:24:24'),
(645, 389, 38, 1, 10000, 10000, NULL, '2026-01-08 12:24:24', '2026-01-08 12:24:24'),
(646, 389, 39, 1, 5000, 5000, NULL, '2026-01-08 12:24:24', '2026-01-08 12:24:24'),
(647, 389, 18, 4, 20000, 80000, NULL, '2026-01-08 12:24:24', '2026-01-08 12:24:24'),
(648, 390, 8, 1.5, 95000, 142500, NULL, '2026-01-08 12:25:59', '2026-01-08 12:25:59'),
(649, 390, 18, 6, 20000, 120000, NULL, '2026-01-08 12:25:59', '2026-01-08 12:25:59'),
(650, 390, 38, 1.5, 10000, 15000, NULL, '2026-01-08 12:25:59', '2026-01-08 12:25:59'),
(651, 390, 39, 1.5, 5000, 7500, NULL, '2026-01-08 12:25:59', '2026-01-08 12:25:59'),
(652, 391, 9, 8, 5000, 40000, NULL, '2026-01-08 12:28:37', '2026-01-08 12:28:37'),
(653, 391, 49, 1, 30000, 30000, NULL, '2026-01-08 12:28:37', '2026-01-08 12:28:37'),
(654, 392, 2, 80, 425, 34000, 'بو هةردي', '2026-01-08 16:39:19', '2026-01-08 16:39:19'),
(655, 393, 2, 350, 425, 148750, NULL, '2026-01-08 16:42:06', '2026-01-08 16:42:06'),
(656, 393, 38, 1, 10000, 10000, NULL, '2026-01-08 16:42:06', '2026-01-08 16:42:06'),
(657, 394, 2, 350, 425, 148750, NULL, '2026-01-08 16:44:30', '2026-01-08 16:44:30'),
(658, 394, 38, 1, 10000, 10000, NULL, '2026-01-08 16:44:30', '2026-01-08 16:44:30'),
(659, 395, 18, 1.75, 20000, 35000, NULL, '2026-01-08 16:54:43', '2026-01-08 16:54:43'),
(660, 395, 59, 1, 10000, 10000, NULL, '2026-01-08 16:54:43', '2026-01-08 16:54:43'),
(661, 395, 9, 10, 5000, 50000, NULL, '2026-01-08 16:54:43', '2026-01-08 16:54:43'),
(662, 395, 38, 2, 10000, 20000, NULL, '2026-01-08 16:54:43', '2026-01-08 16:54:43'),
(663, 396, 9, 12, 5000, 60000, NULL, '2026-01-08 17:02:53', '2026-01-08 17:02:53'),
(664, 396, 18, 2, 20000, 40000, NULL, '2026-01-08 17:02:53', '2026-01-08 17:02:53'),
(665, 396, 38, 1, 10000, 10000, NULL, '2026-01-08 17:02:53', '2026-01-08 17:02:53'),
(666, 396, 12, 1, 24500, 24500, NULL, '2026-01-08 17:02:53', '2026-01-08 17:02:53'),
(667, 396, 59, 1, 10000, 10000, NULL, '2026-01-08 17:02:53', '2026-01-08 17:02:53'),
(668, 396, 39, 2, 5000, 10000, NULL, '2026-01-08 17:02:53', '2026-01-08 17:02:53'),
(669, 397, 2, 750, 425, 318750, NULL, '2026-01-08 17:50:12', '2026-01-08 17:50:12'),
(670, 397, 48, 1, 45000, 45000, NULL, '2026-01-08 17:50:12', '2026-01-08 17:50:12'),
(673, 398, 2, 750, 425, 318750, NULL, '2026-01-08 17:53:29', '2026-01-08 17:53:29'),
(674, 398, 48, 1, 110000, 110000, NULL, '2026-01-08 17:53:29', '2026-01-08 17:53:29'),
(675, 399, 3, 100, 425, 42500, NULL, '2026-01-08 18:00:41', '2026-01-08 18:00:41'),
(676, 399, 38, 1.5, 10000, 15000, NULL, '2026-01-08 18:00:41', '2026-01-08 18:00:41'),
(677, 399, 49, 0.5, 30000, 15000, NULL, '2026-01-08 18:00:41', '2026-01-08 18:00:41'),
(678, 400, 5, 100, 425, 42500, NULL, '2026-01-08 18:46:57', '2026-01-08 18:46:57'),
(679, 400, 38, 1, 10000, 10000, NULL, '2026-01-08 18:46:57', '2026-01-08 18:46:57'),
(680, 401, 2, 350, 425, 148750, NULL, '2026-01-08 18:47:56', '2026-01-08 18:47:56'),
(681, 401, 38, 1, 10000, 10000, NULL, '2026-01-08 18:47:56', '2026-01-08 18:47:56'),
(682, 402, 2, 1000, 480, 480000, NULL, '2026-01-08 18:49:50', '2026-01-08 18:49:50'),
(683, 403, 2, 750, 425, 318750, NULL, '2026-01-08 18:59:01', '2026-01-08 18:59:01'),
(684, 403, 48, 1, 45000, 45000, NULL, '2026-01-08 18:59:01', '2026-01-08 18:59:01'),
(685, 404, 8, 2, 95000, 190000, NULL, '2026-01-10 10:27:27', '2026-01-10 10:27:27'),
(686, 404, 18, 5, 20000, 100000, NULL, '2026-01-10 10:27:27', '2026-01-10 10:27:27'),
(687, 404, 39, 1, 5000, 5000, NULL, '2026-01-10 10:27:27', '2026-01-10 10:27:27'),
(688, 404, 38, 3, 10000, 30000, NULL, '2026-01-10 10:27:27', '2026-01-10 10:27:27'),
(689, 405, 9, 2, 5000, 10000, NULL, '2026-01-10 10:29:30', '2026-01-10 10:29:30'),
(690, 406, 2, 350, 425, 148750, NULL, '2026-01-10 10:44:53', '2026-01-10 10:44:53'),
(691, 406, 38, 1, 10000, 10000, NULL, '2026-01-10 10:44:53', '2026-01-10 10:44:53'),
(692, 407, 8, 1, 95000, 95000, NULL, '2026-01-12 11:52:58', '2026-01-12 11:52:58'),
(693, 407, 38, 1, 15000, 15000, NULL, '2026-01-12 11:52:58', '2026-01-12 11:52:58'),
(694, 407, 39, 1, 5000, 5000, NULL, '2026-01-12 11:52:58', '2026-01-12 11:52:58'),
(695, 407, 20, 6, 23000, 138000, NULL, '2026-01-12 11:52:58', '2026-01-12 11:52:58'),
(696, 408, 50, 4, 4500, 18000, NULL, '2026-01-12 11:55:16', '2026-01-12 11:55:16'),
(697, 408, 51, 4, 3000, 12000, NULL, '2026-01-12 11:55:16', '2026-01-12 11:55:16'),
(698, 409, 2, 430, 425, 182750, 'بو فةرعان مةنتك  نةخوشخانة', '2026-01-12 12:01:46', '2026-01-12 12:01:46'),
(699, 409, 18, 2, 20000, 40000, NULL, '2026-01-12 12:01:46', '2026-01-12 12:01:46'),
(700, 409, 9, 8, 5000, 40000, NULL, '2026-01-12 12:01:46', '2026-01-12 12:01:46'),
(701, 409, 41, 1, 6000, 6000, 'نةخوشخانةي بيشمةركة', '2026-01-12 12:01:46', '2026-01-12 12:01:46'),
(702, 410, 3, 6, 15000, 90000, 'كونجي 60 يي بو احمد كوردة', '2026-01-12 12:10:37', '2026-01-12 12:10:37'),
(703, 410, 4, 1, 10000, 10000, 'كونجي 60يي شكاو بوو بة 10000 حيساب كراوة بو احمد كوردة', '2026-01-12 12:10:37', '2026-01-12 12:10:37'),
(704, 411, 51, 25, 3000, 75000, NULL, '2026-01-12 14:33:34', '2026-01-12 14:33:34'),
(705, 412, 5, 160, 425, 68000, 'بو عبدوولة', '2026-01-12 14:35:05', '2026-01-12 14:35:05'),
(706, 413, 5, 110, 425, 46750, NULL, '2026-01-12 15:12:55', '2026-01-12 15:12:55'),
(707, 413, 18, 1, 20000, 20000, NULL, '2026-01-12 15:12:55', '2026-01-12 15:12:55'),
(708, 413, 38, 1, 10000, 10000, NULL, '2026-01-12 15:12:55', '2026-01-12 15:12:55'),
(709, 414, 43, 2, 2, 4, NULL, '2026-01-12 16:30:31', '2026-01-12 16:30:31'),
(710, 414, 40, 0.478, 580, 277.24, NULL, '2026-01-12 16:30:31', '2026-01-12 16:30:31'),
(711, 414, 55, 1, 16, 16, NULL, '2026-01-12 16:30:31', '2026-01-12 16:30:31'),
(712, 414, 54, 1, 7, 7, NULL, '2026-01-12 16:30:31', '2026-01-12 16:30:31'),
(713, 415, 38, 1, 15000, 15000, NULL, '2026-01-13 12:26:59', '2026-01-13 12:26:59'),
(714, 416, 38, 1, 10000, 10000, NULL, '2026-01-13 12:27:50', '2026-01-13 12:27:50'),
(715, 416, 58, 4, 18500, 74000, NULL, '2026-01-13 12:27:50', '2026-01-13 12:27:50'),
(716, 416, 53, 2, 15000, 30000, NULL, '2026-01-13 12:27:50', '2026-01-13 12:27:50'),
(717, 417, 51, 4, 3000, 12000, NULL, '2026-01-14 14:39:38', '2026-01-14 14:39:38'),
(718, 418, 41, 0.952, 595, 566.44, NULL, '2026-01-15 13:30:39', '2026-01-15 13:30:39'),
(719, 418, 43, 1, 2, 2, NULL, '2026-01-15 13:30:39', '2026-01-15 13:30:39'),
(720, 418, 54, 1, 7, 7, NULL, '2026-01-15 13:30:39', '2026-01-15 13:30:39'),
(721, 418, 55, 1, 16, 16, NULL, '2026-01-15 13:30:40', '2026-01-15 13:30:40'),
(722, 419, 2, 35, 425, 14875, 'كاك فرهاد بو سةر ئاو', '2026-01-15 16:08:00', '2026-01-15 16:08:00'),
(723, 420, 2, 125, 425, 53125, 'كاك فرهاد بو بةروةردة', '2026-01-15 16:29:28', '2026-01-15 16:29:28'),
(724, 421, 2, 75, 425, 31875, 'كاك فرهاد بو فةرماندة', '2026-01-15 16:30:36', '2026-01-15 16:30:36'),
(725, 422, 2, 500, 425, 212500, 'كاك هةلكورد لة 20=12=2026', '2026-01-15 16:31:52', '2026-01-15 16:31:52'),
(726, 423, 2, 60, 425, 25500, 'كاك فرهاد بو فريد جةميلي', '2026-01-15 16:33:34', '2026-01-15 16:33:34'),
(727, 423, 38, 1, 10000, 10000, NULL, '2026-01-15 16:33:34', '2026-01-15 16:33:34'),
(728, 424, 41, 1.974, 585, 1154.79, NULL, '2026-01-15 16:45:48', '2026-01-15 16:45:48'),
(729, 424, 43, 6, 2, 12, NULL, '2026-01-15 16:45:48', '2026-01-15 16:45:48'),
(730, 424, 44, 15, 0.68, 10.2, NULL, '2026-01-15 16:45:48', '2026-01-15 16:45:48'),
(731, 424, 55, 1, 16, 16, NULL, '2026-01-15 16:45:48', '2026-01-15 16:45:48'),
(732, 424, 54, 2, 7, 14, NULL, '2026-01-15 16:45:48', '2026-01-15 16:45:48'),
(733, 425, 2, 1500, 425, 637500, NULL, '2026-01-15 16:48:14', '2026-01-15 16:48:14'),
(734, 425, 48, 2, 45000, 90000, NULL, '2026-01-15 16:48:14', '2026-01-15 16:48:14'),
(735, 426, 40, 0.444, 580, 257.52, 'بو عبدوللة برازاي', '2026-01-17 15:11:27', '2026-01-17 15:11:27'),
(736, 426, 54, 1, 7, 7, NULL, '2026-01-17 15:11:27', '2026-01-17 15:11:27'),
(737, 427, 18, 6, 20000, 120000, NULL, '2026-01-17 15:11:53', '2026-01-17 15:11:53'),
(738, 427, 38, 1, 10000, 10000, NULL, '2026-01-17 15:11:53', '2026-01-17 15:11:53'),
(739, 428, 39, 1, 5000, 5000, NULL, '2026-01-17 15:13:01', '2026-01-17 15:13:01'),
(740, 428, 58, 2, 18500, 37000, NULL, '2026-01-17 15:13:01', '2026-01-17 15:13:01'),
(741, 428, 8, 1, 95000, 95000, NULL, '2026-01-17 15:13:01', '2026-01-17 15:13:01'),
(742, 429, 9, 5, 5000, 25000, NULL, '2026-01-17 15:13:22', '2026-01-17 15:13:22'),
(743, 430, 9, 12, 5000, 60000, NULL, '2026-01-17 15:14:18', '2026-01-17 15:14:18'),
(744, 430, 38, 1.5, 10000, 15000, NULL, '2026-01-17 15:14:18', '2026-01-17 15:14:18'),
(745, 430, 39, 1, 5000, 5000, NULL, '2026-01-17 15:14:18', '2026-01-17 15:14:18'),
(746, 430, 20, 1.5, 23000, 34500, NULL, '2026-01-17 15:14:18', '2026-01-17 15:14:18'),
(747, 431, 46, 2, 8500, 17000, NULL, '2026-01-17 15:17:02', '2026-01-17 15:17:02'),
(748, 431, 56, 2, 8500, 17000, NULL, '2026-01-17 15:17:02', '2026-01-17 15:17:02'),
(749, 432, 7, 10, 98000, 980000, NULL, '2026-01-17 15:18:05', '2026-01-17 15:18:05'),
(750, 433, 9, 10, 5000, 50000, NULL, '2026-01-17 15:20:13', '2026-01-17 15:20:13'),
(751, 433, 59, 1, 10000, 10000, NULL, '2026-01-17 15:20:13', '2026-01-17 15:20:13'),
(752, 433, 18, 1.5, 20000, 30000, NULL, '2026-01-17 15:20:13', '2026-01-17 15:20:13'),
(753, 433, 38, 1, 10000, 10000, NULL, '2026-01-17 15:20:13', '2026-01-17 15:20:13'),
(754, 434, 2, 250, 425, 106250, NULL, '2026-01-17 15:20:47', '2026-01-17 15:20:47'),
(755, 434, 38, 1, 10000, 10000, NULL, '2026-01-17 15:20:47', '2026-01-17 15:20:47'),
(756, 435, 9, 1, 5000, 5000, NULL, '2026-01-18 10:29:36', '2026-01-18 10:29:36'),
(757, 436, 43, 1, 3000, 3000, NULL, '2026-01-18 10:30:38', '2026-01-18 10:30:38'),
(758, 437, 50, 18, 4500, 81000, NULL, '2026-01-18 10:31:31', '2026-01-18 10:31:31'),
(762, 439, 8, 1, 95000, 95000, NULL, '2026-01-18 10:41:34', '2026-01-18 10:41:34'),
(763, 439, 38, 1, 10000, 10000, NULL, '2026-01-18 10:41:34', '2026-01-18 10:41:34'),
(764, 439, 39, 1, 5000, 5000, NULL, '2026-01-18 10:41:34', '2026-01-18 10:41:34'),
(765, 440, 9, 10, 5000, 50000, 'نةخوشخانة ي حةماموك', '2026-01-18 10:44:03', '2026-01-18 10:44:03'),
(766, 440, 49, 2, 30000, 60000, 'نةخحوشخانةي حةماموك', '2026-01-18 10:44:03', '2026-01-18 10:44:03'),
(767, 441, 9, 4, 5000, 20000, NULL, '2026-01-18 10:45:42', '2026-01-18 10:45:42'),
(768, 441, 38, 1, 10000, 10000, NULL, '2026-01-18 10:45:42', '2026-01-18 10:45:42'),
(769, 442, 18, 5, 20000, 100000, NULL, '2026-01-18 10:47:17', '2026-01-18 10:47:17'),
(770, 442, 38, 1, 10000, 10000, NULL, '2026-01-18 10:47:17', '2026-01-18 10:47:17'),
(771, 442, 2, 750, 425, 318750, NULL, '2026-01-18 10:47:17', '2026-01-18 10:47:17'),
(772, 442, 48, 1, 45000, 45000, NULL, '2026-01-18 10:47:17', '2026-01-18 10:47:17'),
(775, 444, 40, 1, 314000, 314000, '20دانة 10مليم 6=16مليم و 5باركردن 15كواستنةوةو', '2026-01-18 11:24:06', '2026-01-18 11:24:06'),
(776, 445, 2, 500, 425, 212500, 'كاك ئاواربة داواي كردووة 07518453093', '2026-01-18 11:28:41', '2026-01-18 11:28:41'),
(777, 445, 38, 2, 10000, 20000, NULL, '2026-01-18 11:28:41', '2026-01-18 11:28:41'),
(778, 446, 9, 8, 5000, 40000, NULL, '2026-01-18 11:32:01', '2026-01-18 11:32:01'),
(779, 446, 18, 3, 20000, 60000, NULL, '2026-01-18 11:32:01', '2026-01-18 11:32:01'),
(780, 446, 58, 15, 18500, 277500, NULL, '2026-01-18 11:32:01', '2026-01-18 11:32:01'),
(781, 446, 38, 1, 10000, 10000, NULL, '2026-01-18 11:32:01', '2026-01-18 11:32:01'),
(782, 446, 39, 1, 5000, 5000, NULL, '2026-01-18 11:32:01', '2026-01-18 11:32:01'),
(783, 447, 9, 10, 5000, 50000, NULL, '2026-01-18 12:25:16', '2026-01-18 12:25:16'),
(784, 448, 2, 750, 425, 318750, NULL, '2026-01-18 12:26:34', '2026-01-18 12:26:34'),
(785, 448, 48, 1, 45000, 45000, NULL, '2026-01-18 12:26:34', '2026-01-18 12:26:34'),
(786, 449, 38, 0.5, 10000, 5000, NULL, '2026-01-18 13:08:36', '2026-01-18 13:08:36'),
(787, 450, 2, 1500, 425, 637500, NULL, '2026-01-18 13:23:11', '2026-01-18 13:23:11'),
(788, 450, 48, 2, 45000, 90000, NULL, '2026-01-18 13:23:11', '2026-01-18 13:23:11'),
(789, 451, 2, 1500, 425, 637500, NULL, '2026-01-19 11:03:27', '2026-01-19 11:03:27'),
(790, 451, 48, 2, 45000, 90000, NULL, '2026-01-19 11:03:27', '2026-01-19 11:03:27'),
(791, 452, 43, 2, 3000, 6000, NULL, '2026-01-19 11:38:27', '2026-01-19 11:38:27'),
(792, 453, 9, 2, 5000, 10000, 'ماموستا يوسف بردي', '2026-01-19 11:38:57', '2026-01-19 11:38:57'),
(793, 454, 5, 1, 425, 425, '22100000\nواسلكراوة بةدةستي عمر', '2026-01-19 16:54:33', '2026-01-19 16:54:33'),
(794, 455, 33, 7, 8500, 59500, NULL, '2026-01-20 11:30:53', '2026-01-20 11:30:53'),
(795, 455, 38, 1, 10000, 10000, NULL, '2026-01-20 11:30:53', '2026-01-20 11:30:53'),
(796, 455, 39, 2, 5000, 10000, NULL, '2026-01-20 11:30:53', '2026-01-20 11:30:53'),
(797, 456, 2, 250, 425, 106250, 'ئاوالرة داواي كردووة', '2026-01-20 11:44:16', '2026-01-20 11:44:16'),
(798, 456, 38, 1, 10000, 10000, NULL, '2026-01-20 11:44:16', '2026-01-20 11:44:16'),
(799, 457, 9, 1, 5000, 5000, NULL, '2026-01-20 11:45:45', '2026-01-20 11:45:45'),
(802, 459, 41, 8, 547, 4376, NULL, '2026-01-20 12:11:39', '2026-01-20 12:11:39'),
(803, 460, 48, 1, 60000, 60000, NULL, '2026-01-20 15:40:01', '2026-01-20 15:40:01'),
(804, 443, 2, 750, 410, 307500, NULL, '2026-01-20 15:44:27', '2026-01-20 15:44:27'),
(805, 461, 9, 10, 5000, 50000, NULL, '2026-01-20 15:54:59', '2026-01-20 15:54:59'),
(806, 461, 18, 2, 20000, 40000, NULL, '2026-01-20 15:54:59', '2026-01-20 15:54:59'),
(807, 461, 2, 600, 425, 255000, 'لة 1=12', '2026-01-20 15:54:59', '2026-01-20 15:54:59'),
(808, 461, 40, 13, 12000, 156000, '5=12', '2026-01-20 15:54:59', '2026-01-20 15:54:59'),
(809, 462, 2, 250, 425, 106250, NULL, '2026-01-20 17:58:04', '2026-01-20 17:58:04'),
(810, 462, 38, 1, 10000, 10000, NULL, '2026-01-20 17:58:04', '2026-01-20 17:58:04'),
(811, 463, 18, 3, 20000, 60000, NULL, '2026-01-20 18:12:13', '2026-01-20 18:12:13'),
(812, 463, 38, 12, 10000, 120000, NULL, '2026-01-20 18:12:13', '2026-01-20 18:12:13'),
(813, 458, 8, 1, 92000, 92000, NULL, '2026-01-20 18:12:56', '2026-01-20 18:12:56'),
(814, 458, 39, 0.5, 5000, 2500, NULL, '2026-01-20 18:12:56', '2026-01-20 18:12:56'),
(815, 464, 5, 1, 2023000, 2023000, NULL, '2026-01-20 18:22:15', '2026-01-20 18:22:15'),
(816, 465, 9, 13, 5000, 65000, NULL, '2026-01-21 15:57:25', '2026-01-21 15:57:25'),
(817, 466, 9, 4, 5000, 20000, 'بو قاسم', '2026-01-21 16:01:13', '2026-01-21 16:01:13'),
(818, 466, 2, 300, 425, 127500, 'قاسم', '2026-01-21 16:01:13', '2026-01-21 16:01:13'),
(819, 466, 3, 1, 425, 425, NULL, '2026-01-21 16:01:14', '2026-01-21 16:01:14'),
(820, 467, 7, 1, 98000, 98000, NULL, '2026-01-21 16:03:09', '2026-01-21 16:03:09'),
(821, 467, 38, 1, 10000, 10000, NULL, '2026-01-21 16:03:09', '2026-01-21 16:03:09'),
(822, 467, 39, 1, 5000, 5000, NULL, '2026-01-21 16:03:09', '2026-01-21 16:03:09'),
(823, 467, 49, 1.5, 30000, 45000, NULL, '2026-01-21 16:03:09', '2026-01-21 16:03:09'),
(824, 468, 5, 12, 425, 5100, NULL, '2026-01-21 16:09:27', '2026-01-21 16:09:27'),
(825, 469, 2, 1000, 450, 450000, 'مةريوان بردي بوي لة 3=2=2025', '2026-01-21 16:19:41', '2026-01-21 16:19:41'),
(826, 469, 9, 8, 5500, 44000, NULL, '2026-01-21 16:19:41', '2026-01-21 16:19:41'),
(827, 469, 17, 2, 22500, 45000, NULL, '2026-01-21 16:19:41', '2026-01-21 16:19:41'),
(828, 469, 3, 70, 425, 29750, 'لة 20=1=2026\nبارةي 2كيسةكةي داوة', '2026-01-21 16:19:41', '2026-01-21 16:19:41'),
(829, 470, 9, 10, 5000, 50000, NULL, '2026-01-21 17:37:41', '2026-01-21 17:37:41'),
(830, 470, 38, 1, 10000, 10000, NULL, '2026-01-21 17:37:41', '2026-01-21 17:37:41'),
(831, 470, 39, 1, 3000, 3000, NULL, '2026-01-21 17:37:41', '2026-01-21 17:37:41'),
(832, 471, 9, 1, 5000, 5000, NULL, '2026-01-21 17:38:34', '2026-01-21 17:38:34'),
(833, 472, 39, 1, 7000, 7000, NULL, '2026-01-21 18:42:04', '2026-01-21 18:42:04'),
(834, 473, 2, 430, 425, 182750, NULL, '2026-01-22 11:09:45', '2026-01-22 11:09:45'),
(835, 473, 18, 2, 20000, 40000, NULL, '2026-01-22 11:09:45', '2026-01-22 11:09:45'),
(836, 473, 38, 2, 10000, 20000, NULL, '2026-01-22 11:09:45', '2026-01-22 11:09:45'),
(837, 473, 9, 8, 5000, 40000, NULL, '2026-01-22 11:09:45', '2026-01-22 11:09:45'),
(838, 473, 39, 1, 3000, 3000, NULL, '2026-01-22 11:09:45', '2026-01-22 11:09:45'),
(839, 474, 2, 300, 425, 127500, NULL, '2026-01-22 12:06:51', '2026-01-22 12:06:51'),
(840, 475, 41, 1, 1081, 1081, NULL, '2026-01-22 13:46:29', '2026-01-22 13:46:29'),
(887, 484, 39, 6, 5000, 30000, NULL, '2026-01-24 09:22:45', '2026-01-24 09:22:45'),
(888, 484, 38, 1, 233000, 233000, NULL, '2026-01-24 09:22:45', '2026-01-24 09:22:45'),
(889, 484, 7, 16, 92000, 1472000, NULL, '2026-01-24 09:22:45', '2026-01-24 09:22:45'),
(890, 484, 52, 4, 9000, 36000, NULL, '2026-01-24 09:22:45', '2026-01-24 09:22:45'),
(891, 484, 53, 14, 15000, 210000, NULL, '2026-01-24 09:22:45', '2026-01-24 09:22:45'),
(892, 484, 8, 3, 95000, 285000, NULL, '2026-01-24 09:22:45', '2026-01-24 09:22:45'),
(893, 485, 50, 5, 4500, 22500, NULL, '2026-01-24 11:05:20', '2026-01-24 11:05:20'),
(895, 487, 5, 25, 425, 10625, NULL, '2026-01-24 12:37:59', '2026-01-24 12:37:59'),
(896, 487, 9, 2, 5000, 10000, NULL, '2026-01-24 12:37:59', '2026-01-24 12:37:59'),
(897, 487, 49, 0.5, 30000, 15000, NULL, '2026-01-24 12:37:59', '2026-01-24 12:37:59'),
(898, 488, 51, 6, 3000, 18000, NULL, '2026-01-24 12:39:17', '2026-01-24 12:39:17'),
(899, 489, 53, 1, 145000, 145000, NULL, '2026-01-24 13:43:07', '2026-01-24 13:43:07'),
(900, 52, 5, 1, 425, 425, NULL, '2026-01-24 14:58:06', '2026-01-24 14:58:06'),
(901, 483, 5, 1, 425, 425, NULL, '2026-01-24 14:58:29', '2026-01-24 14:58:29'),
(910, 490, 33, 18, 15000, 270000, NULL, '2026-01-24 15:13:58', '2026-01-24 15:13:58'),
(911, 490, 39, 6, 5000, 30000, NULL, '2026-01-24 15:13:58', '2026-01-24 15:13:58'),
(912, 490, 5, 3650, 425, 1551250, NULL, '2026-01-24 15:13:58', '2026-01-24 15:13:58'),
(913, 490, 38, 1, 233000, 233000, NULL, '2026-01-24 15:13:58', '2026-01-24 15:13:58'),
(914, 490, 7, 16, 92000, 1472000, NULL, '2026-01-24 15:13:58', '2026-01-24 15:13:58'),
(915, 490, 52, 2, 9000, 18000, NULL, '2026-01-24 15:13:58', '2026-01-24 15:13:58'),
(916, 490, 53, 14, 15000, 210000, NULL, '2026-01-24 15:13:58', '2026-01-24 15:13:58'),
(917, 490, 8, 3, 88000, 264000, NULL, '2026-01-24 15:13:58', '2026-01-24 15:13:58'),
(918, 491, 9, 2, 5000, 10000, NULL, '2026-01-24 15:24:45', '2026-01-24 15:24:45'),
(919, 491, 59, 0.5, 10000, 5000, NULL, '2026-01-24 15:24:45', '2026-01-24 15:24:45'),
(920, 491, 18, 0.5, 20000, 10000, NULL, '2026-01-24 15:24:45', '2026-01-24 15:24:45'),
(921, 492, 5, 1, 1995000, 1995000, NULL, '2026-01-24 18:31:40', '2026-01-24 18:31:40'),
(922, 493, 50, 17, 4500, 76500, NULL, '2026-01-24 18:52:39', '2026-01-24 18:52:39'),
(923, 494, 50, 4, 4500, 18000, NULL, '2026-01-24 23:39:09', '2026-01-24 23:39:09'),
(924, 495, 3, 25, 425, 10625, NULL, '2026-01-25 10:32:41', '2026-01-25 10:32:41'),
(925, 496, 9, 5, 5000, 25000, NULL, '2026-01-25 10:35:31', '2026-01-25 10:35:31'),
(926, 496, 18, 2, 20000, 40000, NULL, '2026-01-25 10:35:31', '2026-01-25 10:35:31'),
(927, 497, 2, 780, 400, 312000, NULL, '2026-01-25 10:38:05', '2026-01-25 10:38:05'),
(928, 497, 48, 1, 60000, 60000, NULL, '2026-01-25 10:38:05', '2026-01-25 10:38:05'),
(929, 331, 6, 1, 94000, 94000, NULL, '2026-01-25 10:51:44', '2026-01-25 10:51:44'),
(930, 331, 38, 1, 6000, 6000, NULL, '2026-01-25 10:51:44', '2026-01-25 10:51:44'),
(931, 331, 39, 3, 5000, 15000, NULL, '2026-01-25 10:51:44', '2026-01-25 10:51:44'),
(932, 438, 48, 3, 35000, 105000, NULL, '2026-01-25 10:53:22', '2026-01-25 10:53:22'),
(933, 438, 9, 1, 5000, 5000, NULL, '2026-01-25 10:53:22', '2026-01-25 10:53:22'),
(934, 498, 2, 2250, 400, 900000, NULL, '2026-01-25 10:53:47', '2026-01-25 10:53:47'),
(935, 499, 5, 6, 425, 2550, NULL, '2026-01-25 12:29:39', '2026-01-25 12:29:39'),
(936, 499, 59, 2, 10000, 20000, NULL, '2026-01-25 12:29:39', '2026-01-25 12:29:39'),
(937, 499, 18, 2, 20000, 40000, NULL, '2026-01-25 12:29:39', '2026-01-25 12:29:39'),
(938, 499, 39, 1, 2000, 2000, NULL, '2026-01-25 12:29:39', '2026-01-25 12:29:39'),
(939, 499, 38, 1, 10000, 10000, NULL, '2026-01-25 12:29:39', '2026-01-25 12:29:39'),
(940, 499, 9, 7, 5000, 35000, NULL, '2026-01-25 12:29:39', '2026-01-25 12:29:39'),
(941, 500, 7, 4, 98000, 392000, NULL, '2026-01-25 12:38:49', '2026-01-25 12:38:49'),
(942, 500, 38, 1, 10000, 10000, NULL, '2026-01-25 12:38:49', '2026-01-25 12:38:49'),
(943, 500, 39, 2, 5000, 10000, 'بس باركردن', '2026-01-25 12:38:49', '2026-01-25 12:38:49'),
(944, 501, 39, 1, 30000, 30000, 'شوفةل بو سةرخستني بلوك تانكي و جةو', '2026-01-25 13:07:48', '2026-01-25 13:07:48'),
(945, 502, 5, 1, 335000, 335000, 'بة غةلةنت لةسةر حاجي كةريم لةكةل ئي كاك هةردي تيكةل بوو', '2026-01-25 13:12:44', '2026-01-25 13:12:44'),
(946, 503, 38, 1, 45000, 45000, 'حاجي وسو', '2026-01-25 15:01:19', '2026-01-25 15:01:19'),
(947, 503, 39, 2, 5000, 10000, NULL, '2026-01-25 15:01:19', '2026-01-25 15:01:19'),
(948, 503, 12, 8, 24500, 196000, 'حاجي وسو', '2026-01-25 15:01:19', '2026-01-25 15:01:19'),
(949, 503, 2, 800, 425, 340000, NULL, '2026-01-25 15:01:19', '2026-01-25 15:01:19'),
(950, 503, 17, 6, 22500, 135000, NULL, '2026-01-25 15:01:19', '2026-01-25 15:01:19'),
(951, 504, 12, 10, 24500, 245000, NULL, '2026-01-25 15:02:13', '2026-01-25 15:02:13'),
(952, 504, 39, 1, 5000, 5000, NULL, '2026-01-25 15:02:13', '2026-01-25 15:02:13'),
(953, 504, 38, 1, 15000, 15000, 'هةيبةسولتان', '2026-01-25 15:02:13', '2026-01-25 15:02:13'),
(954, 244, 3, 1, 1, 1, NULL, '2026-01-25 15:04:33', '2026-01-25 15:04:33'),
(955, 505, 6, 3, 102000, 306000, 'لة 6=11', '2026-01-25 15:05:54', '2026-01-25 15:05:54'),
(956, 505, 11, 21, 5750, 120750, '6=11', '2026-01-25 15:05:54', '2026-01-25 15:05:54'),
(957, 505, 39, 3, 5000, 15000, NULL, '2026-01-25 15:05:54', '2026-01-25 15:05:54'),
(958, 505, 38, 1, 10000, 10000, NULL, '2026-01-25 15:05:54', '2026-01-25 15:05:54'),
(959, 506, 7, 14, 98000, 1372000, 'بة دوو جار بوويي جووة لة 26-27=11', '2026-01-25 15:08:49', '2026-01-25 15:08:49'),
(960, 506, 39, 14, 5000, 70000, NULL, '2026-01-25 15:08:49', '2026-01-25 15:08:49'),
(961, 506, 38, 2, 10000, 20000, NULL, '2026-01-25 15:08:49', '2026-01-25 15:08:49'),
(962, 507, 9, 1, 5000, 5000, NULL, '2026-01-25 16:19:56', '2026-01-25 16:19:56'),
(963, 508, 39, 1, 500, 500, 'بو كةرانةوةو داكرتن و باركردن', '2026-01-25 16:21:13', '2026-01-25 16:21:13'),
(964, 509, 9, 2, 5000, 10000, NULL, '2026-01-25 16:29:10', '2026-01-25 16:29:10'),
(965, 510, 11, 8, 5750, 46000, NULL, '2026-01-25 16:31:42', '2026-01-25 16:31:42'),
(966, 511, 9, 15, 5000, 75000, 'نةخوشخانةي حةماموك', '2026-01-26 13:21:12', '2026-01-26 13:21:12'),
(967, 511, 18, 0.5, 20000, 10000, NULL, '2026-01-26 13:21:12', '2026-01-26 13:21:12'),
(968, 511, 59, 1.5, 10000, 15000, NULL, '2026-01-26 13:21:12', '2026-01-26 13:21:12'),
(969, 512, 40, 0.7, 580, 406, NULL, '2026-01-26 13:26:43', '2026-01-26 13:26:43'),
(970, 512, 43, 7, 2, 14, NULL, '2026-01-26 13:26:43', '2026-01-26 13:26:43'),
(971, 512, 54, 1, 7, 7, NULL, '2026-01-26 13:26:43', '2026-01-26 13:26:43'),
(972, 512, 55, 1, 16, 16, NULL, '2026-01-26 13:26:43', '2026-01-26 13:26:43'),
(973, 513, 44, 350, 0.55, 192.5, NULL, '2026-01-26 13:28:19', '2026-01-26 13:28:19'),
(974, 514, 8, 2, 94000, 188000, NULL, '2026-01-26 13:41:19', '2026-01-26 13:41:19'),
(975, 514, 38, 1, 10000, 10000, NULL, '2026-01-26 13:41:19', '2026-01-26 13:41:19'),
(976, 515, 39, 3, 5000, 15000, NULL, '2026-01-26 13:42:40', '2026-01-26 13:42:40'),
(977, 516, 2, 750, 425, 318750, NULL, '2026-01-26 13:43:16', '2026-01-26 13:43:16'),
(978, 516, 48, 1, 45000, 45000, NULL, '2026-01-26 13:43:16', '2026-01-26 13:43:16'),
(979, 517, 9, 9, 5000, 45000, NULL, '2026-01-26 13:45:19', '2026-01-26 13:45:19'),
(980, 518, 9, 6, 5000, 30000, NULL, '2026-01-26 13:46:08', '2026-01-26 13:46:08'),
(981, 518, 53, 1.5, 15000, 22500, NULL, '2026-01-26 13:46:08', '2026-01-26 13:46:08'),
(982, 519, 8, 1, 95000, 95000, NULL, '2026-01-26 13:46:56', '2026-01-26 13:46:56'),
(983, 519, 38, 1, 10000, 10000, NULL, '2026-01-26 13:46:56', '2026-01-26 13:46:56'),
(984, 519, 18, 3, 20000, 60000, NULL, '2026-01-26 13:46:56', '2026-01-26 13:46:56'),
(985, 519, 39, 1, 5000, 5000, NULL, '2026-01-26 13:46:56', '2026-01-26 13:46:56'),
(991, 520, 40, 3.922, 555, 2176.71, NULL, '2026-01-26 13:57:09', '2026-01-26 13:57:09'),
(992, 520, 43, 4, 2, 8, NULL, '2026-01-26 13:57:09', '2026-01-26 13:57:09'),
(993, 520, 44, 200, 0.55, 110, NULL, '2026-01-26 13:57:09', '2026-01-26 13:57:09'),
(994, 520, 55, 1, 16, 16, NULL, '2026-01-26 13:57:09', '2026-01-26 13:57:09'),
(995, 520, 54, 4.5, 7, 31.5, NULL, '2026-01-26 13:57:09', '2026-01-26 13:57:09'),
(996, 521, 5, 1150, 413, 474950, NULL, '2026-01-26 14:00:31', '2026-01-26 14:00:31'),
(997, 522, 5, 1600, 400, 640000, NULL, '2026-01-26 14:04:26', '2026-01-26 14:04:26'),
(998, 523, 40, 0.7, 580, 406, NULL, '2026-01-26 14:07:30', '2026-01-26 14:07:30'),
(999, 523, 44, 350, 0.55, 192.5, NULL, '2026-01-26 14:07:30', '2026-01-26 14:07:30'),
(1000, 523, 54, 1, 7, 7, NULL, '2026-01-26 14:07:30', '2026-01-26 14:07:30'),
(1001, 523, 55, 1, 16, 16, NULL, '2026-01-26 14:07:30', '2026-01-26 14:07:30'),
(1002, 523, 43, 7, 2, 14, NULL, '2026-01-26 14:07:30', '2026-01-26 14:07:30'),
(1003, 524, 5, 70, 400, 28000, 'برايم بردي', '2026-01-26 14:16:12', '2026-01-26 14:16:12'),
(1004, 525, 9, 2, 5000, 10000, NULL, '2026-01-26 14:21:12', '2026-01-26 14:21:12'),
(1005, 525, 18, 0.4, 20000, 8000, NULL, '2026-01-26 14:21:12', '2026-01-26 14:21:12'),
(1007, 526, 41, 4, 545, 2180, NULL, '2026-01-26 15:29:33', '2026-01-26 15:29:33'),
(1008, 527, 41, 20, 547, 10940, '5=1 تا 6=1', '2026-01-26 15:35:42', '2026-01-26 15:35:42'),
(1009, 527, 40, 4, 545, 2180, NULL, '2026-01-26 15:35:42', '2026-01-26 15:35:42');

-- --------------------------------------------------------

--
-- Table structure for table `sessions`
--

CREATE TABLE `sessions` (
  `id` varchar(255) NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `ip_address` varchar(45) DEFAULT NULL,
  `user_agent` text DEFAULT NULL,
  `payload` longtext NOT NULL,
  `last_activity` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `sessions`
--

INSERT INTO `sessions` (`id`, `user_id`, `ip_address`, `user_agent`, `payload`, `last_activity`) VALUES
('11BBEYEFETZx9Idb13MQzVQGnhh1jqLgWi4jdNSI', 3, '204.154.201.72', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 Safari/537.36', 'YTo0OntzOjY6Il90b2tlbiI7czo0MDoiOTY5dGlYYjd5QTNYUmR6Z2VpclRMVHJ1WVJOSWhxdHE2Vm9YSGVQcSI7czo1MDoibG9naW5fd2ViXzU5YmEzNmFkZGMyYjJmOTQwMTU4MGYwMTRjN2Y1OGVhNGUzMDk4OWQiO2k6MztzOjY6Il9mbGFzaCI7YToyOntzOjM6Im5ldyI7YTowOnt9czozOiJvbGQiO2E6MDp7fX1zOjk6Il9wcmV2aW91cyI7YToyOntzOjM6InVybCI7czoyOToiaHR0cHM6Ly9hYXJ5YW5uLmNvbS9jdXN0b21lcnMiO3M6NToicm91dGUiO3M6MTU6ImN1c3RvbWVycy5pbmRleCI7fX0=', 1769437156),
('1ix2KxFbftk1I5M7tuz4GqO7oi8Wr4z8iqVlBqBP', NULL, '67.205.171.37', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.124 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiMkY5ZEtqTzl3RzdiQW9wYUdoRTZwR1VzZzVmdWx0ZlRFTGUwOFd1RSI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MzA6Imh0dHBzOi8vbWFpbC5hYXJ5YW5uLmNvbS9sb2dpbiI7czo1OiJyb3V0ZSI7czo1OiJsb2dpbiI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fX0=', 1769429707),
('336ksVckOQhNUPnVrcEEZ3gCoBcM8ha3rGwaij5Z', NULL, '173.252.127.9', 'Mozilla/5.0 (iPhone; CPU iPhone OS 26_2 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Mobile/23C55 [FBAN/FBIOS;FBAV/544.0.0.32.278;FBBV/860466667;FBDV/iPhone14,5;FBMD/iPhone;FBSN/iOS;FBSV/26.2;FBSS/3;FBID/phone;FBLC/en_US;FBOP/5;FBRV/868588164]', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiaG52MzR2R0pKWXZuRGdYUnlNZ1pteWRxTTRSZndzenhkQTVRcmFsVyI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjU6Imh0dHBzOi8vYWFyeWFubi5jb20vbG9naW4iO3M6NToicm91dGUiO3M6NToibG9naW4iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769432968),
('4OHzF5oEbiJDQmODtjlHK6xhPD7zWVtXO6PN6HXs', NULL, '182.44.67.97', 'Mozilla/5.0 (iPhone; CPU iPhone OS 13_2_3 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.0.3 Mobile/15E148 Safari/604.1', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiRU5XQmxZVUF3azN1bDRtRThxR2FzZG9XYmd6UTVxbVhWQm1hSUw2ZSI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjM6Imh0dHBzOi8vd3d3LmFhcnlhbm4uY29tIjtzOjU6InJvdXRlIjtzOjI3OiJnZW5lcmF0ZWQ6OjQ2MGNsWVVEU1hqZG1meXgiO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769444177),
('4Pe4jBEfwArTo8zUoszQOew2zudRESzzLuiP2M81', NULL, '173.252.95.13', 'Mozilla/5.0 (iPhone; CPU iPhone OS 26_2 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Mobile/23C55 [FBAN/FBIOS;FBAV/544.0.0.32.278;FBBV/860466667;FBDV/iPhone16,2;FBMD/iPhone;FBSN/iOS;FBSV/26.2;FBSS/3;FBID/phone;FBLC/en_US;FBOP/5;FBRV/868042856]', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiNlZXY2J3REdaYm43SVZ5dlhxRUZxb2FtWUpjSmtMejhaT3ozQkswayI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjU6Imh0dHBzOi8vYWFyeWFubi5jb20vbG9naW4iO3M6NToicm91dGUiO3M6NToibG9naW4iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769420113),
('4YB5knfwtGmz36PrNZBx2pfR8M5gpRqoW9UpzCdB', NULL, '43.228.125.75', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiNFZlcnd1WUhRWmlENG54NDA3S2dtSnhlYVRLR3J2bDRnamM2U3VnYiI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6Mjk6Imh0dHBzOi8vd3d3LmFhcnlhbm4uY29tL2xvZ2luIjtzOjU6InJvdXRlIjtzOjU6ImxvZ2luIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319fQ==', 1769441052),
('5fDvDPG2aGEgSPhYlgO9gd8JcHtzAPqekgGVyCxj', NULL, '185.247.137.162', 'Mozilla/5.0 (compatible; InternetMeasurement/1.0; +https://internet-measurement.com/)', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiRkFWaTY5WGl6R3NobjdVRGcxaVN6T3dZNEdkMHFaWlpFRWFpNHBCdyI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6Mjk6Imh0dHBzOi8vd3d3LmFhcnlhbm4uY29tL2xvZ2luIjtzOjU6InJvdXRlIjtzOjU6ImxvZ2luIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319fQ==', 1769439942),
('5rX4QbHdV9K35RBJqUgra7AI2l3SZacejwp32xUF', NULL, '43.228.125.75', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoib3V6d2lsR1lZMmYwMWdKZ3FQVnBlSHBTU2FXRWNBTHFWam9XQmtSeiI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjU6Imh0dHBzOi8vYWFyeWFubi5jb20vbG9naW4iO3M6NToicm91dGUiO3M6NToibG9naW4iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769441052),
('5YjL2EKbLGcT459525e2kjiUGTFzqZ744ejI6VyX', NULL, '43.228.125.75', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiNzhTU0NLd3kyWlNrTk9zUnEyN2RlN0tNWklhRGxLc0RURWl2RHA4bCI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjQ6Imh0dHBzOi8vbWFpbC5hYXJ5YW5uLmNvbSI7czo1OiJyb3V0ZSI7czoyNzoiZ2VuZXJhdGVkOjo0NjBjbFlVRFNYamRtZnl4Ijt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319fQ==', 1769441051),
('6r9MgOcCwyvpYvm84ddrxtMPPj61wR6x6zF301Xx', NULL, '66.249.68.7', 'Mozilla/5.0 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiem4yYkFGdHlkOUx4NnJvcFZSQ2hHemlPSm1naVA2cU5vYTlsWG1mQSI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjU6Imh0dHBzOi8vYWFyeWFubi5jb20vbG9naW4iO3M6NToicm91dGUiO3M6NToibG9naW4iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769426686),
('8j322y08zx5Y2qY3Av8lbUHXxjEto3HiCUAWSRvu', NULL, '43.155.129.131', 'Mozilla/5.0 (iPhone; CPU iPhone OS 13_2_3 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.0.3 Mobile/15E148 Safari/604.1', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiUnRab2pEeWdNbkN5ZW4xbEVlcDc1eEF6Q1l0ZlBGT3F6NVRyY0xuViI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6Mjk6Imh0dHBzOi8vd3d3LmFhcnlhbm4uY29tL2xvZ2luIjtzOjU6InJvdXRlIjtzOjU6ImxvZ2luIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319fQ==', 1769439825),
('8MMdVSyv2B6dDsjNXtVG6qM8rdUA9UWQij0CbNYZ', NULL, '45.148.10.154', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.124 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiS2JveW52a0dBcE1QN2dVRUdVMU5jUzh5Z1dOb0l4WnBjUVN3c080SyI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjU6Imh0dHBzOi8vYWFyeWFubi5jb20vbG9naW4iO3M6NToicm91dGUiO3M6NToibG9naW4iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769442863),
('bweNangTtwEJLyxJp6VTi1j8qKII93JwpvBEgc2D', NULL, '67.205.171.37', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.124 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiUEE5RkJ0TGFRbGRKd0JKR0hOTkhMQWNJeE4xYWxiSzJ5QVFudGtzSyI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6NDc6Imh0dHBzOi8vbWFpbC5hYXJ5YW5uLmNvbS9wdWJsaWMvaW5kZXgucGhwL2xvZ2luIjtzOjU6InJvdXRlIjtzOjU6ImxvZ2luIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319fQ==', 1769429707),
('chjziFhl054nZma5JFSkMpIy3ew2K1RZNtzNYIcu', NULL, '43.158.91.71', 'Mozilla/5.0 (iPhone; CPU iPhone OS 13_2_3 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.0.3 Mobile/15E148 Safari/604.1', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiQkxYcDBJT1B6bzB6QTZqcU5xUnQ0YzhMOU4wRUxEZ2k0RElsZ3VWbCI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MTk6Imh0dHBzOi8vYWFyeWFubi5jb20iO3M6NToicm91dGUiO3M6Mjc6ImdlbmVyYXRlZDo6NDYwY2xZVURTWGpkbWZ5eCI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fX0=', 1769438811),
('CrjIIHBKUEJI39G9VvPsdbZxJiBVdN7UmcB6LKwz', NULL, '45.148.10.154', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.124 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoic2Z5YklwU0hoUXY3S0ZxZnpDeG1TTHVnbmJvb2pwN0RLTFVhMG9zOSI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MTk6Imh0dHBzOi8vYWFyeWFubi5jb20iO3M6NToicm91dGUiO3M6Mjc6ImdlbmVyYXRlZDo6NDYwY2xZVURTWGpkbWZ5eCI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fX0=', 1769442865),
('fc6LAkNbdKw3XavwVPQvFM26R2RkxcyaYDaIGmHb', NULL, '43.157.147.3', 'Mozilla/5.0 (iPhone; CPU iPhone OS 13_2_3 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.0.3 Mobile/15E148 Safari/604.1', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoieXROUm50d2doUTZIcTlCZ2llZldPV3RpZFdpRnNNTmdMZmljbUJ1eCI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjM6Imh0dHBzOi8vd3d3LmFhcnlhbm4uY29tIjtzOjU6InJvdXRlIjtzOjI3OiJnZW5lcmF0ZWQ6OjQ2MGNsWVVEU1hqZG1meXgiO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769442195),
('Fgdwcnavs6EXKxPjNG56YVOyF1i1NYfcSuD1RNGG', NULL, '66.249.68.7', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/99.0.4844.84 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiSHdFUTNKQ2ZMUU9iajNtMDQ4ekNidUVIR2IyWWNjVGhSbWJTaFpqdiI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjU6Imh0dHBzOi8vYWFyeWFubi5jb20vbG9naW4iO3M6NToicm91dGUiO3M6NToibG9naW4iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769426686),
('GLnreHix6UdjLXPLlIAbA3eLOphDbVFTBewo7PhF', NULL, '67.205.171.37', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.124 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoid2djenREeWdkWkJpR1ZWbXdiN3dLZHZ5bHU0OURDWXVFUU9BZnk2aiI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjQ6Imh0dHBzOi8vbWFpbC5hYXJ5YW5uLmNvbSI7czo1OiJyb3V0ZSI7czoyNzoiZ2VuZXJhdGVkOjphQnZFeDYwOHhrbVNBVFdOIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319fQ==', 1769429707),
('GxQFPPPWOgNzXz28QZdOe9GhHnpi303YQI17npxu', NULL, '182.44.67.97', 'Mozilla/5.0 (iPhone; CPU iPhone OS 13_2_3 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.0.3 Mobile/15E148 Safari/604.1', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiaFZvUFM1M3pqN1dacEZka3FYbVZmcEZIaHFBbmo2dlV6N2pWQVAxdCI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6Mjk6Imh0dHBzOi8vd3d3LmFhcnlhbm4uY29tL2xvZ2luIjtzOjU6InJvdXRlIjtzOjU6ImxvZ2luIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319fQ==', 1769444179),
('H55LqxaUxbwTm246bNcJdUhWeK8Qz0MpQuUIlWFo', NULL, '173.252.95.17', 'facebookexternalhit/1.1 (+http://www.facebook.com/externalhit_uatext.php)', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiTm5MdXBvT1dsb012Z0M2NVJiOTNUa0l0bEdrckhtUU1PQlZpYjJyViI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjU6Imh0dHBzOi8vYWFyeWFubi5jb20vbG9naW4iO3M6NToicm91dGUiO3M6NToibG9naW4iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769443493),
('ILb02dsPTbDyLGPG9TiSIHAKmbJId3JYKZbr6hmb', NULL, '34.228.145.49', 'HTMLParser/1.6', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoieU9EYjVCZFpZZ1RmUTA0RGp1dW01WXczWUZEcGprZGxsTGp3MDlVdCI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MTk6Imh0dHBzOi8vYWFyeWFubi5jb20iO3M6NToicm91dGUiO3M6Mjc6ImdlbmVyYXRlZDo6NDYwY2xZVURTWGpkbWZ5eCI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fX0=', 1769452924),
('iNQJsA181ElsttJQyiDXzBfykayiHDzMRJvJ2sLk', 2, '185.24.60.18', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 Safari/537.36 Edg/144.0.0.0', 'YTo0OntzOjY6Il90b2tlbiI7czo0MDoiUElBQjdrMWJWa1Y3dVNWTEJkNTROV1JKMVR1Q0plemhDSDNJbWt1cSI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6NTM6Imh0dHBzOi8vd3d3LmFhcnlhbm4uY29tL2N1c3RvbWVycy8xODIvYWxsLXNhbGVzL3ByaW50IjtzOjU6InJvdXRlIjtzOjI1OiJjdXN0b21lcnMuYWxsLXNhbGVzLnByaW50Ijt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319czo1MDoibG9naW5fd2ViXzU5YmEzNmFkZGMyYjJmOTQwMTU4MGYwMTRjN2Y1OGVhNGUzMDk4OWQiO2k6Mjt9', 1769432216),
('JdKvBI5NCbZN6oz8ZvEFE2lOaGMOCQWOgeG517R4', NULL, '45.148.10.154', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.124 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiM2NWWUpOWHl1Z3pETWZGNU9Fc0RTMDlsb2lZRU5RVmxybGowV2dvaiI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjU6Imh0dHBzOi8vYWFyeWFubi5jb20vbG9naW4iO3M6NToicm91dGUiO3M6NToibG9naW4iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769442891),
('JeiJgGFIFSfiuuhYVztHju4UzAk0CtEytEy6m6BQ', NULL, '173.252.82.112', 'Mozilla/5.0 (iPhone; CPU iPhone OS 26_2 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Mobile/23C55 [FBAN/FBIOS;FBAV/544.0.0.32.278;FBBV/860466667;FBDV/iPhone16,2;FBMD/iPhone;FBSN/iOS;FBSV/26.2;FBSS/3;FBID/phone;FBLC/en_US;FBOP/5;FBRV/868588164]', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiaVF4aU50VTFtY1FIdVlwRmJtR2c3eG1DdjhCSTl4RWc5b1gwajJxeiI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjU6Imh0dHBzOi8vYWFyeWFubi5jb20vbG9naW4iO3M6NToicm91dGUiO3M6NToibG9naW4iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769437349),
('kiqUcpEl8ro3U6QxySK9r2bBZqbP6JrxC7TTAbmc', NULL, '37.27.51.131', 'Mozilla/5.0 (compatible; SERankingBacklinksBot/1.0; +https://seranking.com/backlinks-crawler)', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoic040RVZiUDJNVnQyMEtnM2tHY1d4VllWVEpQT3R4dGJyZEZhd3RWOSI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjU6Imh0dHBzOi8vYWFyeWFubi5jb20vbG9naW4iO3M6NToicm91dGUiO3M6NToibG9naW4iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769443409),
('kxwDkvH4Uf5oXtobtJGwhnuMp3biOEYHRqiXXau9', NULL, '43.228.125.75', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiMjRuZ0JiQ3J6Ulpjd255YjI3eHU5M3FmTWRIUWFzbUZ6TmlGdnRKWCI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjM6Imh0dHBzOi8vd3d3LmFhcnlhbm4uY29tIjtzOjU6InJvdXRlIjtzOjI3OiJnZW5lcmF0ZWQ6OjQ2MGNsWVVEU1hqZG1meXgiO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769441052),
('l5XEqLKOnVxvdkd5mLYnrQAX7cQuGsr8tus139wj', NULL, '46.101.106.24', 'Mozilla/5.0 (X11; Linux x86_64; rv:142.0) Gecko/20100101 Firefox/142.0', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiM2hJMlZNYjc1WVF3Y1ZDaVFrNVJ2RUh0NTFKQ3NWV21WSFRiWWZjOCI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjU6Imh0dHBzOi8vYWFyeWFubi5jb20vbG9naW4iO3M6NToicm91dGUiO3M6NToibG9naW4iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769432734),
('NUYiB6Q4Dbj9My00KwmiO1zUYDb12oJKNA8AZYa1', 2, '130.193.206.203', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 Safari/537.36 Edg/144.0.0.0', 'YTo0OntzOjY6Il90b2tlbiI7czo0MDoiT2FZdzJrZUtEQUhmM2hlQ3dQMmZVSWZOUTJrZXBRS29uWGFlb3psYiI7czo1MDoibG9naW5fd2ViXzU5YmEzNmFkZGMyYjJmOTQwMTU4MGYwMTRjN2Y1OGVhNGUzMDk4OWQiO2k6MjtzOjk6Il9wcmV2aW91cyI7YToyOntzOjM6InVybCI7czo1OToiaHR0cHM6Ly9hYXJ5YW5uLmNvbS9kYXNoYm9hcmQ/Y3VycmVuY3k9YWxsJmRhdGVfcmFuZ2U9dG9kYXkiO3M6NToicm91dGUiO3M6OToiZGFzaGJvYXJkIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319fQ==', 1769424966),
('oGLJVSMTDocWyqLjDfI7VwLN5Eu68aYimA9gdngY', 2, '130.193.211.246', 'Mozilla/5.0 (Linux; Android 10; K) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/143.0.0.0 Mobile Safari/537.36', 'YTo1OntzOjY6Il90b2tlbiI7czo0MDoiM3FHSnpnWmFXazBpeUc5N2duZkVudVJOMlFOMHhVZE5OSnZhR3dYUSI7czozOiJ1cmwiO2E6MDp7fXM6OToiX3ByZXZpb3VzIjthOjI6e3M6MzoidXJsIjtzOjI1OiJodHRwczovL2Fhcnlhbm4uY29tL2xvZ2luIjtzOjU6InJvdXRlIjtzOjU6ImxvZ2luIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319czo1MDoibG9naW5fd2ViXzU5YmEzNmFkZGMyYjJmOTQwMTU4MGYwMTRjN2Y1OGVhNGUzMDk4OWQiO2k6Mjt9', 1769426717),
('oTHLpih5ffAeSzgdcaF5yXImzUU5cTpxQtC3F8FC', NULL, '43.157.147.3', 'Mozilla/5.0 (iPhone; CPU iPhone OS 13_2_3 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.0.3 Mobile/15E148 Safari/604.1', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiczVCcmN1YmpyalFsVEkyd05UME9RMk9RZkJucHFLUEFjdWJYVGRDSCI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6Mjk6Imh0dHBzOi8vd3d3LmFhcnlhbm4uY29tL2xvZ2luIjtzOjU6InJvdXRlIjtzOjU6ImxvZ2luIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319fQ==', 1769442196),
('P2iOHQPDR7CcUZ9ZTRh27HGB9Rbu1IshOXQZFrWn', NULL, '43.228.125.75', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoic3BlcTRmZTB1aE84V0NYejZXSVJvZDJLS0c2Y2JGdjZBN2lVSXZIYiI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MzA6Imh0dHBzOi8vbWFpbC5hYXJ5YW5uLmNvbS9sb2dpbiI7czo1OiJyb3V0ZSI7czo1OiJsb2dpbiI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fX0=', 1769441053),
('pd7eXFLNMZX52HNqN5HleymTZ0ph2tKM1ZwnpEHk', NULL, '43.228.125.75', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoidkcySGNyd1U3T0M5QXlVMDlMenNNTEdzTnFYazl1THMzZENoSDZCeSI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjQ6Imh0dHBzOi8vbWFpbC5hYXJ5YW5uLmNvbSI7czo1OiJyb3V0ZSI7czoyNzoiZ2VuZXJhdGVkOjo0NjBjbFlVRFNYamRtZnl4Ijt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319fQ==', 1769441054),
('Pye5aUbDle3AWrgqBDPdnzDNXuGQwjo5gnRjCkwf', NULL, '37.27.51.131', 'Mozilla/5.0 (compatible; SERankingBacklinksBot/1.0; +https://seranking.com/backlinks-crawler)', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiYlJpdEhrbThuQXdFU2g2VWlCSWZrSEZqVWtCOXM4cWRwVnRZWnhzeSI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjU6Imh0dHBzOi8vYWFyeWFubi5jb20vbG9naW4iO3M6NToicm91dGUiO3M6NToibG9naW4iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769443407),
('Q8841NitCAGsE2otIbLBMjMsuzWfTOniUJLzkUG8', NULL, '43.228.125.75', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoia3FHSkpPU2tzWE1NYzR6WDBXSWZ5ZWpKZFJTaW9TYmE4UjcyRWdKMiI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MzA6Imh0dHBzOi8vbWFpbC5hYXJ5YW5uLmNvbS9sb2dpbiI7czo1OiJyb3V0ZSI7czo1OiJsb2dpbiI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fX0=', 1769441055),
('S0Zn4BTKvLTrMJnlER2FsyqfszhWFOUxMOEhzgcQ', NULL, '45.148.10.154', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.124 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiWVJkSXNGUUFiWTlMTW85WDlJUWM5NXJDS3lJSVdDYUVCOFdwS3RjZyI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MTk6Imh0dHBzOi8vYWFyeWFubi5jb20iO3M6NToicm91dGUiO3M6Mjc6ImdlbmVyYXRlZDo6NDYwY2xZVURTWGpkbWZ5eCI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fX0=', 1769442861),
('S5JbIR1Nt8onw1FkHebFSoPiaeJ2mdGnLnpZwcf2', NULL, '43.153.96.79', 'Mozilla/5.0 (iPhone; CPU iPhone OS 13_2_3 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.0.3 Mobile/15E148 Safari/604.1', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiOGsxcmVMVmhvSTVzQWxrWHpRUDcxTnlOVzM4b0VVNWF0RHpNdTdLMSI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6Mjk6Imh0dHBzOi8vd3d3LmFhcnlhbm4uY29tL2xvZ2luIjtzOjU6InJvdXRlIjtzOjU6ImxvZ2luIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319fQ==', 1769422408),
('sqMaot2LsARdLWLejOZL4CGNnnLwvhYY9ELSI38V', NULL, '45.148.10.154', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.124 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiZVlyRXRvdUx6TG9COEtoWkZRd0F0WXhoQ3Q0alFIMU1TNGNwZTA1eCI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjU6Imh0dHBzOi8vYWFyeWFubi5jb20vbG9naW4iO3M6NToicm91dGUiO3M6NToibG9naW4iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769442867),
('TJF1GkUAHxqr0JpACFkojBJhfzpgUfeGQp9h1Uoa', NULL, '173.252.95.2', 'Mozilla/5.0 (iPhone; CPU iPhone OS 18_7 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/26.2 Mobile/15E148 Safari/604.1', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiMjdkM3Nsb3pmeWtmN2dZSFhjMmlaOHg3QjBiTkdRd3ZvOTdrc0JhVCI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjU6Imh0dHBzOi8vYWFyeWFubi5jb20vbG9naW4iO3M6NToicm91dGUiO3M6NToibG9naW4iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769443458),
('tLSQZVFRFAkgsHnovs6kejuPWM31U25xwyRbAypi', NULL, '66.249.68.6', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/143.0.7499.192 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiM012ZzNsd2ZFbXJtNTNlQk5vazB6dFVJQmIwQ3dod1dSZ1gwRDJGSSI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjU6Imh0dHBzOi8vYWFyeWFubi5jb20vbG9naW4iO3M6NToicm91dGUiO3M6NToibG9naW4iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769447383),
('TnAgWAChqxFdksbhpvvigxYwvA9CMxhvCFn7eZcZ', NULL, '185.247.137.162', 'Mozilla/5.0 (compatible; InternetMeasurement/1.0; +https://internet-measurement.com/)', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiYlRqcU5WcFp5dEh1MTZQMXJtYTg3Mk5KcERyQmdTdnZYMEV4Z2JDciI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjM6Imh0dHBzOi8vd3d3LmFhcnlhbm4uY29tIjtzOjU6InJvdXRlIjtzOjI3OiJnZW5lcmF0ZWQ6OjQ2MGNsWVVEU1hqZG1meXgiO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769439942),
('TOIJaFhreduD0bwJT7Nr6HsA049OcEZm9ctgDHEu', NULL, '43.228.125.75', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiQjZmRElLNlZmSnBCT2swOGxmd1lMcEZhNnpsOUVJSjhLS09hbGdFayI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MTk6Imh0dHBzOi8vYWFyeWFubi5jb20iO3M6NToicm91dGUiO3M6Mjc6ImdlbmVyYXRlZDo6NDYwY2xZVURTWGpkbWZ5eCI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fX0=', 1769441051),
('urmXfbJsepdvrVzJ4JARVclhAYOitWKTNv6CAkqP', NULL, '34.228.145.49', 'Mediapartners-Google', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiUjJHZlpweFo2Q1BxNDRRelFETmh6dFBlT3dSb0pKMndRSzI4YkQxYSI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjU6Imh0dHBzOi8vYWFyeWFubi5jb20vbG9naW4iO3M6NToicm91dGUiO3M6NToibG9naW4iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769452925),
('vkVFt182cQrSIu4spl2OnIo9QMsuI7wGPtSFTgB1', NULL, '45.148.10.154', '', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiR1RTMkttclJhUkJQa01PMXV4c0ltWGpmQW40eVRXck1lQnpKenl3QSI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MTk6Imh0dHBzOi8vYWFyeWFubi5jb20iO3M6NToicm91dGUiO3M6Mjc6ImdlbmVyYXRlZDo6NDYwY2xZVURTWGpkbWZ5eCI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fX0=', 1769442888),
('VpV2RwGmqjZ3A42nJa1ocj8Ocu6rEpI6aKLcFxBz', NULL, '45.148.10.154', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.124 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiZVpIMDhWV0FqWEpwT0FJRkRQN2dNZlplUEdXSWpWYjVoY3Q3cVRNMCI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MTk6Imh0dHBzOi8vYWFyeWFubi5jb20iO3M6NToicm91dGUiO3M6Mjc6ImdlbmVyYXRlZDo6NDYwY2xZVURTWGpkbWZ5eCI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fX0=', 1769442889),
('w7d8Fgwq4rGu1EZTtOSjukM8ZIHdGVsLEPwuiI79', NULL, '67.205.171.37', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.124 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiZUNGeVBCeWI4QUxrNWY1UXprRnRsTWNVSkFGelBKZ2lsZFNNNElXOSI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6NjM6Imh0dHBzOi8vbWFpbC5hYXJ5YW5uLmNvbS9wdWJsaWMvaW5kZXgucGhwP3JvdXRlPWNoZWNrb3V0JTJGY2FydCI7czo1OiJyb3V0ZSI7czoyNzoiZ2VuZXJhdGVkOjphQnZFeDYwOHhrbVNBVFdOIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319fQ==', 1769429707),
('Wv8ZzMMfO8UpIlVYYPzhi5XKVdz8O68vy7TbGmXk', NULL, '43.166.242.189', 'Mozilla/5.0 (iPhone; CPU iPhone OS 13_2_3 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.0.3 Mobile/15E148 Safari/604.1', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiM3ZkZkJMQjRqa0JTT3had3plSEN6YkZMMEtqejVVVWkxd1F1M2kxYSI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MTk6Imh0dHBzOi8vYWFyeWFubi5jb20iO3M6NToicm91dGUiO3M6Mjc6ImdlbmVyYXRlZDo6YUJ2RXg2MDh4a21TQVRXTiI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fX0=', 1769419503),
('XGplriLXGWHG2D6IlBxk8C3ny16yPo1Uq6MtULFQ', NULL, '43.166.242.189', 'Mozilla/5.0 (iPhone; CPU iPhone OS 13_2_3 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.0.3 Mobile/15E148 Safari/604.1', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiUHFXRExjeFBCM1hlQjE5VktqSGliTlZrbXVoZHhiaWdiRmViTTdaYSI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjU6Imh0dHBzOi8vYWFyeWFubi5jb20vbG9naW4iO3M6NToicm91dGUiO3M6NToibG9naW4iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769419504),
('xmnyboTh5AbwIUsfUxPg2Ranj3g7UdGhEXUf4Nlp', NULL, '43.155.129.131', 'Mozilla/5.0 (iPhone; CPU iPhone OS 13_2_3 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.0.3 Mobile/15E148 Safari/604.1', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiNDRVZjVXdVhTVEtZVE04c3phNDAzdTRVcWtvNXhKY3RvM1dYTVM3TiI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjM6Imh0dHBzOi8vd3d3LmFhcnlhbm4uY29tIjtzOjU6InJvdXRlIjtzOjI3OiJnZW5lcmF0ZWQ6OjQ2MGNsWVVEU1hqZG1meXgiO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769439824),
('XZqEfpR1e11EpmaQXFb6ILMjo2NTVfc2U34yZ9G4', NULL, '43.158.91.71', 'Mozilla/5.0 (iPhone; CPU iPhone OS 13_2_3 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.0.3 Mobile/15E148 Safari/604.1', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiWnZIRjU4cXAxYXlVTkFNUDdud0ZBb0tLT1l5VG9iZVpaMlhETWRPcyI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjU6Imh0dHBzOi8vYWFyeWFubi5jb20vbG9naW4iO3M6NToicm91dGUiO3M6NToibG9naW4iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769438812),
('YEID9b9QJYqgiX9zE5M4ddb7q9GAv0iyFzTAojYx', NULL, '43.153.96.79', 'Mozilla/5.0 (iPhone; CPU iPhone OS 13_2_3 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.0.3 Mobile/15E148 Safari/604.1', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiaFZXOTYzenRCMndUS0Z1Ym9ydGg4eWZPMXNQMGUwb3ZvWUV5azFyTyI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MjM6Imh0dHBzOi8vd3d3LmFhcnlhbm4uY29tIjtzOjU6InJvdXRlIjtzOjI3OiJnZW5lcmF0ZWQ6OmFCdkV4NjA4eGttU0FUV04iO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1769422407);

-- --------------------------------------------------------

--
-- Table structure for table `suppliers`
--

CREATE TABLE `suppliers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `company_name` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `address` text DEFAULT NULL,
  `balance_iqd` float NOT NULL DEFAULT 0,
  `balance_usd` float NOT NULL DEFAULT 0,
  `notes` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `suppliers`
--

INSERT INTO `suppliers` (`id`, `name`, `company_name`, `phone`, `email`, `address`, `balance_iqd`, `balance_usd`, `notes`, `created_at`, `updated_at`) VALUES
(1, 'مةواد', 'مام ئاكو غةسالة', NULL, NULL, NULL, 0, 0, NULL, '2026-01-04 18:13:59', '2026-01-04 18:13:59');

-- --------------------------------------------------------

--
-- Table structure for table `units`
--

CREATE TABLE `units` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `name_en` varchar(255) DEFAULT NULL,
  `symbol` varchar(255) DEFAULT NULL,
  `type` enum('base','packed') NOT NULL DEFAULT 'base',
  `description` text DEFAULT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `units`
--

INSERT INTO `units` (`id`, `name`, `name_en`, `symbol`, `type`, `description`, `is_active`, `created_at`, `updated_at`) VALUES
(1, 'دانە', NULL, 'PCS', 'base', NULL, 1, '2025-12-25 06:38:41', '2025-12-25 06:38:41'),
(2, 'تەن', NULL, 'TN', 'base', NULL, 1, '2025-12-25 06:38:50', '2025-12-25 06:38:50'),
(3, 'جووت', NULL, 'BTH', 'base', NULL, 1, '2025-12-25 06:39:00', '2025-12-25 06:39:00'),
(4, 'مەتر', NULL, 'M', 'base', NULL, 1, '2025-12-25 06:39:16', '2025-12-25 06:39:16'),
(5, 'جار', NULL, 'TIMS', 'base', NULL, 1, '2025-12-25 20:07:14', '2025-12-25 20:07:14'),
(6, 'داگرتن', NULL, 'TB', 'base', NULL, 1, '2025-12-25 20:09:32', '2025-12-25 20:09:32'),
(7, 'سەند', NULL, 'S', 'base', NULL, 1, '2025-12-25 20:40:53', '2025-12-25 20:40:53');

-- --------------------------------------------------------

--
-- Table structure for table `unit_conversions`
--

CREATE TABLE `unit_conversions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `from_unit_id` bigint(20) UNSIGNED NOT NULL,
  `to_unit_id` bigint(20) UNSIGNED NOT NULL,
  `conversion_factor` float NOT NULL,
  `notes` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) NOT NULL,
  `role` enum('admin','user') NOT NULL DEFAULT 'user',
  `remember_token` varchar(100) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `email_verified_at`, `password`, `role`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 'Admin', 'admin@beglas.com', NULL, '$2y$12$EFlKGhTSSILF86waWQ14a.I4iQeCWCWSBoqdLG2Q1LHWadX8zq/De', 'admin', 'U0NxWwtoq5SMWus4OsiJdTBwSOKtkbIlhEMxr0NkNyL4rOOUaJxmMNYfAZhf', '2025-12-25 06:32:27', '2025-12-25 16:41:38'),
(2, 'محمد', 'muhammed@gmail.com', NULL, '$2y$12$DOe5CMcAlzryGTrXLdQX0uK.bU7IspcCtFQ4IrzXrCkVY3MF0U.kW', 'admin', 'HpCZftqae6eTwA213v9mmr6HeMZCT8v1Qs0JwVVIPqjCQyafS2cxFAKYRZeE', '2025-12-25 16:19:19', '2025-12-27 16:03:50'),
(3, 'عمر', 'omer@gmail.com', NULL, '$2y$12$jQ.qth0B.tL/.TKe4OZriOKLX8OG2HwAvs7KN47ljmR1wEDi28ley', 'admin', 'TcD4tVedO9yeCu19JnC2E9Enrd7Rnoynv7vTZcVSibWgGfXVxwekG4SrRf3P', '2025-12-28 18:41:01', '2025-12-28 18:41:01');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `balances`
--
ALTER TABLE `balances`
  ADD PRIMARY KEY (`id`),
  ADD KEY `balances_customer_id_currency_created_at_index` (`customer_id`,`currency`,`created_at`);

--
-- Indexes for table `cache`
--
ALTER TABLE `cache`
  ADD PRIMARY KEY (`key`);

--
-- Indexes for table `cache_locks`
--
ALTER TABLE `cache_locks`
  ADD PRIMARY KEY (`key`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `company`
--
ALTER TABLE `company`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `customers`
--
ALTER TABLE `customers`
  ADD PRIMARY KEY (`id`),
  ADD KEY `customers_negative_balance_iqd_negative_balance_usd_index` (`negative_balance_iqd`,`negative_balance_usd`);

--
-- Indexes for table `expenses`
--
ALTER TABLE `expenses`
  ADD PRIMARY KEY (`id`),
  ADD KEY `expenses_currency_index` (`currency`),
  ADD KEY `expenses_expense_date_index` (`expense_date`),
  ADD KEY `expenses_user_id_index` (`user_id`);

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Indexes for table `jobs`
--
ALTER TABLE `jobs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `jobs_queue_index` (`queue`);

--
-- Indexes for table `job_batches`
--
ALTER TABLE `job_batches`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `password_reset_tokens`
--
ALTER TABLE `password_reset_tokens`
  ADD PRIMARY KEY (`email`);

--
-- Indexes for table `payments`
--
ALTER TABLE `payments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `payments_sale_id_foreign` (`sale_id`),
  ADD KEY `payments_purchase_id_foreign` (`purchase_id`),
  ADD KEY `payments_user_id_foreign` (`user_id`),
  ADD KEY `payments_type_payment_date_index` (`type`,`payment_date`),
  ADD KEY `payments_customer_id_payment_date_index` (`customer_id`,`payment_date`),
  ADD KEY `payments_supplier_id_payment_date_index` (`supplier_id`,`payment_date`),
  ADD KEY `payments_payment_method_status_index` (`payment_method`,`status`),
  ADD KEY `payments_excess_amount_debt_reduction_index` (`excess_amount`,`debt_reduction`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `products_code_unique` (`code`),
  ADD UNIQUE KEY `products_barcode_unique` (`barcode`),
  ADD KEY `products_category_id_foreign` (`category_id`),
  ADD KEY `products_base_unit_id_foreign` (`base_unit_id`),
  ADD KEY `products_purchase_unit_id_foreign` (`purchase_unit_id`),
  ADD KEY `products_sale_unit_id_foreign` (`sale_unit_id`);

--
-- Indexes for table `purchases`
--
ALTER TABLE `purchases`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `purchases_invoice_number_unique` (`invoice_number`),
  ADD KEY `purchases_supplier_id_foreign` (`supplier_id`),
  ADD KEY `purchases_user_id_foreign` (`user_id`);

--
-- Indexes for table `purchase_items`
--
ALTER TABLE `purchase_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `purchase_items_purchase_id_foreign` (`purchase_id`),
  ADD KEY `purchase_items_product_id_foreign` (`product_id`);

--
-- Indexes for table `sales`
--
ALTER TABLE `sales`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `sales_invoice_number_unique` (`invoice_number`),
  ADD KEY `sales_customer_id_foreign` (`customer_id`),
  ADD KEY `sales_user_id_foreign` (`user_id`);

--
-- Indexes for table `sale_items`
--
ALTER TABLE `sale_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `sale_items_sale_id_foreign` (`sale_id`),
  ADD KEY `sale_items_product_id_foreign` (`product_id`);

--
-- Indexes for table `sessions`
--
ALTER TABLE `sessions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `sessions_user_id_index` (`user_id`),
  ADD KEY `sessions_last_activity_index` (`last_activity`);

--
-- Indexes for table `suppliers`
--
ALTER TABLE `suppliers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `units`
--
ALTER TABLE `units`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `unit_conversions`
--
ALTER TABLE `unit_conversions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unit_conversions_from_unit_id_to_unit_id_unique` (`from_unit_id`,`to_unit_id`),
  ADD KEY `unit_conversions_to_unit_id_foreign` (`to_unit_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `balances`
--
ALTER TABLE `balances`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=33;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT for table `company`
--
ALTER TABLE `company`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `customers`
--
ALTER TABLE `customers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=298;

--
-- AUTO_INCREMENT for table `expenses`
--
ALTER TABLE `expenses`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `jobs`
--
ALTER TABLE `jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- AUTO_INCREMENT for table `payments`
--
ALTER TABLE `payments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=443;

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=60;

--
-- AUTO_INCREMENT for table `purchases`
--
ALTER TABLE `purchases`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `purchase_items`
--
ALTER TABLE `purchase_items`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `sales`
--
ALTER TABLE `sales`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=528;

--
-- AUTO_INCREMENT for table `sale_items`
--
ALTER TABLE `sale_items`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1010;

--
-- AUTO_INCREMENT for table `suppliers`
--
ALTER TABLE `suppliers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `units`
--
ALTER TABLE `units`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `unit_conversions`
--
ALTER TABLE `unit_conversions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `balances`
--
ALTER TABLE `balances`
  ADD CONSTRAINT `balances_customer_id_foreign` FOREIGN KEY (`customer_id`) REFERENCES `customers` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `expenses`
--
ALTER TABLE `expenses`
  ADD CONSTRAINT `expenses_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `payments`
--
ALTER TABLE `payments`
  ADD CONSTRAINT `payments_customer_id_foreign` FOREIGN KEY (`customer_id`) REFERENCES `customers` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `payments_purchase_id_foreign` FOREIGN KEY (`purchase_id`) REFERENCES `purchases` (`id`),
  ADD CONSTRAINT `payments_sale_id_foreign` FOREIGN KEY (`sale_id`) REFERENCES `sales` (`id`),
  ADD CONSTRAINT `payments_supplier_id_foreign` FOREIGN KEY (`supplier_id`) REFERENCES `suppliers` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `payments_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Constraints for table `products`
--
ALTER TABLE `products`
  ADD CONSTRAINT `products_base_unit_id_foreign` FOREIGN KEY (`base_unit_id`) REFERENCES `units` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `products_category_id_foreign` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `products_purchase_unit_id_foreign` FOREIGN KEY (`purchase_unit_id`) REFERENCES `units` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `products_sale_unit_id_foreign` FOREIGN KEY (`sale_unit_id`) REFERENCES `units` (`id`) ON DELETE SET NULL;

--
-- Constraints for table `purchases`
--
ALTER TABLE `purchases`
  ADD CONSTRAINT `purchases_supplier_id_foreign` FOREIGN KEY (`supplier_id`) REFERENCES `suppliers` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `purchases_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Constraints for table `purchase_items`
--
ALTER TABLE `purchase_items`
  ADD CONSTRAINT `purchase_items_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`),
  ADD CONSTRAINT `purchase_items_purchase_id_foreign` FOREIGN KEY (`purchase_id`) REFERENCES `purchases` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `sales`
--
ALTER TABLE `sales`
  ADD CONSTRAINT `sales_customer_id_foreign` FOREIGN KEY (`customer_id`) REFERENCES `customers` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `sales_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Constraints for table `sale_items`
--
ALTER TABLE `sale_items`
  ADD CONSTRAINT `sale_items_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`),
  ADD CONSTRAINT `sale_items_sale_id_foreign` FOREIGN KEY (`sale_id`) REFERENCES `sales` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `unit_conversions`
--
ALTER TABLE `unit_conversions`
  ADD CONSTRAINT `unit_conversions_from_unit_id_foreign` FOREIGN KEY (`from_unit_id`) REFERENCES `units` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `unit_conversions_to_unit_id_foreign` FOREIGN KEY (`to_unit_id`) REFERENCES `units` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
